{"review_id": "qb2EVdmVNvw3D0kBMN6Xrg", "user_id": "hXydWH25S92HjI5hmWRSyA", "business_id": "dJ0R-XT78LUQeNHQkD-G9g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to get ice cream. They have only two flavors but they can do so much with them. From milkshakes to mix-ins even treats for your four legged friends. It's inexpensive for all that you get. (Large ice cream cones can barely fit out the window) The staff are really nice too. They always make sure to get the order right. I believe that if you have the need to get ice cream I would definitely go here.", "date": "2018-08-14 04:03:02"}
{"review_id": "Ecr_pKR7786kmcLVXLp5NA", "user_id": "vo6vLeHoPl_h-Vt-YHs9_A", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Sorry to say, Nelias did not live up to the other reviews.  The restaurant is hardly a finished room, let alone comfortable.  Very greasy ribs.  Pork Adobo with potatoes??   Everything is homemade and the worker was nice, but that's it.", "date": "2015-12-05 23:21:39"}
{"review_id": "Ro6-JL0KCS5JULXUNRST-w", "user_id": "i1qyYL4fpAel8Ljt4WaZ3g", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wouldn't give it one star if I could. This place was disgusting,  should have left but gave it a shot and wasted $13. Baked beans were from a can, potatoes, blah, and the ribs were inedible! Hope the health department visits this place soon!", "date": "2015-08-07 19:33:13"}
{"review_id": "tuDIfqFjtj5zTLjtY9W1Hg", "user_id": "dUOg3fS3RTYDZUpu0CqqiA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Police Station Pizza has always been my favorite growing up. The pizza is borderline deep dish and delicious, but the experience is what makes it truly unique. \n\nPizza here is exclusively takeout, so upon walking in the front door you are asked how much you want. Don't bother telling them anything besides how much because that's all they need to know at this point. They will ask what toppings when they need to know.\n\nThe guys always remember who ordered what and how many. I don't ever recall seeing a calculator or notepad, so these guys seem to be going exclusively by memory. My memory tells me they just kept money in a cigar box, but I may be romanticizing that part.\n\nThey are definitely still watching Pens games on the same TV on which they probably watched Lemieux's first game in 1984. The TV is in an important spot; facing the guys making the pizza, so don't get your hopes up about hanging out and watching too much.\n\nGet the extra cheese unmelted. It'll be glorious when you get home.", "date": "2014-10-28 18:29:48"}
{"review_id": "zw3oXGWKQdVjST5UI9kM3g", "user_id": "k2Bsnh6CV0HFX8RgGR1p9A", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "There is nothing fancy about this place - it is just good food, reasonably priced and great people!  I stopped in for lunch and ate myself silly on Pork Adobo and Lumpia.  Awesome!  Ashamed to say I haven't tried their BBQ yet, but will very soon.", "date": "2013-04-13 15:58:06"}
{"review_id": "E0pUvxHQZPDXTPAHoCXMiw", "user_id": "RBcksn2N3NaV8fcYhL67ew", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 4, "funny": 0, "cool": 0, "text": "I go here for the filipino food they serve which are great. The adobo chicken or pork is yummy, the lumpia is delicious and the chicken on a stick is a must try. \n\nI have also tried the BBQ ribs and it was good. \n\nThe owner and everyone else there are very nice. The amount you get for the price is great, definitely try this place out and maybe  if your feeling adventurous for a different cuisine then don't hesitate to try any of the filipino food they offer.", "date": "2014-05-10 05:19:41"}
{"review_id": "NYapwdsUSWCqb0euExz3Mg", "user_id": "pTBL-Wq-PPcTnkb3mffIIA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Police Station Pizza is a great local favorite in Ambridge, Pennsylvania! No sitting - just take out. They make pizzas until they have made all that they have... You can get unbaked pizzas too. Price is great - fun to watch how they keep track of customer orders by just watching who has been standing awhile...", "date": "2012-11-11 01:00:10"}
{"review_id": "Fwj3ZX8alvOOaQTSeFNNTw", "user_id": "PrhPMpuwhoi9m7rLCvZJaQ", "business_id": "y3IVqEFHmrkgVKj2x1Ci4w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Well it's just a smaller place of course ( BUT VERY EFFICIENT ) . If you're looking for pet care items and maybe even some rare pets ; here you go ! Knowledgeable staff members take good care of things there ( not just workers hired \" off the street \" )", "date": "2018-06-27 13:12:45"}
{"review_id": "f0r2VrIuT4CN7_XG8bmSKA", "user_id": "oF8Efb3fBrwWZvmsl6e-pw", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 5, "funny": 0, "cool": 2, "text": "Filipino food in Pittsburgh!  Actually, Ambridge to be precise.\n\nI am so ashamed of myself for not getting here until today.  This place is amazing.  As a Filipino myself, this place reminds me very much of home cooking.\n\nI ate in for lunch and started with the lumpia - just think of an egg roll but without all the cheap cabbage.  Minced beef, carrots, celery and a sweet chili dipping sauce.  Delicious.\n\nAnd for lunch, chicken adobo with white rice.  This version is more of a red sauce with potatoes - not as vinegar-y but still right on.\n\nFriendly folks in there and delicious food plus the price was right.  I'll be back again!", "date": "2013-05-30 17:57:04"}
{"review_id": "DE0gRAZh45zjQSKHU8-O-g", "user_id": "0N91KZHstHSnKwJVRa2p2g", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "A cute little dinner, perfect for a quick breakfast. The decorations take you back in time, it looks like you jumped back into the 50's. The staff is helpful and friendly! Ask for Heidi to be your server, you won't be disappointed. There isn't a microwave in sight which is rare for diners. \n\nI ordered the scrambler and one pancake. My girlfriend got the eggs Benedict. My dish was a really large portion and it was cheap. I got bacon in my scrambler, which was a great choice. All of the ingredients were throughout the dish, nothing was missing and it was cooked perfectly. I wish I would have gotten two pancakes because it was so delicious! Very buttery and fluffy texture. \n\nThe Eggs Benedict was okay. The sauce was a bit lack luster, it didn't have much flavor. The eggs were cooked perfectly, the yolks were still nice and runny. Hard to find perfectly cooked eggs even at high class restaurants. The portion was just right, very filling. \n\nI was very pleased with the experience overall, I would definitely return in the future. It's a little too far from Pittsburgh to come often but it's a great place to get away from the hustle and bustle in the morning. A great local find!", "date": "2018-05-30 15:06:26"}
{"review_id": "fyYYXtxi_9Z0g1V1zfNMvg", "user_id": "OzMsPHu_r9crvfx8Ww2Kbw", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place isn't fine dining. It's barely a sit down. It is terrific BBQ and authentic Filipino food. The owner, Nelia, was busy with several large catering orders but talked with me the entire time. She also offered several samples of different menu items to try for free. The pulled pork was as good as any I've had. The bun was smaller than average which I liked because I don't want to be filled up from just the bun. The fries were fresh cut. She has a homemade vinegar dipping sauce with hot peppers, garlic, and ginger which I couldn't get enough of. The lumpia were delicious. She has homemade strawberry basil lemonade which was out of this world. \nFancy place? No. Great food and excellent friendly service? Yup!", "date": "2015-08-21 13:14:58"}
{"review_id": "QU0OAKM2d0UlH3hZ3_zPfw", "user_id": "65oKblsEEniuV_n8C1gtiA", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Friendly waitstaff, cute retro vibe, great food and prices! 4 stars only because we waited over an hour for two breakfast entrees.", "date": "2017-09-12 05:38:40"}
{"review_id": "DvJ7bqQfLcemKyG_STrZcA", "user_id": "48kTYbIwNp4Tb9nv3dkqog", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 5, "funny": 0, "cool": 1, "text": "I have been going to 'Police Station Pizza' for 40 years. I have always enjoyed it!\n\nOrdering experience can be somewhat different when crowded.  As soon you walk in, shout out the number of slices you are ordering. Then they eventually get around to you.  Doesn't take that long.", "date": "2011-10-02 02:05:25"}
{"review_id": "MrEt6PP_BEmXTDS3LgfwSQ", "user_id": "9p_vj2TD8G4kYsHT48z05g", "business_id": "Yjf0i2J9q52dYIT8UVGT3g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I had a wonderful experience at Heritage Floral ordering flowers for an ill co-worker. I had no problem finding the shop in Ambridge, and the interior was well-lit and pleasantly decorated. I had a general idea of what sort of arrangement to get, and the employee (Calet) was extremely helpful and friendly. She gave lots of good suggestions, too! \n\nIt was an all-around good experience!", "date": "2016-03-10 17:03:21"}
{"review_id": "1BMzQ49CRswYdVO6f5-ONw", "user_id": "LIHlbBXL5LsOyNpQVAU3lg", "business_id": "3gL18eXylqutlzqb6TmB0w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Bought 4 new tires and was very happy. Everything went according to plan and I felt that I received a fair deal.", "date": "2015-01-21 22:37:24"}
{"review_id": "PyvTok9i47gCR1D1rqlRKw", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 5, "funny": 0, "cool": 0, "text": "Drove by this place numerous times this year and finally decided to try the ribs the other day....really awesome!\n\nThe next day we decided to order dinner. Ribs were awesome, Pulled Pork was great and the wife said it was the best Chicken Salad she has ever had.\n\nGood prices and good portions, this is really a hidden treasure in good old Ambridge. Will keep coming back as long as they stay open.\n\nGo support this place and give it a try, I have a feeling you wont be disappointed.", "date": "2012-09-14 07:02:02"}
{"review_id": "7_RnYhxbAUXA5NabIkKR8A", "user_id": "4m9NXICYBC5i9t4aTt-I6w", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I stopped by here a couple of Saturday's ago with my wife for dinner.  We had read about Nelias on Yelp and had been looking forward to trying it.  Whenever we pulled up to the restaurant I have to admit that it wasn't exactly what I was expecting.  It was fairly small with a picnic table and large smoker in front.  The doors to head into the restaurant were made of streamer-like plastic.  Once inside we were facing the kitchen, a cash register and a soda cooler.  There was also a dining room next to this which I never did see since we ended up sitting outside at the picnic table.\n\nSince my wife and I were both interested in trying both the BBQ and Filipino food here, we decided to split a number of things.  We ended up ordering a half a rack of ribs with sides of fries and linguine pasta salad as well as a chicken on a stick with white rice and then pork adobo.  This was after we tried ordering fried rice instead of white rice and also chicken adobo instead of pork adobo, both of which they were out of.  After ordering we went outside and took a seat to wait for our food.  The first items out to us were the fries and pasta salad.  The fries looked like they were freshly cut, had a nice seasoning on them and tasted great when hot.  Meanwhile I wasn't expecting much out of the pasta salad.  It ended up exceeding my expectations though and was much better than expected.  As we were eating those two items our ribs came out next.  The ribs ended up being pretty good with the ones near the end of the rack being a bit tougher than I would have liked while the ones in the middle were falling off the bone.  Last but not least our pork adobo and chicken on a stick came out.  It looked like they had the exact same sauce on them so I was surprised by the very different flavors between the two.  Both of them ended up tasting really good and having tender and moist meat.\n\nThe bottom line for me is that I would head back to Nelias again in the future.  I don't know that I would make it the only reason to head out to Ambridge but would definitely give it a shot if you are going to be in the area.", "date": "2015-09-26 11:57:08"}
{"review_id": "EkdwDnFxZEGbeh402n4gVg", "user_id": "43ItWfGULw_zl1y4GeqWNA", "business_id": "3gL18eXylqutlzqb6TmB0w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "They specialize in tires, but they also do 4 wheel alignment, brakes, and oil changes. Service is top notch. Barry the owner runs the place, is on site, and oversees all of the work. Michelin is their main brand of tire.", "date": "2014-05-12 17:58:52"}
{"review_id": "aK6LlRe2I-7si5xc4gsR_g", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Pizza House or \"Police Station Pizza\" is always great. Cheap prices, great crust and toppings are great (Pepperoni is really good) never really had any problem here. Can get really busy, don't bother calling, just go down order and wait. Wait is usually short anyways.\n\nSquare pizza, sauce then cold toppings go on. By the time you get home it's all melted together perfect.\n\nHave only been to the Ambridge location so can't comment on other stores.\n\nThis and Franks are two of the best places around to get some great pizza!", "date": "2009-08-22 23:00:22"}
{"review_id": "ny7djwpbDMMW4CZ0Y5WGZg", "user_id": "oulGFePDk9PdLQFMjjifNw", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I have eaten here many times since they opened a few months ago.\n\nIt's clean, friendly, and the food is very good.  My favorite is the Pork Adobo.\n\nAnd the Lumpia.", "date": "2012-09-16 23:03:31"}
{"review_id": "2i7-imSTT0NT4pWajrPL2Q", "user_id": "wFFLWorAWh3hpxVLQP8YWw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "What more can you say an Ambridge tradition. Been eating this pizza for as long as I can remember. Carry out only. Always packed but fast service you holler out your order when you walk in and somehow  the counter guy remembers it and the order in which it was placed the price pay and your on your way no paper involved. The old police station next door (a large white brick structure)  is office building now and a movie location for a Net Flix TV series sometimes it looks like you traveled back in time. And it reminds you why Original Pizza House got the nickname of Police Station Pizza.", "date": "2016-11-27 08:01:52"}
{"review_id": "QSsEcKGn-Y9JrIMpOdSqkg", "user_id": "21D8GYYY-NptvXhBb9x08Q", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Simply the best pizza around PERIOD!  You just can't beat the price. Only downside is size of place. If it's busy and raining, you may find yourself outside waiting to get in.", "date": "2016-02-27 15:12:05"}
{"review_id": "kj3ylQ4nwQdJebmoTAYQvg", "user_id": "21D8GYYY-NptvXhBb9x08Q", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place is seriously underrated. Service very polite. Pricing was fair. Food was very good. I didn't leave hungry.", "date": "2016-02-27 15:07:49"}
{"review_id": "jNuz1hpdBCuIoJYiA2-GAw", "user_id": "9YIEYRTM1-esrPtfTVU4LA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 4.0, "useful": 4, "funny": 1, "cool": 3, "text": "Finally made it here.  When you walk in, you'll be asked, \"How many?\"  That means how many squares of this delicious Sicilian pizza.  Then you pick a topping for each slice. Eg:  \"Eight. Four pepperoni, two peppers two with extra unmelted cheese.\"  That's right. I said \"unmelted cheese.\"   \nAs a native New Yorker, I tend to be a pizza snob. I found Pittsburgh sorely lacking in decent pizza.   This place, however, is quite good.  \n\nThis place is a bit run down but in all of the best ways. No seats, no tables; just a large room in front of the counter where everyone is anxiously waiting for his or her pizza.", "date": "2016-07-06 21:39:03"}
{"review_id": "AuHhtUuWM4Khr-85VarHOg", "user_id": "lSYC4ngZAfFQSezZjnpiPQ", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 3, "funny": 0, "cool": 2, "text": "Came here to try somewhere new for breakfast and it was definitely worth the trip! I loved the old diner feel that you get as soon as you walk in, there's so much to look at and even though it's not huge you don't feel like you're on top of everyone else which is always a nice thing. The omelettes were huge, I got the bacon and cheese and my boyfriend got the meat lovers and they were both packed full of ingredients and took up over half of the plate, along with the home fries and toast it was definitely more food than what I could handle. It was hard to believe we only spent around $7 a person with drinks for as much as we got, awesome!! The waitress was super friendly and the food came out pretty quickly too. I'll definitely be back again!!", "date": "2015-10-11 22:17:20"}
{"review_id": "P-NJI1BP7DX_gkpRRJ3xQw", "user_id": "LIHlbBXL5LsOyNpQVAU3lg", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of those bucket list pizza joints. You will never be the only customer ordering. You get to view the whole process while you wait. It's amazing how they can remember exactly what toppings you ordered, quantity, and cost with out writing anything down. The style is a bit different than what you may be use to, and that's a good thing. The experience is A+.", "date": "2014-09-15 17:36:44"}
{"review_id": "9XtinE1XUAbxMEKcSHuOUA", "user_id": "1gJw6DxTrf0Zmp9gDgYlrQ", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Best breakfast around. Good prices very frendly place to eat. If you want a home made meal this is the place you should go.", "date": "2017-10-07 10:48:17"}
{"review_id": "TI8k2EbfvFv5ZNLHrI9YUw", "user_id": "1kcOj0Ch394fLiUaC_fD9g", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Unreal. \n\nFriendly people work here. I got chicken with rice and fresh veggies and it was amazing. Cheap prices too. Unreal. Came in starving and left so happy.", "date": "2016-06-28 16:58:31"}
{"review_id": "g3LXua2ddIsEAMom12G5HA", "user_id": "LIHlbBXL5LsOyNpQVAU3lg", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 2, "funny": 1, "cool": 1, "text": "Great breakfast and lunches! Their crepes and buckwheat pancakes are awesome. Hot Sausage and fries is one of the best lunches in town. The French fries alone are worth the trip.", "date": "2014-09-15 15:40:26"}
{"review_id": "_fxVqLJrlzJI-agPKTjp1w", "user_id": "dh_tvt09_qVjPtEJ7Mw4dA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Tasty square-style pizza by the slice, couple of benches inside that you can sit on but more of a take-out place.", "date": "2011-07-07 22:25:58"}
{"review_id": "ZySlcg6LqtQpXZN1jd2qwA", "user_id": "CUDEBiMqgju8ZGI9CaCIig", "business_id": "Yjf0i2J9q52dYIT8UVGT3g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "i used this shop from May thru August while my mother was in the hospital. they did a great job. HOWEVER i would have given them 5 stars, but for the last 5 months, i've been trying to UNSUBSCRIBE from their email - apparently they don't review their feedback", "date": "2015-02-05 23:28:51"}
{"review_id": "Ja2jpGvO3GjHhbXykEEUZA", "user_id": "k4GMdGW0pJlKF1Xq_FzUPQ", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent food great prices wonderful owner. Any time I'm in Ambridge I always stop in.", "date": "2015-09-30 16:22:18"}
{"review_id": "SsGBE2bO6KJjj4FiiIG5Yw", "user_id": "kX51virpX2Fsanr_K18Luw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Love this pizza! Extra cheese unmelted! Just ask for it and you can't go wrong. Ambridge, PA is blessed with two of the best pizza shops in the country (Frank's Pizza and Pizza House AKA Police Station Pizza). I know that's a bold statement, but anyone that's been to both can not doubt agree with my statement.", "date": "2011-10-04 12:22:03"}
{"review_id": "dqj452iBGtJmsm0P_p9aUw", "user_id": "deZn5ZaYZkVqW5V081ZCQQ", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent pizza every time!   So if you're new to this you'll want to walk in and wait to the left. You will be asked how many slices you would like (you can get however many you like). You can now move away from the entrance but I'd suggest trying to stay in one place if it's crowded so that they have an easier time keeping track of people. When your order is about to be finished (usually in about 5-10 minutes) they will ask what toppings. If you get extra cheese ask for unmelted, but be cautioned this is the most dense cheese pizza ever so don't plan on being able to eat the amount of slices you usually would. Their sausage is great - it's the crumbly kind! \n\nThis pizza is simple, square, crunchy, and delicious! You can easily feed 4 adults here for $20", "date": "2017-05-04 01:48:18"}
{"review_id": "7eNdm9X_g_WzJ_q9LpjP8Q", "user_id": "W40B1zLVNT8dnNZQt90mpw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I really like the pizza houses pizza it has been one of my favorites since I was a little girl and lived on church street in Ambridge down from Old Economy.  I normally get my slices with extra cheese and pepperoni, although I think I might just start getting it without extra cheese, there's so much cheese on there and it's unmelted sometimes so it can be a little much.  You can order a half sheet or a full sheet unbaked too along with the toppings.  Prices are reasonable.", "date": "2017-10-18 21:43:12"}
{"review_id": "OQ0JU2ii4ctH7mA8UAVXHQ", "user_id": "bLOIe4K6ApkOYt2OwlsyqA", "business_id": "3gL18eXylqutlzqb6TmB0w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have all of my cars serviced here. Barry provides high quality, dependable work. My vehicles are relatively \"high tech\" with specialized oils and electronic monitor systems. He handles everything from tires to engines and transmissions. This is that local mechanic that you can trust. Proper diagnosis of the problem, and complete repair. Small, clean shop. Dependable and honest.", "date": "2014-06-03 13:09:32"}
{"review_id": "bA-p2QqQBvwHWIiRtAQgXw", "user_id": "bKSX_A8VsX83z_CTm9Kw2g", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I'm from California & I have never been to a pizza place like this before! It is probably the best pizza I have ever had! The guys that work in there are very nice too!", "date": "2013-06-29 21:41:33"}
{"review_id": "GxNVA3Z4Nu7YbSq2aYcuow", "user_id": "vPav3ybwU4jG0EHrpD8r5A", "business_id": "y3IVqEFHmrkgVKj2x1Ci4w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great pet store! The owner is very knowledgeable and helped me solve my fish tank issue and helped me pick out fish for my community tank.", "date": "2018-05-25 04:10:02"}
{"review_id": "aQAl_pVt1qQZrUnFro6C2w", "user_id": "Y8AacNK1oloBnkTQ3CLlEA", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this little, \"if you get there too late it's standing room only \"place. The kitchen manager Josh makes sure they rarely run out of anything, while the waitresses seem to never forget your name or face. Excellent portion size. Even better prices. Highly recommended.", "date": "2018-06-02 15:18:27"}
{"review_id": "AuvyCCQkSL-8M8ieXDNujA", "user_id": "sNtu3HsJ7_2nXRBz-3_dIA", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Just went here for the first time and the food was delicious! Although they served the country fried steak as a dinner, they let me have it as a breakfast with 2 eggs, homefries, and toast on the side. The toast was buttery and crispy, and the eggs were cooked perfectly. I'm usually really picky about breakfast potatoes, but their homefries were delicious as well. Really great prices for the amount of food you're given. Some of the best breakfast food I've ever had from a family restaurant!", "date": "2017-12-10 19:10:35"}
{"review_id": "j9J0qJnRM7uhcZiwIyq7jA", "user_id": "6Ey9XKKpqk2s-RcBrCgEdQ", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 2, "funny": 2, "cool": 1, "text": "Okay, you need to experience Nelia's with an open mind.  When I went, there was literally nobody in the building.  A sweet older woman who didn't speak very good English came in, gestured that I should stay, and went across the street to get an employee.  Maybe not the most professional thing in the world but whatever, it kept things interesting.  I would take another star off for this because I was there way longer than I wanted to be, but the pork adobe is SO GOOD.  Can't get it anywhere else around here.  \n\nSo Nelia's, here you go, have your 4 stars.  Just don't go here if you're in a hurry, or even if you want to eat in.  Get your adobo pork to go and enjoy it.  Just know what you're walking into.", "date": "2016-01-11 19:02:08"}
{"review_id": "NDVeRF6Zd0FpqWoBJDkHFQ", "user_id": "wFFLWorAWh3hpxVLQP8YWw", "business_id": "dJ0R-XT78LUQeNHQkD-G9g", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "This family owned  soft serve ice cream place in a converted gas station is my favorite cheat place. They put so much ice cream in a cone or bowl you can barely handel it. The owners are friendly and remember you on sight (maybe I stop too often) Great deal on a warm summer night, Brings back memories.", "date": "2017-05-03 15:39:12"}
{"review_id": "oX-KOQWW3K8Zu1bRBmYXtw", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "This was my first visit to K & N Restaurant. I had been told to check it out by more than a few people, and I am glad that I did. The Veggie Omelette was delicious and our waitress was incredibly sweet and attentive. I recommend this restaurant to anyone that enjoys small town hospitality and cooking.", "date": "2017-06-02 19:17:45"}
{"review_id": "5tc63_UMngf6NVfZ4gzeFA", "user_id": "xBK-ElArbwMaonFFAI4NAA", "business_id": "Yjf0i2J9q52dYIT8UVGT3g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "They couldn't have been nicer on the phone and more pleasant to deal with !  I'd highly recommend !!", "date": "2016-08-11 16:46:39"}
{"review_id": "CjknC9oxCA8sy2-56dRdNQ", "user_id": "mn8ETuf3uWOHazEFHtpiTg", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Simply a a Beaver County institution.  I barely consider it pizza.  It is it's on entity entirely.   It's hard to describe but it's amazing.  \nThe staff and the ordering process is 100% Ambridge.  If you are in the area I can recommend enough that you stop by and grab a slice.", "date": "2017-09-04 20:06:29"}
{"review_id": "RijqsKuHrfEocEOsAymQdw", "user_id": "Y8AacNK1oloBnkTQ3CLlEA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely best pizza in Beaver county! Simply can't beat the prices,walk in wait time or freshness.", "date": "2017-03-11 19:16:55"}
{"review_id": "bsTkvsdFoGAqijFtX3naJQ", "user_id": "91_o14HnvQlCqe8XSHadxQ", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best pizza in the beaver county area ... I drove from Washington DC and knew my trip would not be complete unless I stopped and got me some squares.", "date": "2017-05-07 14:31:29"}
{"review_id": "QwIchMtEUFoJdvFhkW_nLw", "user_id": "iCNDIn83h47Y2fLkXew0Pw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "There's definitely a nostalgic attachment to Police Station Pizza, but to this day I can't come across a consistently better pizza anywhere. Police Station and Frank's are among the best pizza places in the entire metropolitan area, and better yet they are in the same town.", "date": "2015-04-25 17:12:05"}
{"review_id": "7XjPqy1C8jHsFiVdOFxYzQ", "user_id": "RLRYmD7XdbQPgXhlFI_Y7A", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 3.0, "useful": 1, "funny": 1, "cool": 0, "text": "Most of the food is pretty good but stay away from a few things, most notably the reuben sandwich. The meat they use is very grisly. I almost choked on the thing.", "date": "2016-12-02 17:42:48"}
{"review_id": "aH2DYH9qPsH_OVoBAuzcxA", "user_id": "sAbofbYG8Cl6beI1-XK4GA", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great little restaurant in ambridge they are always busy the food is fantastic especially the chicken Philly sandwich made using Mancini's bread is awesome you can't beat the price either", "date": "2016-07-01 17:26:21"}
{"review_id": "1NmGQc61FugrwcM20lnASw", "user_id": "135DbbQnr3BEkQbBzZ9T1A", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 15, "funny": 11, "cool": 13, "text": "I came here with CM for dinner at around 6:30pm on Sat.  After a longer-than-expected hike at Raccoon Creek State Park, we were both quite hungry.  Rather than heading back the way we came and paying homage to the mecca of chain casual dining that is Robinson, I suggested that we venture a bit out of our way to check out what is, to my knowledge, the only restaurant in the greater PGH area that serves Filipino food.  Given that CM is of Filipino heritage, he was eager to try it, as well, so we headed over to Ambridge.\n\nUpon seeing that Nelia's serves lumpia and chicken/pork adobo, CM became very excited, since he rarely sees these dishes offered at restaurants.  Because their standard lumpia contain ground beef, which I don't eat, we split the order and got 6 beef and 6 fish (salmon) lumpia.  For entrees, we ordered the chicken adobo and chicken on a stick.  They also offered kaldereta, a pork-based stew, but CM nixed it, since he's not a big fan of Filipino stews.  Finally, I ordered a glass of the fresh squeezed lemonade ($2.50).  I don't remember the exact prices of everything, and I forgot to take a picture of the menu, but our total check came to $22.50, which I felt was quite reasonable for the amount of food that we received.\n\nUnfortunately, despite his enthusiasm, CM wasn't able to try the food on the spot, since he is very susceptible to motion sickness, which hit him from the hilly drive over about 10 min. after being seated.  However, I was, and in general, I was favorably impressed.  Of the dishes I tried, my favorite, by far and away, was the chicken adobo, which was extremely flavorful and savory.  The chicken consists of all dark meat chicken, which CM informed me is quite typical of this dish.  When he tried it the next day, he said it was even better than his mom's version, which I took to be high praise.  The chicken on a stick, which consisted of a skewered and stretched chicken breast drizzled with tomato-based BBQ sauce over a bed of rice, was not bad, but nothing particularly Filipino or special (perhaps it's supposed to be a faux/Americanized Filipino dish?).  The BBQ sauce was rich and had a good flavor, though.  The fish lumpia consisted only of fish and rice, and lacked the carrots and cabbage that lumpia typically contain.  Because of this, they were rather bland, but the sweet chili dipping sauce added some welcome flavor.  According to CM, the beef lumpia were good, but not quite up to the standard of some others he's tried before.  CM said that the lumpia and chicken adobo were definitely very authentic for Filipino food, defying his expectations for ethnic food from Ambridge, PA (of all places).\n\nOverall, we were pleased with the quality of food and service that we received at Nelia's.  As others have mentioned, the ambiance is definitely no frills/hole-in-the-wall, which is my favorite type for restaurants serving ethnic food.  Re: cleanliness, the bathroom had soap in the dispenser and was acceptably clean during our visit, and I didn't notice any cross contamination (though I wasn't watching the whole time--then again, if I was going to get sick, that would have happened by now, since it's over 24 hrs. later).  The owner (Nelia) is quite personable--as we were leaving, she struck up a conversation with CM about his heritage, and upon hearing of his motion sickness ailment, advised him to drink some soda to settle his stomach.  If you happen to be in the area or are seeking a new type of food to try, I'd definitely recommend stopping by Nelia's for some Filipino specialties, and supporting this great little restaurant.", "date": "2015-04-13 17:09:05"}
{"review_id": "07G81qljsvjLkcROulSQdQ", "user_id": "_dpmfQXHQiVqw-RJ6khb6Q", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Filipino Wednesday's can't be beat! Great food, even better prices.\n\nAnd if you are thirsty on a hot day, the fresh squeezed lemonade cannot be beat.", "date": "2013-05-21 22:35:28"}
{"review_id": "8iIOvSV3tcEbWBz4sdOcZA", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Would just like to add that this place has the best potato salad. I know some will not like it but to me it's great. Appears to be home made also.", "date": "2016-02-20 19:33:34"}
{"review_id": "rizSKb4ZTAwWGbybCKBXGA", "user_id": "C5_jrRCApT-1Ec7kGvkR6Q", "business_id": "Yjf0i2J9q52dYIT8UVGT3g", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have lived in ambridge my whole life and I spend my money in ambridge. One of my favorite places to do just that is Heritage Floral. I have bought flowers other places but the knowledge and creativity of the owner and staff is unsurpassed.\nI am not a difficult costumer but I always leave it up to the staff to make my arrangements. I have never been disappointed or had to make them go back and touch anything up. They always know the proper color scheme and how to arrange.\nI'm the type once I find a good thing I stick with it\nWell, Heritage Floral is it\nThanx to everyone at Heritage Floral for not disappointing", "date": "2014-08-21 23:09:40"}
{"review_id": "PRJHmSIcHw_00C0XJGqLTQ", "user_id": "j9tpcm_UoS-uN4jDaf-VvQ", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "It's the day before Thanksgiving and my family decided on pizza for dinner. What was my recommendation? Police Station Pizza, without question! This place offers superb takeout pizza in a modest, no-frills storefront. The service is basic at best but the pizza is absolutely to die for. Hands-down the best pizza in the area!", "date": "2014-11-27 01:20:07"}
{"review_id": "85gFMniwGLTuH3dcDlEmQg", "user_id": "vBXdvjjd_bD1-u4NUfR9lA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Such a unique place!  \"Police Station Pizza\", as we locals know it, is amazing.  Great pizza, awesome customer interaction and usually a short wait.  Calling ahead isn't necessary and is somewhat pointless unless you want unbaked pizza.  You go in, tell them the number of slices you want, pay, they will ask toppings, pizza comes out of the oven, cold toppings go on and bake on the ride home.  How the guys in there keep track of what everyone wants (number of slices and toppings) is incredible.", "date": "2012-07-31 15:07:22"}
{"review_id": "XndPoSWMEctVS-OL1zSCTA", "user_id": "6Ki3bAL0wx9ymbdJqbSWMA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 3, "funny": 1, "cool": 2, "text": "As a native of Aliquippa, I've grown up on Breezy's and Police Station pizza. \nPolice Station was always a stop when crossing the bridge to visit my cousins. As much as I wanted to see them and have play dates, I wanted the pizza more. \nI'm spoiled from this goodness and have become quite the pizza snob indeed. \nI live in Bloomfield but when the crave hits I'll hop in the car and head to Ambridge.\nMy toppings of choice! Extra cheese, please!", "date": "2016-11-03 12:33:21"}
{"review_id": "cB7BWaZLmNuQhGNxsRSmgA", "user_id": "W40B1zLVNT8dnNZQt90mpw", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "The ribs were delicious and the meat falls off the bone. The chicken on a stick with fried rice was pretty good as well.  I certainly will be back the food is reasonable and there is a variety of food to choose from.  They have different specials on different days of the week.", "date": "2016-10-07 03:21:03"}
{"review_id": "Az2SRTwTJNmoSdUfVEHHDA", "user_id": "21D8GYYY-NptvXhBb9x08Q", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Generous portions. Low price. Great food. 5 stars. Staff's extremely polite. Home cooking without the clean up.", "date": "2016-03-28 18:57:54"}
{"review_id": "n5j_OOu_O4SHAZKldSuZ-Q", "user_id": "2iba2u3Lz1fCGKYueLup4Q", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "grew up eating police station pizza!!!  extra cheese is the bomb....everyone knows everyone and its friendly and the pizza is delish...didnt make me feel like shit!", "date": "2015-12-18 23:21:14"}
{"review_id": "e8BNRGji3DBak9DV47emmQ", "user_id": "m2uTGkOKcXqQJSmvsYvtMg", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best pizza ever.  Has a great crunch.  Order by the slice or a tray.  Pizza only.", "date": "2017-08-06 00:56:14"}
{"review_id": "jX8tNhvDo9znFRHk22TOgw", "user_id": "-9Y_03tqxxxaFrz5x-QZiw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pizza was great and pretty cheap as well. They have it ready like 5 minutes after you order. Carry out only. Just wish they were open on Sundays and earlier on Saturdays as I would have ordered there at those times before but had to go elsewhere because they weren't open.", "date": "2016-10-21 15:19:32"}
{"review_id": "gOfLiewzlKyEdw63UNJwoA", "user_id": "REJ4ZVhUKUsyxBAveg70zA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 3.0, "useful": 3, "funny": 0, "cool": 0, "text": "Had to try this. Well school  cafeteria is what comes to mind. \nThe cheese is  imitation at best. It's not smooth or stringy. \nThe staff couldn't be more friendly and professional. Hats off to you guys. \nSuggestion. Charge an extra fifty cents a slice and use real cheese.", "date": "2015-07-14 10:32:58"}
{"review_id": "UAf4dxXzcAvoFXr_V1--7w", "user_id": "3xQ9B-tv3D_fCnKRwt0c2w", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "An original. A true classic. Crunch of the crust can't be beat. Get it with extra cheese unmelted: try to drive home without taking a bite.", "date": "2015-02-24 02:46:42"}
{"review_id": "hm1Tl4yg8ymj2SSKMdNFjA", "user_id": "uZ3jBTELT_RLbGJZlawARg", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This is my favorite pizza, the best that I have every had.  I do not live in the area, but I was in town for the Dick's Sporting Goods Pittsburgh Marathon yesterday and had to make the trip up to Ambridge to get some pizza from Pizza House, which is also informally known as \"Police Station Pizza\" since the police station used to be next door.  This pizza place has been here a very long time (since the 1950s), and they use the same recipes that they used when I was a child.  My grandparents lived in nearby Leetsdale, and we used to always get pizza from Pizza House whenever I visited them.  Everything about this place is the same as when I was a child, including the pizza itself, the order system, prices by the slice on the wall, and pizza served in white boxes. The prices have gone up with inflation, but they are still very reasonably priced.\n\nOn this visit I got some plain cheese and a pepperoni slices.  The pizza is very good, actually the best I have ever had in my life.  It is a square pizza with a very crispy bottom crust and a light and airy crust on top.  The pizza sauce is also very good, as is the cheese and pepperoni.  They put lots of cheese on it, and throw the toppings and some extra cheese on it after it comes out of the oven.  The pizza is a thick crust, kind of a cross between Sicilian style pizza served in New York City and Detroit style pizza, such as you can get at Jet's.  It is very good since they make the dough fresh daily and use high quality ingredients.  I bought a tray of the crust to take back home with me for $7.00 (of you can pay full price for the unbaked option that includes the sauce, cheese, and toppings).\n\nThe prices are very reasonable - $1.05 per cheese slice and 20 cents per topping and 25 cents for extra cheese (plus tax).  They only offer takeout pizza.  They also offer pepperoni rolls for $4.50, which they did not offer when I was a child.  They also sell bottled drinks.  The order system is very simple - you tell them how many slices you want, the toppings you want, whether you want it baked or unbaked, pay them in cash, and then wait patiently for your pizza to be ready (they have a couple of benches inside).  They are very friendly and are very efficient despite being very busy.  You can also call ahead.  I noticed that unbaked pizza orders were popular, as were full tray (24-slice) and half tray (12-slice) orders.  They are only open during the evenings, opening at 5:00 PM, and they do not take credit cards.  Note that they are closed on Sunday.\n\nIn summary, this is the best pizza I have ever had in my life, and that includes 3 trips to Italy and multiple trips to New York City and Chicago.  I highly recommend PIzza House, and if you live in PIttsburgh, it is definitely worth the trip up the Ohio River Boulevard.  I wish I could give them 10 stars, they deserve it.", "date": "2017-05-09 02:39:36"}
{"review_id": "boEuM2qWEWtoSMBzBX8Udg", "user_id": "MCT7aZUAg-NFi1QSqiDfiA", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 5.0, "useful": 1, "funny": 4, "cool": 0, "text": "Literally just finished our meal, it was outstanding, I had the half rack of ribs with fries and linguine salad and my wife had the fried chicken salad. First thing I'll say is they do not hold back on quantity, it was a ton of food I'm known for eating a lot and I had a good bit of leftovers. Second, it was outstanding, the ribs were very tender with a perfect amount of bbq sauce and the meat came off the bone easily, the fries were terrific, not crispy, not soggy and perfectly seasoned, I didn't have to chug a bottle of water after I ate them either. The linguine salad, was decent, didn't knock my socks off but I don't go to places strictly because they have linguine salad, so no harm, no foul. I didn't try my wife's salad, but she's the pickiest eater, seriously, she'd send her food back if she was in a concentration camp. Yet, she didn't have a bad word to say and I didn't catch her \"hunting\" for the good stuff as I so often do. So that in and of itself is a damn good review. Definitely recommend, a nice little gem in Ambridge!", "date": "2014-03-13 00:29:32"}
{"review_id": "5zAzIn8nq-ph-ZQlx54lHw", "user_id": "L2flvGCgPWYqBWdLcOMNdw", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I LOVE this place! Best diner around. They keep your coffee filled and I love the waitress that works there. She's always super nice to my kids as th breakfast is great!", "date": "2017-07-06 18:28:46"}
{"review_id": "LQ5WzC2YY7ioWHOCepJvPA", "user_id": "xP53fNYIx6ZNoTqSXrT5gQ", "business_id": "3gL18eXylqutlzqb6TmB0w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Are you sick and tired of big corporate vehicle repair shops? Would you like a shop where the owner works every day? Action Tire is the shop for you. You'll be treated fairly by knowledge people who actually care about the services they provide.", "date": "2015-12-31 14:01:14"}
{"review_id": "DfvUw3Ihbuaa3BdRIuBopw", "user_id": "pCUApgpQLmYwTEzT6FToFw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Like I've stated in many reviews before. My wife and I are pizza snobs. We try pizza all over the place and have done so for nearly 25 years. This has been a long time favorite of mine. Nothing about this pizza is normal. From the way you order to the pizza itself. The crust is thick and crispy, excellent cheese and sauce. We always get pepperoni. My mouth is watering just think of this stuff.", "date": "2017-04-14 20:44:14"}
{"review_id": "kyvXT7TT8dFS5y_W9S7K6w", "user_id": "fUfg12xrVli1RlH3P-99mA", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "I feel for he hype and ordered from here. It's ok, I'm not impressed but they do get a lot of business.", "date": "2017-08-14 23:12:24"}
{"review_id": "7OKDSI8cVW9QwGOKjRKozQ", "user_id": "y4a_7xpbvRvCGwMNY4iRhQ", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I always forget to take photos!!  But this time, and the reason was because I wolfed that pizza down!\nI like this place. It's open late, even though it was crowded, I got my slices within minutes, they were tasty! I like the sauce.\nThe crust is thick, it's very crispy on the bottom and light above the crispy bottom.  Not greasy. They got shake-on pepper flakes and herbs.  I just got the cheese plain, and two slices came to $2.35.\nI will definitely be back!  \nThis is a pretty much a no nonsense place. Just my style.  Take out only. It's just pizzas and soda. Very friendly.", "date": "2018-09-27 01:44:11"}
{"review_id": "KFhmRn9P8f8zE0TexAPRqA", "user_id": "7M2P-xdlDSILMJDZVwVQ9A", "business_id": "Q_0eGl-aElqHKukHvmLdwA", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Did I eat at the same place that is getting 5?star reviews?  Just had the WORST meal in a LONG time.  First, the place is dirty, random papers and supplies are all over the place.  No soap anywhere to be found in the bathroom, which is disconcerting given the standard \"employees must wash hands\" sign.  Gross.  Ribs were reheated, but only a bit so some were cold.  They tasted baked, fatty and NOT authentic bbq.  Pulled pork was really tough.  Hard to finish, in fact could not finish it.  The lumpia appetizers were also difficult.  Cheese ones are filled with a velveeta like substance.  Meat ones had an off flavor, ammonia like.  We each had a bite of each kind and simply could not eat any more.  SO disappointing!  We were really looking forward to some authentic bbq or any type of Filippino food, but were treated to a nightmare on a plate.  In fairness, the fries were good.", "date": "2014-06-09 23:00:41"}
{"review_id": "UZUyJ4UNWL4ftTKfiD9dog", "user_id": "He5cTI8sBgNDKVA5yhEA8Q", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Normally go into this place two to three times a week with my coworkers, I normally get the sausage biscuits and gravy it use to be good but recently it has been getting worse and worse. And today I ordered it and it was ice cold and everybody at my tables food was cold as well, that place is going downhill...", "date": "2018-10-07 11:51:22"}
{"review_id": "oiG0vkFFicdRsKSA65HkDA", "user_id": "nhgFZ04b5s6RXt4MKfjOhw", "business_id": "dJ0R-XT78LUQeNHQkD-G9g", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very disappointing. They don't know how to make a hot fudge sundae. A hot fudge sundae is basic ice cream shop stuff, I'd assume. Layer of hot fudge, ice cream, more fudge, whipped cream, optional nuts, and a cherry. Ok, interpret it, spin it, make it your own. But don't leave out the damn hot fudge. \nI got ice cream with whipped cream, some ground peanuts, and a miniscule drizzle of chocolate sauce on top.\nIce cream was not that great either, btw.", "date": "2018-10-22 01:51:30"}
{"review_id": "Mj46i4n0yTRFDFgP__9oXA", "user_id": "kIXU4nWbhVVIxu4-GrQ-8Q", "business_id": "Eu_zPTrNVAXkpdSxf7CJ2w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice place for breakfast, 50's pictures line the walls and old style milk shake maker behind the counter.  Prices are great and the food is just the right amount.  Left felling satisfied, not stuffed ... A revisit is definitely going to happen.  Thanks.", "date": "2018-01-07 14:34:10"}
{"review_id": "g8EVjxMidDJMNLafUu9iPw", "user_id": "Zm0oEW1mSmc0zvPIPk1Ziw", "business_id": "y3IVqEFHmrkgVKj2x1Ci4w", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "The BEST pet store I've ever been to. It's an amazing place. They have birds that are on perches around the stores that sometimes interact with customers but LOVE the staff. You can tell the staff works a lot with the animals to get them comfortable with people. A lot of the animals there are rescues and you can tell they try very hard to give these animals the best lives. If you're looking for anything bird related, definitely check these guys out first. I go there for the reptiles but the whole experience is just one of a kind.", "date": "2016-10-26 04:01:20"}
{"review_id": "CoT-dXfvNZvYhJMd-qixow", "user_id": "I4BVS9Kkw52Xj6k3nTEuPw", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The best pizza I've ever had. I saw the reviews on yelp about how good it is so I felt like I had to try it. When you walk in, they ask you immediately how many slices and what you want on them. The pizza is already hot and fresh out of the oven. They top it with cold cheese and toppings and let the cheese melt as you take it home. When I was walking out of the shop with my pizza, on 2 separate occasions people came up to me to tell me how great the pizza is and how they were jealous I had some. I think that speaks for itself right there as to how good the pizza is. Needless to say I was definitely not disappointed. This place deserves awards.", "date": "2018-08-12 01:12:27"}
{"review_id": "WG5DkTM0yobI9p9al-cREg", "user_id": "__m1Uxrfa0XaNl_7UHeWWg", "business_id": "y3IVqEFHmrkgVKj2x1Ci4w", "stars": 1.0, "useful": 1, "funny": 0, "cool": 1, "text": "Just visited and their animal husbandry is terrible.  Fish are way over stocked in tanks and 10 finches were shoved into a cage I would put maybe 3 in.  Further back you'll find the reptiles and it's just all sorts of wrong.  The veiled chameleon was thin and looked to be on the brink of death, the bearded dragons were on mulch substrate with no uvb lighting and in 20 gallon tanks when it was clearly time to bump them up to 40 gallons, and upon further inspection we found boas, ball pythons and a Chinese water dragon in Tupperware containers with no heat sources on a shelf without lids that anyone could have just taken.  When we asked the teenage employees questions they were extremely lacking in knowledge.  I wouldn't recommend you buy any animal from here, having experience in the animal industry as well there are better and more knowledgeable places.", "date": "2017-02-17 19:02:15"}
{"review_id": "cyJDN5sgp80gr1q8vhg1ww", "user_id": "ECJm0pUrLzRrg-hDM3dA9w", "business_id": "y3IVqEFHmrkgVKj2x1Ci4w", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Reptiles scare the heck out of me but fascinate me so when I heard of a new reptile shop in Ambridge I had to go check it out. This is a family owned business. The husband is a reptile rescuer. They had a large variety of reptiles, birds, fish, even spiders...eek! It did not have that funny smell like some pet shops or reptile shops have.  Seemed very well maintained and taken care of. I would never purchase anything myself but if I knew anyone that was in the market for these types of creatures I'd definitely recommend checking this shop out.", "date": "2018-11-11 16:15:13"}
{"review_id": "ZoqadRQDL8STHEV_PNwAng", "user_id": "ANOuJtkXx3jkRcqDQ_80Tg", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best pizza around by far i go here as much as i can i wish it was ok to eat pizza every day love how the cook the pizza the cheese is the best every one needs to go here once a week i know i do", "date": "2017-05-13 01:19:52"}
{"review_id": "zJ7J5xqcdf0kYX66wIV7iQ", "user_id": "rk3wVTj-FQZHT7RhqyPChg", "business_id": "729grSa1Wsn-hfv7D5uOxg", "stars": 4.0, "useful": 3, "funny": 2, "cool": 3, "text": "A favorite among Ambridge natives. As a transplant, I too love it. The ordering system is weird (think the soup episode of Seinfeld) and you'll never understand it if you didn't grow up with it. \n\nBasically, just go in, tell them how many actual squares of pizza you want, then 10 minutes later they'll ask you what each topping is for each square. They'll add it all up in their heads and give you a total. You pay in cash only. \n\nNo delivery and no ordering ahead. Like I said, it's weird but the experience is worth it. The rigmarole can get old if you don't appreciate the hoops but luckily the pizza is worth it. \n\nEnjoy!", "date": "2015-10-07 16:01:51"}
{"review_id": "Ql1CURDyAAAO4ACFnoiBvQ", "user_id": "AvvDgDemVE-Q56pFP9bdwA", "business_id": "rdHO0LkiNe6s3716hPuQXQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Look no further for the best wings in town! This place is a no-frills bar. Not much in the way of a beer selection on tap unless domestic lagers are your thing. It could certainly use some updates, but dang, the wings are good! Be prepared to sit in a cloud of smoke though.", "date": "2012-11-10 00:15:05"}
{"review_id": "pZpnTziOzz2o_ZccQrW91w", "user_id": "QpDYalrqcPr1nEFlBy0FqQ", "business_id": "rdHO0LkiNe6s3716hPuQXQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good wings, a few extremely loud, obnoxious, functionally retarded drunks. Still not a bad place overall though.", "date": "2017-06-29 23:29:05"}
{"review_id": "UhnU6ylguoWeoqcd1vEpJQ", "user_id": "SHJz-YoFuJ1Xcwla7aOKSg", "business_id": "rdHO0LkiNe6s3716hPuQXQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "On wingnight, had cheap Yuengling drafts (always a good thing)...along with Buffalo, Fiesta & Garlic Parmesan wings...perfectly fried & topped with lots of sauce. \nOn another night, tried 3 more flavors, Wingdust, Wingasm & Rattlesnake (Those, plus Fiesta, are shown in my posted pic).\nI drive 30 minutes to get here & tolerate a very smokey bar to enjoy the...\nBest wings ever, seriously!", "date": "2014-02-27 20:14:08"}
{"review_id": "hxHwuqtDw5g7IW3ZnAh-EQ", "user_id": "GsFr15zUG8wO9fsSHwvZUw", "business_id": "iJhb_2JL1uIbIRYUl41uVg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very professional job.  Car is virtually factory new.  3 year old JK caring a dog around several times a week.  I am not sure how this could be done better.  Price was very reasonable.  Next both inside and outside.  Service to your door step.  Thinking Stanley Steam on steroids.", "date": "2018-08-27 13:28:48"}
{"review_id": "WJ_8Ic0U4JpjJ6Ob4cGK2w", "user_id": "qQEkAUu8dsYxiCvFvE0KVg", "business_id": "rdHO0LkiNe6s3716hPuQXQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to meet up and waste a night.  Does tend to be smokey but it doesn't take away from the appeal.  Moderately noisy and overall great food and cheap drinks.  I try to get to  this bar every time I am in the Pittsburgh area.  Who doesn't love great wings?", "date": "2016-02-29 20:31:17"}
{"review_id": "_TJh-qvyR3PiC5EZ-A2vjg", "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ", "business_id": "rdHO0LkiNe6s3716hPuQXQ", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "The website is definitely deceiving. I thought that I was looking at a place with a  huge menu and a great atmosphere. But when I showed up it was a whole in the wall smoky bar. It seemed like a bunch of locals which isn't a bad thing but I don't like to eat with a bunch of smokers. \n\nWe got the menu and it was extremely small and limited. It was supposed to be taco night but I was told that they didn't serve enough tacos so they were out. The other review says best wings and I was craving wings from the menu but apparently they are only served on certain days. My husband and I ordered burgers which were nothing special. The buns were toasted in the small toaster in the back. \n\nDrinks were cheap but I don't think I'll be going back.", "date": "2013-02-16 22:07:51"}
{"review_id": "Xv5XbkIDQjp7QMqUUz8yhg", "user_id": "hrUFEModQ73A5B5Q_YRQhQ", "business_id": "iJhb_2JL1uIbIRYUl41uVg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My father gave me a gift certificate for Pucktastic Auto Detailing for my birthday, and my minivan is absolutely sparkling. What a fantastic present! Mike arrived on time, and took great care to remove seats and get every nook and cranny of that minivan. He found a barrette that my child hadn't worn since she was a baby -- and she's nine years old now! And the car smells great. It's a pleasure to drive now because of Mike's hard work. Thank you!", "date": "2018-10-07 01:00:40"}
{"review_id": "47gNkwzw4CzihXDa10u3GA", "user_id": "YLJuIAjdwTkyRBP2rj5yjw", "business_id": "iJhb_2JL1uIbIRYUl41uVg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I scheduled an appointment with Mike and I couldn't be happier!   Mike was very professional and a total pleasure to work with.  I asked him to come detail the inside the of my 2016 Lancer.  Mike came to my apartment complex and took his time ensuring every inch of the inside of my car was spotless.  He got rid of the animal hair, finger prints, and everything else all for a great price.  He offers Veterans a discount which I appreciate.  I already told him I'll be calling him to come back out in the spring to get rid of all the dirty winter salt.  I highly recommend Mike to anyone looking for an amazing person to help maintain the cleanness of their vehicle.", "date": "2017-08-14 14:35:30"}
{"review_id": "PlMDL03wlb59DW0C34hvdg", "user_id": "NOR93THAvtPUrJlzP9a3pA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "You have not only lied but undermined the purpose of Yelp! I wrote an honest review. I have sat back and watched you flip over backwards to discredit me, you have slandered me and so has Marty Griffin at KDKA. I will use the resources Yelp has provided me. You have gone too far. \nYour willingness  and aggression to try to get me to remove a TRUTHFUL review is disgusting! Yelp provides an excellent service. You've gone too far.\nStop harassing me, NOW.\nThis experience did happen 7-8 years ago...however, the truth is the truth.", "date": "2018-06-19 16:44:14"}
{"review_id": "5KkkbwTOID_1rTjVGrtuGA", "user_id": "wFFLWorAWh3hpxVLQP8YWw", "business_id": "NHhzHVKVizOvA61AyN-dSw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place has the best prices I've ever found. Nothing fancy  here just a one lane of quick efficient service, no fancy waiting room or costly displays.", "date": "2017-06-18 01:38:26"}
{"review_id": "guwuh4aCj5SOzJ3Q7QR1hA", "user_id": "LNayiuLHmzJJFyN1aO58BA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I am thrilled with this cleaning service ! I am a Realtor and always need a reliable team to clean when a house sells and movers leave . Houses can be left a mess . These gals cleaned non stop last week for 15 hours and house is spotless ! Thanks ladies ! I will be calling you again !", "date": "2018-07-17 23:32:06"}
{"review_id": "fc-So3WMlOtxlWv0l0HRaA", "user_id": "bz8YokH-ZxwAWIH2h9yBKg", "business_id": "NHhzHVKVizOvA61AyN-dSw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "They were done with my car before I got back from my block-long walk to the bank today. And despite my being a too-frequent customer, they never make me feel bad for all the dumb things that happen to my wheels/tires. Wouldn't even consider going elsewhere.", "date": "2018-07-27 18:44:41"}
{"review_id": "P-LNzEYlYo9gNVCUW1od1g", "user_id": "NOR93THAvtPUrJlzP9a3pA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 1.0, "useful": 4, "funny": 2, "cool": 1, "text": "My mom was hospitalized and I wanted her house clean when she came home. I called Maid on the Spot. Shannon was so nice when we met, I really liked her. I explained what I wanted done. My mom was living in a large one bedroom apartment at the time. After Shannon and her team left she presented me a bill of $900.00!! I was shocked! $900.00 for cleaning! She said they had to bring in extra help and I was charged for every person she brought in. I paid her and stupidly thought, ok...maybe a miscommunication happened. My mom had several apartments she rented out. She needed the small, one bedroom apartment cleaned before the new tenant moved in. The apartment was completely empty and the people who moved out had had it cleaned but my mom wanted to freshen it up. Shannon's bill was $300.00!! WOW... I was not only furious but I knew Shannon was taking advantage of my mother. NEVER AGAIN...Shannon took advantage of my mom. Be aware of all the hidden charges and makes sure she doesn't bring in \"extra\" people to pad the bill. Dishonest people. I suggest you look elsewhere.\nPLEASE READ THE REVIEWS NOT SHOWN...THOSE TELL THE TRUTH!", "date": "2018-02-25 18:04:18"}
{"review_id": "h-CDC6_0ZfpYlZncjvGQnw", "user_id": "VtMhm67KJbTHtta3BdqGEA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have had Maid on the Spot cleaning done twice now, and have been extremely pleased both times.  i would (and have) recommended them to others, and plan to have them come again soon. Both cleaners came on time, had all of their own supplies, and worked very hard to make my house shine. I also love that you can book your service right online.  Excellent cleaning service!", "date": "2017-08-11 22:00:34"}
{"review_id": "i405fGvgenZlLVjC52bM2Q", "user_id": "La7sjxL5OgWUBfjpaPBNtQ", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "They're great. We've been using them for several months. We did a big initial cleaning and now they come twice a month. \n\nTheir dedication to customer satisfaction is obvious in every interaction. We've had only one small issue with a new person missing some things in one of the bathrooms. They came back out promptly and addressed all our concerns for free. \n\nComing home to a clean house is simply fantastic, especially for a home with six people. Cleaning day is like a holiday now. I would recommend them without question.", "date": "2017-06-22 15:06:38"}
{"review_id": "TpnQCtmZveYDni-LgWJGiA", "user_id": "pTBL-Wq-PPcTnkb3mffIIA", "business_id": "NHhzHVKVizOvA61AyN-dSw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "This is by far the best tire place around. Very honest and the prices are well below other tire dealers. They are very friendly also. Highly recommend them!", "date": "2012-11-15 22:04:48"}
{"review_id": "jXxeXXaWDQlRENja8-5UlA", "user_id": "TibWjr_9PIqahTNzHRzwyg", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Well if your having reservations DONT. I cannot be happier with the cleaning they provided. This is my parents House we are selling and they paid great detail to every area I ask d them too   I am so happy that I am seriously finally going to break down and hire a cleaning company for my own home.   Give them a try you will not be disappointed", "date": "2017-12-11 19:56:25"}
{"review_id": "pA44mB1FZXzHX8WgwycehQ", "user_id": "VtMhm67KJbTHtta3BdqGEA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Another great cleaning job by Maid on the Spot!  I have been so pleased with this cleaning service!  I appreciate the ease of scheduling online, the ongoing communication, and most of all the care they take in making sure they do a good job.  I would highly recommend them for cleaning service!", "date": "2017-10-09 19:36:50"}
{"review_id": "NnJtIYJZJqUBgzPaVNUJ-A", "user_id": "NOR93THAvtPUrJlzP9a3pA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Your claim that \"Get Marty\" did not go as you said! I spoke to him at length, twice. I also spoke to his boss. I told him of your nasty email where you called me names on many occasions, accusing me of writing another bad review on Google. I did no such thing. I only use Yelp. I believe the service they provide is just. What was written was 100% true, that was my experience. Jason, tried to set me up like I was blackmailing you. This has gone beyond any normal Yelp exchange. Yes, Marty called a Yelp and they refused to remove my statement. Not on,y that but Yelp was professional enough to send me information / resources to how me protect myself. \nMarty Griffin DID NOT do any such feature. I am sad that you are both so vengeful. Yelp allows people write the honest review. Which is what I did and I did nothing wrong. You calling intimating me is wrong! \nPlease stop with your insentient harassment of me. What you are doing is wrong on so many levels. Please stop.", "date": "2018-06-17 23:16:11"}
{"review_id": "74Ac_oXK-klx6odG40KQgA", "user_id": "EESwR_EtSNDaWoo8Zv6itQ", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Our apartment was cleaned one week ago and I came home to an incredibly clean apartment. I was very impressed by the attention paid to details such as straightening up some of our clutter and folding/arranging the linens in the bedroom and the bathroom. Very pleased with this service!!", "date": "2017-09-18 20:33:21"}
{"review_id": "7aOvS5VOsGj6Ub5iWAWGkg", "user_id": "ctfMC24c2cRKTfA3RPmVNg", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Excellent cleaning service!  Dependable, professional and quality cleaning at an affordable cost. I recommend them highly.", "date": "2017-05-21 00:31:10"}
{"review_id": "3n_ZKCx7mg08-fjYavJ-7Q", "user_id": "1q47TqjCRH92PhXIA9t9kA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I were very impressed with our first cleaning! We are looking forward to continuing biweekly cleanings so we can get back some of our own free time! Highly recommend!", "date": "2017-05-07 17:50:35"}
{"review_id": "F7cRPGNB-PxnBa7rZjgmMQ", "user_id": "VtMhm67KJbTHtta3BdqGEA", "business_id": "ftx72aqADrNYmOlMytdtCg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have been using Maid on the Spot cleaning service for about a year and am very satisfied!  They are always on time, do a great job cleaning my home,  and are very professional.  I feel very comfortable working with them and plan to continue my service.", "date": "2018-04-27 00:22:24"}
{"review_id": "32H_DQ2p1pHNnoaRVc81jQ", "user_id": "33UxFRFVbTEfKkUvDvigAQ", "business_id": "2_7lYF6P2cYKnSiPhhVyPQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a hidden treasure! They have fish/seafood every Friday here! The portions are large & meals include fries & coleslaw for under $10!! Everything is cooked to order and you can tell the oil and the ingredients are fresh. This is the best fish sandwich & oyster sandwich I have ever had! There are also other things on their menu but I come for just the seafood. My family & I have been coming here for years!!!!", "date": "2013-09-06 23:05:43"}
{"review_id": "u0wYpnt7EhISLEc19jVaEw", "user_id": "VlHgaN-XsnnoqHw10LW8Gw", "business_id": "2_7lYF6P2cYKnSiPhhVyPQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great local Restaurant, with Full Bar, Friday there is a fish fry with large portions of cod at a very good price. If you like local places and memories of years ago please stop in here before a chain restaurant, when these places are gone your only choice will be McSomething, with brass rails or playgrounds. The fish fry Friday has been going on now for 40 plus years.", "date": "2013-04-11 22:13:41"}
{"review_id": "Y5lSGPM5bbNGJQpVeGqU6g", "user_id": "W40B1zLVNT8dnNZQt90mpw", "business_id": "2_7lYF6P2cYKnSiPhhVyPQ", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "I had a taste for fish on a Friday night and this place was recommended by a family member, so I said I would try it out.\n\nI ordered a fish dinner and a plan fish sandwich to go, when I got home I was shocked by how much fish I got in one meal three large pieces of fish, fries, and coleslaw.  I can say I didn't care for the coleslaw it was dry and a little bland, the fish was fresh, flaky, but needed a little more seasoning so I had to add tarter sauce and hot sauce.  All and all the food was ok.  The price was reasonable for the amount of food you get.", "date": "2017-10-07 22:51:00"}
{"review_id": "7gQJUmEokMkNvqpUv9oDFA", "user_id": "285_HzJIJn79LJMvIxLNzg", "business_id": "7xRbOtZUuw7DxOWrHeaanw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place kills it every time. The food tastes amazing and the people are always kind and friendly. It's nice if your in a hurry or if you want to sit down and eat. The prices are fair and the portions are adequate. The only complaint I have is I wish they would open earlier and stay open later, that's only because I really like the food. Their hours are good as well.", "date": "2018-06-13 16:07:54"}
{"review_id": "0eLPKnUJ3TIZvsurAAdMRQ", "user_id": "MXy1fO4n7Q5-FRdgSWWXDQ", "business_id": "2_7lYF6P2cYKnSiPhhVyPQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "***Avoid this place****\n\nWe just got home from the fish fry at Orbits restaurant in Ambridge.  Our party of six all agreed that we should have stopped at McDonald's for a filet-o-fish.\n\nThe place is a dive bar- usually my favorite for fish or wings- but this place is beyond awful. \n\nFriday is the only day the place is non-smoking, so it smelled like a dirty ashtray.  Dimly lit- and thank goodness for that- it obviously was not very clean.\n\nWe arrived and were glad that the only area to seat more than 4 was available (though I honestly wish it were not, and we had been forced to go elsewhere). \n\nThey don't serve iced tea, except for cans of Lipton, and that should have tipped me off. \n\nWe ordered after only a few minutes of being seated, but then the wait began.  \n\nAfter an HOUR AND A HALF, we noticed other tables being served before us, despite arriving well after we had.  The waitress then told us that our order was next in line, but a full 20 minutes later, the same waitress told us that she had two more orders, \"and then ours would be right out.\" \n\nI am NEVER one to complain about my meal to the owners.  I figure that if I get lousy service or  bad food, I simply won't go back. \n\nFor the first time, EVER, I was forced to knock on the kitchen door to get an answer.  The manager was INCREDIBLY RUDE, and failed to even apologize.  She just said that the regulars get served first, and that I should have known that, somehow.  At the time I was invited into the kitchen, the ladies were cracking up and eating French fries from an order. Probably ours. \n\nEventually, we got our fish, which was nothing special.  Far greasier than average, fish with a bonus--  soggy black skin was visible under the breading. \n\nWe will never return to this disgusting hole-in-the-wall.  Rude management and sub-par food make this dive a no-go.", "date": "2018-03-10 04:42:41"}
{"review_id": "o_d550DgRJ9TW2Qz1y88Cg", "user_id": "Y8AacNK1oloBnkTQ3CLlEA", "business_id": "7xRbOtZUuw7DxOWrHeaanw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I'm not one to sugar coat anything. So with that being said, here we go. Have you ever been to a place where all the food tastes like it came straight from a can? Well, THIS IS NOT ONE OF THOSE PLACES!!!  The food is simply amazing. Definitely what the area needed. This is definitely a,\" could be dinner every night place\".", "date": "2018-05-06 19:35:36"}
{"review_id": "P6bsrbM9UIH1d5cAvC9Eqg", "user_id": "v48jCahxqCh2_MsG317OFg", "business_id": "RdEb3U0CDIXElVJe3w5n6g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great cannolis great lady fingers. We also bought our 25 year old NEET daughter her birthday cake here, and she loved it.", "date": "2018-09-12 20:30:32"}
{"review_id": "M4dUvxK3MjVSAhHIFEwEew", "user_id": "vEQTo-JO4y0Ta60ai5qxig", "business_id": "RdEb3U0CDIXElVJe3w5n6g", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "We were so excited to find this bakery, but were disappointed. First off, the store was not air conditioned--not a big deal, but items that should've been in a cooler weren't. We ordered brownies that had whipped cream icing which should've been chilled. The lady locks were stale. The s'mores cookies were rock hard and inedible. The brownies were actually soft and edible despite being incorrectly stored. The store itself is half rummage sale, half bakery. Instead of selling drinks which would make sense, they're selling dusty knickknacks.", "date": "2018-08-12 00:18:44"}
{"review_id": "VtFGjJE58-t-RhhA5UsfHQ", "user_id": "w3TIE-0g4rhF6cSh-aJ-1Q", "business_id": "7xRbOtZUuw7DxOWrHeaanw", "stars": 5.0, "useful": 1, "funny": 2, "cool": 0, "text": "The Food is the Bomb.com slap your Momma. Lol. Better come get you some Good Eats.this is like my 5th time ordering some Food. Sitting here now waiting on those Fire wings. Yessss!!! Finger licking Good.", "date": "2018-07-03 22:41:41"}
{"review_id": "bAJHB-vJq-qN51HARknCvg", "user_id": "8AwcaBJjiMpQ__FPxktwwQ", "business_id": "7xRbOtZUuw7DxOWrHeaanw", "stars": 4.0, "useful": 12, "funny": 2, "cool": 9, "text": "Authentic Southern food. There's a lot of pride here, and for a good reason. Everything is prepared carefully and with a lot of flavor.\n\nThe dining room is nothing fancy, but they serve great food with a smile. \n\nI'm very particular about my cornbread, because Southern cornbread is never sweet. The cornbread here is only slightly sweet, and it's a good portion for just 50¢.\n\nThe BBQ sauce is excellent, although it would be nice to have a few more options or spice level. \n\nThe greens were perfect.  Overall, wonderful Southern BBQ.", "date": "2018-06-28 04:06:24"}
{"review_id": "R8VQLBBpFZUGHIYtUBBqEQ", "user_id": "W40B1zLVNT8dnNZQt90mpw", "business_id": "RdEb3U0CDIXElVJe3w5n6g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Stangl's has been around Ambridge for awhile.  I decided to stop in because I was craving something sweet. I got a lady lock, two peanut butter cup cookies and two m&m cookies all of which were fresh. The cookies were nice and chewy just the way I like them and it's only $.50 a cookie and $1.25 for a lady lock which is very reasonable.  It smells good when you walk in and the owner is very pleasant and I was greeted with a smile.  This is a nice local bakery.", "date": "2018-10-31 20:17:18"}
{"review_id": "2sUzZ5esFKIu0lfButxLUg", "user_id": "hEe5_Z3gXol3d3RIphLchA", "business_id": "7xRbOtZUuw7DxOWrHeaanw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I'm pretty sure there's a wormhole somewhere just inside the entrance to Annie Lee's place, because from the moment I waked in,  I was instantly transported away down south for some of the most authentic tasting southern cooking and ambience I've found in the Pittsburgh area. Nothing fancy, you order at the steam table and sit at Formica tables--just like home. The food is simple and fresh and delicious. Lightly fried and juicy chicken, collards, spicy red beans, mac and cheese and real deal cornbread. All served with a smile and you're treated like family... if your family is really friendly and really wants you to have a good meal. Good for your soul food.", "date": "2018-08-12 21:58:59"}
{"review_id": "r9Mr_0fIiaxfajF3rB4ecA", "user_id": "32wLHsMiyK-pz9GXyr5kyg", "business_id": "RdEb3U0CDIXElVJe3w5n6g", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This bakery is awesome. I love everything about it. The lady locks are killer, my kids love the sugar cookies. I have ordered custom cakes from them and the cake quality is fantastic. I asked the owner about their cake ingredients and she's very particular and picky about where her ingredients come from, and this shows. My kids have wanted some rather unpopular character cakes in the past and the owner being a parent I felt really could sympathize with these requests, so kudos to customer service. Always very friendly and chatty in there. It's a family business and they have been there a long time. They even have a good mid century facade with an old school inlay on the ground. I love their store front. They used to supply their baked goods at a coffee shop in the northside, but the coffee shop closed down, which is too bad, because it's a hike to ambridge from the city, but totally worth it for some traditional old school style pastries. The real deal!! plenty of street parking out front too for quick run ins.", "date": "2017-08-07 04:06:14"}
{"review_id": "Bj0SEv4YKqME21m3WmZuPQ", "user_id": "YPJzL6t9st4TrM5VBzct_A", "business_id": "7xRbOtZUuw7DxOWrHeaanw", "stars": 3.0, "useful": 1, "funny": 2, "cool": 0, "text": "I really wanted this place to be as good as it looked. And I mean literally, the food looked AMAZING. I got a chicken/rib combo that came with three whole wings, two ribs and two sides. I got collard greens and Mac and cheese. \nThere was one dude and one girl working-the young woman was very polite and helpful. The dude,on the other hand was kind of awkward and unreceptive. But no deal breakers there.\nThe fried chicken and ribs looked great but really weren't anything special. I was expecting the meat to be falling off the bone but at all seemed a bit overcooked and the ribs especially were really tough. There was a ton of meat on the bone but it wasn't very flavorful or tender. It should be noted that the breading on the chicken and the BBQ sauce for the ribs were REALLY REALLY tasty.\nAs for the sides, the collard greens were okay and the mac and cheese is possibly the best Mac I've ever had. All three of these stars are for that mother effing Mac and cheese. Go get it. Now.", "date": "2018-08-26 16:31:50"}
{"review_id": "kN9x_qJ9p3eCaZbw9sKV8Q", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "RdEb3U0CDIXElVJe3w5n6g", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "The owner of Stangl's, Lorianne, is fantastic. Her sense of humor is great and she is always willing to help you out in any way that she can, especially with orders. My donuts were delicious and the aroma was very pleasant. Stangl's has been in this business for awhile so you can be assured that they know exactly what they're doing. I highly recommend this bakery.", "date": "2017-06-15 18:58:57"}
{"review_id": "ygW_UNC2vmkwnWxudn7JyQ", "user_id": "ZnIaEvJwrxlBUjimIpx2Qw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Very good food, drinks, and service. I'm so glad this was on the Best of voting for Pittsburgh or we may have never heard about the restaurant.", "date": "2017-09-20 14:38:57"}
{"review_id": "D8YR738DaTchw4IAYx_KIA", "user_id": "Y8AacNK1oloBnkTQ3CLlEA", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I once had a place try to replace Carne Asada with ground beef. If you like that sort of thing, Tex-Mix Grill is not for you! I went there for lunch and I'm already planning to return for dinner. Loved it!!", "date": "2018-03-15 20:44:16"}
{"review_id": "sWRytxmUAZVkHbtNR5C_Vg", "user_id": "4pnOw3CT1ek8ZmzDCVA9HA", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Service was the worst I have ever experienced. The staff there got in argument with customer for 10 minutes terrible customer service also. Got attitude because the cook messed up our order. Food was alright not the best. Seems like they really didn't care that they gave us a bad experience", "date": "2018-05-19 03:08:32"}
{"review_id": "ACOR-6n6hfNhC5_YIcwO2A", "user_id": "00VGQdtbdvfYfxZIPniAqQ", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "There food was great. The taste was awesome. Service was great, very friendly. There was a good amount to choose from. Its a small place but full of heart.", "date": "2018-03-23 19:36:37"}
{"review_id": "7KGdqyFQK0r--SmNlBHPzQ", "user_id": "8lCl40obN7k8v-wc4dAaiA", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Sorry, but no.  I was looking forward to real Mexican food, this ain't it.  The people who work there are SUPER nice.  I hope they do well.", "date": "2018-03-23 23:20:30"}
{"review_id": "RIvdbfy7zi4E6v0bPsag9A", "user_id": "63E3Yawa1x-VCOmCg2IhAw", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The owner is very friendly. The waitress is so friendly and knowledgeable about the food.  I cannot race enough about how good the food is. Perfect portion sizes", "date": "2018-04-28 16:19:01"}
{"review_id": "ItcVfHsUSSiGwwBFOy9Guw", "user_id": "9k-JeB14nErxn5FiWdsGCw", "business_id": "tTDxa8OzmxUkpVifQ-cEWw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went here twice. The first time, I almost didn't order but then realized I had a few bucks in my checking account so I ran over to the ATM and placed my order. They are very fast serving up the food! The food isn't spectacular, just okay, but the portions are generous.  I believe they are take-out only.\n\nThe second time I went I had to leave because I only had plastic, no cash. I am glad I know about this place, though. So many of the Ambridge businesses are closed down now. It's great to see one that's thriving.", "date": "2018-07-18 00:30:39"}
{"review_id": "RXRfhia2ME1ONlBh_j5_Tw", "user_id": "VmRRY6ecwc1UqDwIfwwfnQ", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 2, "text": "Not for me, unfortunately. The beans were delicious, and the rice was good. The tacos themselves, however, were way too greasy. It overpowered any flavor the tacos had. Food was overpriced as well.", "date": "2018-05-09 21:27:34"}
{"review_id": "iOJOb4s2m3V09I3QeFEnDQ", "user_id": "oqkJSYgTKGYQvvciI6NyOA", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "Best Carne Asada tacos in PA! The corn tortillas are really good. The staff was really friendly.", "date": "2018-05-20 00:16:19"}
{"review_id": "_ABqaLzT9T-ZhTSWeoWgsA", "user_id": "wqrkoO4OISQ9LudoQhbdXw", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Love this place!!! Awesome food awesome service. They even have great food for kids. They have the best quesadillas in the area. Nice to finally have other options aside from American and Italian food.", "date": "2018-04-28 01:38:39"}
{"review_id": "V7oWCpzCMIduGA8Y8ZDHHA", "user_id": "jaRlehMTQ1_fShoF75MuKA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went with 6 others there last week.  Great service,  food and drinks.  Try the Scottish eggs.  Very nice beer selection too. Was our first time there and won't be the last.", "date": "2015-12-23 05:37:35"}
{"review_id": "wKzhwsIlJ_cW5JM8UFpRHg", "user_id": "2wjIkJ31p6gzbzQmjVV1ug", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have been here several times and had the steak sandwich, which is made with real pieces of steak. It's been delicious everytime. \n\nMy wife loves the club sandwich, because it has real turkey and ham on it. Not lunch meat.", "date": "2015-11-11 01:12:06"}
{"review_id": "KN9ADfvAwPkQPXuiRyYK3g", "user_id": "ZQrFyBFKvb4hVq2eVCkygQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Just stopped in with my brother for a couple beers. Impressive selections on the craft beer menu and our bartender was an excellent guide. We'll be back for lunch 'cause that menu looks good. Wow, Bridgetown Taphouse - in my hometown. I'm a fan!", "date": "2015-12-22 21:19:26"}
{"review_id": "-_cVQ11Ms1nWRmZsr9f64w", "user_id": "_c_qAv00T9RIkYudBCy3NQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "So I had a long standing bad review here from when they first opened.    Mostly it was the waitress really rubbed is the wrong way and was just plain nasty.\n\nWell it's been a couple years and decided to give it another shot.   I'm glad we did because the food has improved and has been very consistent over our past 3 visits.    Each time the bartender/waitress has been good and friendly.\n\nWe'll be back again.", "date": "2018-03-05 00:57:47"}
{"review_id": "yq_Qq2uXWdxfEf4WR-Q-sA", "user_id": "-3uEQhR9MXaC5QTHJ4lraw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "A great neighborhood bar. The service was friendly and quick.  Has a nice beer selection on tap.  The hippie (portobello) sandwich and the pulled pork sandwich were both quite good.  Fries and tots, with seasoning, were excellent... Not at all greasy. The kitchen clearly cares about the food they are serving.  Will definitely return to try more on this interesting menu.", "date": "2016-08-26 23:10:40"}
{"review_id": "kY5Hac3Mhln1PTw2VADRtg", "user_id": "LQrkhlBReTeGMvC2z7cYtw", "business_id": "gOu6hTevtDeTBNMOjo6fsw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! The people are always kind and more than happy to help, the products range in quality and price so they have something for everyone! Give them a chance and you shan't be disappointed!", "date": "2018-04-18 02:46:01"}
{"review_id": "Sq0KymNQe_q85pfCI7y3kg", "user_id": "vCMLDTmNQJTshp0buV1JaA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Good beer selection! Cocktails are a bit overpriced for the suburbs. Food is pretty good. Good atmosphere. Nice place to hang out! Hard to find around Beaver County!", "date": "2016-04-01 01:58:29"}
{"review_id": "7Ih68p9mGnqklPkZDacRDw", "user_id": "eARYyy5P1C-DURCMc6_8Ow", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Just more and more impressed each time I visit.  Food, service, atmosphere are all excellent. So happy this place exists in Ambridge!", "date": "2018-04-06 13:06:05"}
{"review_id": "qeAqPXuaGni_egIXngtRXA", "user_id": "WB2pSePQ7kdTSXwLi4vU6g", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place.  The wings are amazing, the beer selection stellar, the waitresses are great.  They serve Tater Tots as an option as a side with their sandwiches  which are amazing.  I am a buffalo chicken wing traditionalist but I am sold on their own Bridgetown BBQ wings which are   delicious.  It's inexpensive, unpretentious and has some of the best bar food I've had in the 'burgh.", "date": "2017-04-23 00:08:39"}
{"review_id": "Px03WCQpVQr0V4Lt5nMRew", "user_id": "XItS5jQYPB7OiHcr35fITQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great sandwiches, great attentive (but not overbearing or annoying) staff, highly recommend. Nice drink and cocktail menu. If you find yourself hungry or thirsty  and in ambridge, check them out. Reasonable prices. Arsenal cider on tap.", "date": "2018-06-20 09:46:15"}
{"review_id": "XImumPjdocY8mH7ntVJn5g", "user_id": "L2flvGCgPWYqBWdLcOMNdw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place was great! I forgot that I was in Ambridge! Our waitress was super nice and knew a lot about beer, even my husband was impressed. She didn't act put out by my not wanting lettuce on my sandwich and even recommended other things I Amy like. Do yourself a favor and try the bruschetta, it's amazing!", "date": "2016-08-06 20:27:53"}
{"review_id": "_4Zwr04KiDPST_cosDjHvg", "user_id": "dZrLFOIbE8avZn3yWy2fJA", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice family owned restaurant great service but ok pizza. It was very thin when you picked up the pizza it would fall down and be at my wrist. The pizza was not cut well and hard to tear. Their cinnamon sticks were warm and a little chewy.", "date": "2015-10-19 00:11:27"}
{"review_id": "Jj1UtWRMs94H9Ji_goL2ww", "user_id": "YOqjVlydRxAViXf6wweXNA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love Love Love their Hot Wings. Wish they weren't little Wingdings but the taste is really good to be bar food", "date": "2018-07-10 04:20:58"}
{"review_id": "FyI3_8T60yfVZ146Q-A4Jw", "user_id": "21D8GYYY-NptvXhBb9x08Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Seriously, some of the absolute best burgers. Period! Anywhere. Great wings. Service a little slow but extremely well mannered and polite. I highly recommend this place.", "date": "2016-02-27 14:49:41"}
{"review_id": "oE8uMSiw1pXwqD-qMxXrGw", "user_id": "IOYbJgL67pkodqDGr1rIXg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here last Friday at about 6:30 with a couple of friends, and it was hopping. Not a lot of people waiting for a table, but still about  1/2 hour wait. Saw some seats open at the bar and pounced. Good beer and cocktail selection. Ordered a fish sandwich with fries, only available on Fridays. I've been on a fish sandwich streak lately, and I'm not even Catholic!  It was the best one I've had in quite a while - huge piece of fish, nicely crisped, with lettuce and tomato and tartar on the side. And the fries were fresh cut, hot and unsalted (or very lightly) which I love - let ME figure out how much salt they need instead of the entire lick most places put on. And a little cup of slaw that was not bathed in a creamery and had a little peppery bite. Friends had a burger and a turkey burger, and both really liked them. Will be back THIS Friday!", "date": "2016-03-09 20:11:32"}
{"review_id": "zDs53EwZPYc6ERxtWeMQGg", "user_id": "5buZZAON8mpyvQP1ZHViQA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This place is excellent! The best beer cheese I've ever had. Fresh cut fries and great brioche bun on La Flama grilled chicken sandwich. The Cuban is also very good! Loved it. Best place to eat in Ambridge and an excellent selection of craft brews and liquor.", "date": "2017-10-05 15:40:03"}
{"review_id": "NU_6UWHiyACVqpsnV4EUsg", "user_id": "KzU6_DMa6_NRR4HTEqDm1g", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went here for the first time with my husband and we loved it.  The food and serve was awesome.  So friendly and the atmosphere was very inviting. \nDefinitely will go back.  Highly recommended.", "date": "2016-03-20 03:26:22"}
{"review_id": "-izvD8ow0Na4XOUKliJ7zw", "user_id": "R92tI-IyXm4780iJBUkJTg", "business_id": "gOu6hTevtDeTBNMOjo6fsw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome shop! All the new goodies. Very help ful an knowledgeable. And they carry Sour's Syrup! If you live around Ambridge it's worth checking out for sure!", "date": "2016-01-20 23:36:20"}
{"review_id": "znHnxZrADzPLuSkT0i9xzA", "user_id": "3DltS5Wr9MOntnc8StBFBA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 5, "funny": 0, "cool": 3, "text": "Bridgetown Taphouse is a soon to be (not quite open yet, as of 2-18-2015) gastropub and beer smorgasbord in Ambridge, PA, featuring hearty, homemade cold weather menu items that are sure to warm your stomach and drinks that are sure to warm your soul.\n\nBut seriously, this is a new bar/taphouse run my some cool kids I went to school with. The beer is sure to be cold and the food should be banging, so check them out! They are right next to Yoga Edge on Merchant St.", "date": "2015-02-18 19:43:56"}
{"review_id": "tSotSzD_m8Hx-PMYyVDlfA", "user_id": "91koVXu54Y6tIiZKKxVmrw", "business_id": "EZ9zSk4ld27LwgfANoF4VA", "stars": 2.0, "useful": 2, "funny": 1, "cool": 0, "text": "Rented a two man earth drill to do some post hole digging and I found out that the machine was given to me with bad gas in it. I had to shut down my work crew and take care of the problem by emptying and filling the gas up. I returned the machine the next morning and they were reluctant to to offer me any money back for setting me up with a bad piece of equipment.  I won't be back here.", "date": "2016-08-15 13:14:45"}
{"review_id": "rYlIhJoISy5klgAWySj-pg", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "I have heard a lot of great things about Bridgetown since its opening and finally decided to make a visit. The atmosphere was great. I loved that it was a non-smoking pub and had a clean, welcoming environment. The food is great, the staff is very friendly and willing to help you in any way that they can, and there is plenty of seating as well. I definitely recommend this pub!", "date": "2017-06-19 17:27:16"}
{"review_id": "KajWoIs-TAxfLv4ofczbCQ", "user_id": "eYUt3Va-5w-NrCBxD_PrFA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time for dinner.  We ordered the fried pickles appetizer, la flama blanca chicken sandwich with fries, and the portobello mushroom burger with a side of coleslaw.\n\nWhat's Hot\n- Quality of food.  Hubby and I liked our food.  It was delish.  His flama blanca chicken sandwich had jalapeño slices and a spicy sauce.  It had a kick and was not overwhelming.  However, be aware if you're the type that likes your food hella spicy, this won't do it.  There is malt vinegar at the table, so you can add that to your fries, tots, whatevs.  My burger patty wasn't thin and cooked to order.  \n- Non mayo coleslaw.  Dudes, it's cool to find a place where the coleslaw isn't made with mayo.  Their coleslaw is made with a vinegar sauce and there are red onion slices in the coleslaw, too.  Something different, yet delicious.  \n- Fried pickles.  They use pickles from a local Burgh pickle company, which is delish.  Their fried pickles aren't overly breaded, too, which I like.  For me, if a fried dish is thickly battered, that tells me you're trying to hide something.  These pickles are definitely sour, but have a nice flavor.  \n- Price.  For the most part, their prices are reasonable and are reflective of their portions.  For example, my burger was around $10.  The fried pickles are pricey- around $7.  Total for me and hubby was around $35, including tip.\n- Menu variety.  The menu options are decent.  It's a one page menu.  You're not overwhelmed with choices.  They have a decent bar/drinks menu, too.  It's a one small one page menu- a few wines, a handful of mixed drinks, and half the page is beer.\n- Service.  No complaints.  The waitresses were nice, helpful, and attentive.  \n\nWhat's Not\n- Layout.  To be fair, many bars/taphouses in the Burgh are small.  That brings its pros and cons.  This place is no different.  It's small and somewhat compact.  There aren't many tables.  It can get busy easy and when it does get busy, the sound will carry.  By the time we left, this place was less than half full and already it was difficult to have a conversation.  Be prepared to talk loudly and not be able to hear the conversation easily.  Additionally, none of the tables seat more than 4 people.  I don't recommend large groups.  If that's an issue, call ahead to make a reservation. \n- Dim.  The inside is very dimly lit, so it's not easy to see. \n- Parking.  It's a small town area, so there aren't many parking options around when it's busy.  Be prepared to parallel park in the neighborhood.  I don't think it's necessarily a bad thing, but it's not the most convenient.    \n\nFinal Answer\nWilling to come back again, but not on the top of my list.", "date": "2018-06-01 23:30:11"}
{"review_id": "hjyblcXtwkZuCh7fU4bYOA", "user_id": "1gJw6DxTrf0Zmp9gDgYlrQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Good food good drinks fun time cost a little more than most places but it's well worth it the selection of beer is awesome the kitchen really knows what they're doing I would come here every day if I lived closer I recommend everyone stops by at least checks it out", "date": "2017-10-06 17:42:24"}
{"review_id": "GAiBe-pPI0kHbh1R4fv2Mg", "user_id": "jL2FRH9igbs2sIvXBsXzdA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 3.0, "useful": 3, "funny": 1, "cool": 2, "text": "This is probably the only place in Ambridge you are ever going to  find more than one craft beer on tap.  The selection is an impressive list of all the national and local favorites.  The food is where the sweet spot is here.  It's traditional bar fare but the quality is extraordinary in comparison to the amount you pay.  The only downside to this place is the clientele.  During my visit I was the only person drinking the type of beer this places advertises itself as being a source of.  The crowd was MUCH older than me and every other guy there was drinking regular Budweiser and/or Coors Light bottles.  The bar seemed like it was more of a 1980s road house style bar until new ownership modernized the place.", "date": "2017-01-31 19:41:31"}
{"review_id": "pCYSTw7y98b7U7JS3e_eZA", "user_id": "c65gnz0er8bXNtrJUUXGug", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food and beer selection. Bartenders are very knowledgeable about the beer selection. Highly recommended.", "date": "2017-09-13 03:50:16"}
{"review_id": "KZhHmxco83Sif0zgdfUvow", "user_id": "xA4ERJDFuPDBg-0U_G3llg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best BLT I've had to date.  Not huge but a fantastic draft beer selection.  Extremely friendly staff, Kellie was bartending and her personality helped make for a great experience!  The chef came out and chatted with me and a client for awhile.  I'll be back for the Cuban next!", "date": "2018-06-13 18:28:27"}
{"review_id": "ECtDjIVT7X4ldgEW8CrNbQ", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 6, "funny": 0, "cool": 2, "text": "Great wings here. Tots are also really good. Bartenders are very nice. Great deal on wings during Steeler games. Live music every once in a while. The best thing by far is the atmosphere though. Really chill vibe here. Quiet enough that you can have a conversation without screaming to the person beside you. \n\nAbove was a draft I had a month ago. Forgot to finish it. \n\nThe place is still great. Wings are excellent. Had a group out Saturday night and our server \"pink\" was super nice and attentive.", "date": "2017-03-20 17:10:04"}
{"review_id": "6NuUTVZEhR82AtxbkimJ_g", "user_id": "bKGQuThoqBkeTqu3PsNp2g", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "4/3/16: Pulled this place up on Yelp and figured I'd try it out since I needed somewhere to read a few papers (yes, at a bar). I'm from out of town and it was a pretty drive out to this little town. I ordered a beer from their nicely sized selection, they have a full bar if you'd prefer a cocktail.  They had smaller menu which usually means what they have on it is good! \n\nI ordered the special grilled cheese that had all the BT burger toppings (fried egg, pickle slice, thick slabs of bacon, grilled onions and a delicious, slightly spicy sauce) and came with fries. Omg this was the best grilled cheese I've ever had. The bread was a nice thick Texas style so it held this big sandwich together in all of its glory. The picture I took doesn't do it justice. Every ingredient was of the correct portion. YUM :)\n\nEvery single staff member I talked to was friendly and happy! Special thanks to what seemed to be the chef who explained the specials to me and stopped by to ask me how my food was and to my awesome server Mallory!  If you're near by, stop in! You won't be disappointed. \n\nOther pros: good prices, clean bathroom and clean restaurant", "date": "2016-04-03 17:49:07"}
{"review_id": "jabTrWDLkQsxvAuqpnXOng", "user_id": "rr7TdkJOWFTB-TQ4r-FbSg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My husband and I are regular at the taphouse since it's about a 3 minute walk from our front door. The food here is fantastic. Try the tots, the steak fries, the blue ribbon chicken, and the velvet Elvis burger with peanut butter. Just try it all! Love having such good food in Ambridge!", "date": "2017-07-11 23:51:19"}
{"review_id": "OoeQIbq0z6lkVzgvSSYdUg", "user_id": "LQrkhlBReTeGMvC2z7cYtw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome awesome awesome \nGreat service great food... and amazing selection of beer!! The tater tots are the greatest.... and they always have local beer and entertainment!", "date": "2018-04-18 02:47:44"}
{"review_id": "iBGXK45iZMxlTLtncPBdzQ", "user_id": "IOYbJgL67pkodqDGr1rIXg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Went for another award-winning fish sandwich and beer tonight. Only this time the sandwich was a letdown. Sat way in the back and saw into the kitchen - racks of fried fish. What? Not sure how they do it, but the fish you order is obviously not fresh fried per order. And when I got my sandwich it tasted that way - not crispy, not fresh. Still huge, just not nearly as good. The fries were perfect - hot and crispy, the beer was cold, and the wait staff was nice and attentive. Split a half order of wings first, and they were just right. I should have gone for a burger. I understand that they have a crush on Fridays for their fish sandwich, but they have to find a better way.", "date": "2016-03-12 02:52:13"}
{"review_id": "aMhghMcJ0j19ded0LqWtQA", "user_id": "4AJmRrMX-2av6yHnrX1Z1g", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "This pizza was so good! I was hesitant to order the wings because the sauce comes on the side, but I'm so glad I did! They were great!!! Great prices too!", "date": "2016-01-10 01:59:19"}
{"review_id": "p061GmF72EsHpotqjUwJTA", "user_id": "oQBrfRN0QyO4nrwnKH1wdg", "business_id": "pcbVl6ZHDOJHsnetY0rJEQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I attended a wedding here.\nThe setting is gorgeous at this time of year.\nFlower beds are well maintained.\nThe tented pavilion is comfortable as are the chairs.\nThe spot to share wedding vows is tucked into the edge of the woods, with the pavilion as a back up site in case of rain.\nI wish I knew someone who was looking for an outdoor wedding site because I would definitely refer them to this site.", "date": "2017-09-03 02:15:39"}
{"review_id": "emxSLBHNmX8YKfvkMCw5vg", "user_id": "jnn4g_Ydkj152omk17L7Rw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "I have passed Bridgetown Taphouse for over a year when I am in Ambridge and also heard lots of friends say it was good.  My wife and I were out on Saturday and decided to try it for lunch.  We were happy we did.\n\nI had the prime rib sandwich special that came with a side of au jus for dipping and it was excellent.  We also tried the wings and they were FANTASTIC!  Good, meaty and crunchy.  Sauces were very good as well.\n\nMy wife ordered a salad and the staff was very accommodating when she realized she ordered a grilled chicken salad rather than the grilled buffalo chicken.  The waitress promptly brought the buffalo sauce and blue cheese crumbles to make the salad what she wanted.\n\nWe saw other orders come out and everything look great.  Home cooked and you can tell they take their time and prepare everything to order.\n\nAlthough the entrance to the Taphouse makes it look like you are going into a dark, dingy bar, once you enter, it was clean, well lit and friendly. \n\nIt was very good and we will be back.  Give it a try!!!!", "date": "2018-02-26 16:43:47"}
{"review_id": "1Rt_uvxFHqu5Kmh0AWyo_Q", "user_id": "VTwTxeCBonuNcTq4gyT43A", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great, excellent beer selection, really nice atmosphere. Non smoking. The food is Amazing! Fantastic burgers and fries, excellent wings! A really welcome addition to the area. If you're looking for a nice place to eat, have a few drinks and watch the game or listen to a local band, this is the place to go!", "date": "2015-11-11 03:29:25"}
{"review_id": "Snx7jLZ2AFfRTG-g_Cs6dg", "user_id": "S4hj8UEPHlogMwlxKKPNFA", "business_id": "pcbVl6ZHDOJHsnetY0rJEQ", "stars": 2.0, "useful": 4, "funny": 1, "cool": 1, "text": "I can't say much about this place except the staff isn't very helpful. We stopped in and had to search for someone to tell us they didn't carry what we were looking for. It was an unusual trip... but perhaps it was just an off day?", "date": "2012-05-14 01:40:39"}
{"review_id": "9nLVfTHNhI8ifjvOdsGO6Q", "user_id": "9hGyVsOgdavKLlfVZFF8QA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food and beer is a great selection. On a busy playoff Steeler Sunday, the bartender had the bar and the tables as well. She was absolutely excellent. Great place to visit.", "date": "2018-01-25 03:11:45"}
{"review_id": "qGfEy9O95nbeqz4KkrqXjw", "user_id": "mn8ETuf3uWOHazEFHtpiTg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely the best bar in Ambridge.  I've been threw a couple times.  It has a great atmosphere.  I nice selection of beers.  They seem to try to focus on cocktails, which is a nice change for this area.  The food gets better every time I go there.\nIt's one great place and it gets better every time I go.  They appear to be making this a destination and their efforts are paying off.", "date": "2015-11-10 20:53:22"}
{"review_id": "TLQ4cPXE2ZONJKikcAIukg", "user_id": "VmRRY6ecwc1UqDwIfwwfnQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "A welcome addition to the Ambridge neighborhood. Tasty food and generous portions. Service is friendly as well.", "date": "2018-03-08 22:19:04"}
{"review_id": "6h88DqBbwtJRhbeGOj4lvQ", "user_id": "Uz51g_KgDx7nHyHD2OXZLA", "business_id": "EZ9zSk4ld27LwgfANoF4VA", "stars": 1.0, "useful": 2, "funny": 1, "cool": 0, "text": "Poor service and highly priced and when you find assistance... You will most likely be going back for a return!!", "date": "2016-04-28 21:27:41"}
{"review_id": "fKo6pJ9D1FaMcFdxq-Iynw", "user_id": "_dpmfQXHQiVqw-RJ6khb6Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best Brew Pub in the area. Always an excellent selection of craft beers and bourbon. John the head mixologist is serious about his craft. \n\nFriendly staff, great food, and nonsmoking. BT is my go to pub.", "date": "2016-04-03 15:47:27"}
{"review_id": "0WWaqB7oqBLvqQ5Nm64wLw", "user_id": "9mch1jJ1xTNLdXAIxd_QPA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff. Great food. Great draft offering. Scotch eggs are excellent. Had a nice lunch with the family here and will be back for drinks with friends. Stop in!", "date": "2015-12-30 18:01:07"}
{"review_id": "tCmng9MhsdEGda_3QfQ9ig", "user_id": "EXBg-4gPJSHHxOvHLu0YlA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Doesn't look like much on the outside, but very clean and welcoming on the inside. Been here two Friday's in a row. Burgers were very good and the fish sandwich was amazing; piece of fish was big, light and battered perfectly (believe they have the fish on Friday's during Lent and the first Friday of every month). The female bartenders were on their A game both visits for service, not to mention their politeness and kindness. The beers on tap seem to be rotated in and out. Definitely will continue to visit BT!", "date": "2018-02-17 22:43:21"}
{"review_id": "D8TncjqEjGfcKTeBMomJag", "user_id": "gB8hGkSEUT5n6VPGHXYjbA", "business_id": "pcbVl6ZHDOJHsnetY0rJEQ", "stars": 1.0, "useful": 3, "funny": 2, "cool": 0, "text": "We attended a wedding here and was never so inconviced  attending a wedding.  From the uneven makeshift dance floor that aunt Anne twisted her ankle on to the hike up the hill to the restroom that grandma sue had a accident in her depends trying  to get to.  The owners where complete idiots.  fromHolding up the early guest in the 90* sun at the gate to creeping in the bushes and weeds spying on the guest  and shutting off lights not allowing for clean up and becoming disrespectfully to everyone including the bride minutes after the reception has ended.\n\nBut if you want to have you wedding in a nicely  landscape trailer park, bugs everywhere, and douche bag owners this is the place for you.", "date": "2012-06-13 16:27:20"}
{"review_id": "KsjOmIwBm29PDxuKZ4YUow", "user_id": "NdL61lmFwL1hKfxIudSXIQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff, great food!  Try the fish, it's delicious! An ever changing selection of beer on tap!", "date": "2016-02-29 20:02:21"}
{"review_id": "kPugF01DE0nYvMN9h2atzw", "user_id": "fGRVI0Xfgz1r4OrWrtKxPA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 6, "funny": 0, "cool": 1, "text": "Bring back the fresh burgers. I will happily pay more for them.\nThis is decent food at a decent price. I will go back.", "date": "2017-09-25 21:39:35"}
{"review_id": "WODhWVSTh3t480RTc3_6UQ", "user_id": "m5S0MzB5x4ufSRc0JEC8cQ", "business_id": "tTDxa8OzmxUkpVifQ-cEWw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 1, "text": "Decent Chinese food. Not the greatest, but decent. A little pricey, but nice and local. Delivery is nice, always in a timely manner, but only accepts cash.", "date": "2015-11-02 21:51:57"}
{"review_id": "YG6ijhEcD-ubnCMVDewXVg", "user_id": "_pLmakEC1U8UPpxCUk2ZAg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Solid burger, great draft list, and a delicious honey mustard. Cuban is pretty tasty too though mustard/pickle distribution heavily favored only one half. Felt meh about the first half, and I loved the second half! ;)\n\nDownsides, it is really loud and there isn't much seating. When you go in, you don't really know what to do. Do you wait to be seated? Grab a table? If there are no tables, do you wait? Does someone make a list or do you just stand there and hope to grab a table in the dining room once someone gets up? On our second visit we opted not to wait and see what the procedure was because we had no idea how many people might be there wanting a table before us. We just went elsewhere. \n\nWe will probably hit this place up again if in the area and not during regular dinner hours (busy and so so loud).", "date": "2017-04-26 15:21:32"}
{"review_id": "x3Q4QOlU2CZG6qrKKId_xQ", "user_id": "Fn4k4i0PRExLUEH3RYEV6Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Every time I go here, I like it more.  From the great beers to the good food and the excellent staff.  The staff really make the whole experience come together.  They consistently come up with good ideas, accommodate our kids (and the adults).", "date": "2017-02-05 03:10:15"}
{"review_id": "eGoPbuUXatsdANsIuqCMIg", "user_id": "ujdeZDrN1z3I2rzTgU96cA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "We recently celebrated my mom's birthday here.  The wait staff was extremely nice and attentive, the food was delicious, and the tap selection was really good.  It was perfect!  I'll definitely be back!", "date": "2017-01-24 18:30:20"}
{"review_id": "vSqeKbSNDj4jW46r1v-gYA", "user_id": "R92tI-IyXm4780iJBUkJTg", "business_id": "gOu6hTevtDeTBNMOjo6fsw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome shop with very knowledgable staff! Awesome community oriented shop! They hold cloud comps often and have the new stuff all the time! Huge juice selection as well! #sourssyrup and other local favorites!", "date": "2016-03-04 02:20:02"}
{"review_id": "cJxnl9BBb4N1qTIPhhLDOQ", "user_id": "XPkEl6t9Nw3yyGwka8h72Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "One of my favorite places in Beaver County. Burgers are amazing, and they have tater tots!!! Ask for the BT dust on them - you won't regret it. Awesome beer selection too, and much cheaper than many other bars. I can't recommend enough!", "date": "2017-04-16 14:29:12"}
{"review_id": "0HKk6DLuyrrLX3_M2Mfykg", "user_id": "phsDm7coAiXBV4rCEURedA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 3.0, "useful": 3, "funny": 1, "cool": 1, "text": "Ughhhhh. Wanted to love this place -had it added to my \"want to try\" collection in Yelp. Service though was so subpar.  They were not busy but I think the server for the back seating was also the bartender. We got one drink each but would've ordered more. Our waters were refilled once.  Food was good but not enough to overcome the lack of attention from the server.  Nice local spot but don't expect much from staff.", "date": "2018-07-15 18:25:48"}
{"review_id": "Qm_txNCIdfrwxxohhXhrfA", "user_id": "wvLzHjWKwkCuEzWdTVdiGg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Even tho it was a busy Saturday night, we were seated immediately - Renee sat us and took our order and our drinks were out in no time. My wife and I shared the Bridgeport Burger with tots but not before munching on the Scotch Eggs app which were eggs-cellent!! The Burger was cooked to order and very good. A great experience start to finish!", "date": "2016-11-20 00:36:12"}
{"review_id": "JjLvmWTtMWgyjzgEB_P5ug", "user_id": "nyDnFjdfdDm2_e1rSjZxSg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 4, "funny": 0, "cool": 1, "text": "Did a search for a brewpub on my way to Pitt Intl Airport to save us the expensive and usually lousy airport food.  Boy am I glad we picked this place!  Excellent beer selection and everything on the menu looked great making decisions tough.  Burgers were perfectly cooked, huge and tasty.  Did I mention the owner took care of us, was extremely friendly and service was quick?  Don't pass on the fresh tater tots with your meal!", "date": "2017-11-03 17:56:55"}
{"review_id": "Hez2M0exiuK3jkFovZqEgA", "user_id": "e-2sL5zcZ0Mnoa-eGkfuqA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great service no wait and bar tender is polite and on point. Will return.", "date": "2015-10-15 10:59:35"}
{"review_id": "iOngh_9f2f_I0pjMwa66SA", "user_id": "m5S0MzB5x4ufSRc0JEC8cQ", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Since moving to Ambridge, this is our go-to pizza place. Great pizza, great prices. Love their appetizers, too!", "date": "2015-11-02 21:41:57"}
{"review_id": "uLPBoBK_wsibSS_MHE0Dog", "user_id": "DAQ1i3IWhybknyrCnDqjWw", "business_id": "EZ9zSk4ld27LwgfANoF4VA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Always helpful!  Always friendly! The place to go for many needs.  My husband even buys his jeans there!", "date": "2016-11-05 13:54:27"}
{"review_id": "GS3vCSqfx-06SKydIfu_2Q", "user_id": "B82nUzqvSHdOj1gShxRaxw", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 5.0, "useful": 3, "funny": 1, "cool": 0, "text": "Fox's has the best wings in town, delicious pizza, and literally the best ham and cheese sub I've had in ages.\n\nThe wings are breaded and baked.  The pizza is very tasty and the cheese is mouthwatering.  The ham and cheese sub is baked as well with an almost sweet mayonnaise and great veggies on top.\n\nDid I eat there two days in a row?  Yes, yes I did.", "date": "2015-04-24 21:37:45"}
{"review_id": "ktOYRsQpzA_DQFni-R7Ynw", "user_id": "VENurDsqZxxtSxlQBN5i0w", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 1.0, "useful": 0, "funny": 2, "cool": 0, "text": "Walked in on a Sunday after church for lunch.  There were three families so we needed seating for 13.  The bartender/waitress gave major attitude about having to push a couple of tables together and scolded us for not calling ahead.  We proceeded to walk out and was scolded once more in front of our small children since their staffing issues were clearly our fault.", "date": "2018-03-03 22:11:57"}
{"review_id": "lh2HxttzFwCTca8yFv_n5Q", "user_id": "vj0Qdfc-Nrsf3HkqAYreyw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent beer selection and the burgers are fantastic. Great service and very affordable.", "date": "2018-03-22 19:07:36"}
{"review_id": "9T5Q1RgNFXqbYKtBIpR4ug", "user_id": "uTFgU2PZwxyksDwkOkrb1A", "business_id": "EZ9zSk4ld27LwgfANoF4VA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This store has a lot of interesting things, definitely not your ordinary hardware store. But the best thing about this place is the people who work there. We were escorted from department to department while looking for various items that we needed for a project and every person was friendly and knowledgable. \n\nWhen it came time for us to purchase a new grill, we researched options and went shopping.  After going to two big box hardware stores and having difficulty locating our pick and being informed of the extra charges, we called Ambridge Do It Best.  Pete was very helpful and basically sold it to us over the phone!  Not only did they have the grill in stock, they had a person to assemble it and a two man team to deliver it, FREE of charge! AND, they took our old grill and disposed of it as well!\n\nI thought that Mom & Pop stores would be outrageously overpriced, but this is a definite misconception! Great prices and inventory, and  an awesome staff!", "date": "2017-05-20 00:15:06"}
{"review_id": "hmxHo-M8svRSWTMM7JL_rQ", "user_id": "VF3b_wmus4G5DNw2BuB50Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "A few months ago, a friend of mine described Bridgetown Taphouse as the best bar within ten miles either direction on Route 65. After several months, I can say it is one of the best restaurants, as well. \n\nThey recently started starting serving food and while the price is right, the quantity and quality is right, too. My wife and I both had a great meal with fresh ingredients for barely over $15. The plate size was enough that we had to take a box to go. \n\nIf you're looking to avoid the Cranberry or Robinson traffic and prices, this is a great place to consider. The staff is fast, friendly, and knowledgable. The food and drink selection is some of the best in the area. I can not say enough great things about this place. \n\nMy wife had a club sandwich with fresh, hand cut fries. The ham, turkey, and bacon were all brimming with flavor and thick cut. The bread was fresh, as well. I tried the hippie sandwich with tater tots. The tots were loaded with flavor and not greasy at all. The sandwich was loaded with a multitude of fresh veggies and topped with flavorful cheese and sauce. \n\nIf you're looking for a great, inexpensive meal in a fresh, clean environment try Bridgetown Taphouse. If you're looking for a clean, local place to catch a game with friends try Bridgetown Taphouse. If you're looking for a quick bite or drink after work, try Bridgetown Taphouse. \n\nA+ on all levels.", "date": "2015-08-14 21:08:11"}
{"review_id": "_PF9jeAEpNHJ_194x4bMIA", "user_id": "Ns2p1w01rPVVeGZQPJzLdA", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent food beer and service. Thanks yelp! Next time in area we will b back!  Don't pass this place up!", "date": "2018-05-25 22:51:41"}
{"review_id": "mUymj48rDwsoHGFE9zQIkQ", "user_id": "FNpdDqeTRi4Rqe7eeq5w3Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "This was my second time at BT. \nI enjoyed it just as much as the first time. \nI was greeted immediately upon entering the non-smoking bar on my way to the dining area in the back. \nThere are several t.v. sets all set to different channels with no sound. I liked that approach. \nGreat music is playing the entire time at a decent decibel. You can hear it but don't need to scream to be heard either. \nKelly was my server. She was very friendly, knowledgeable & attentive. \nBruschetta was our appetizer. It had wonderful flavor & was plated nicely. \nWe dined on the Bridgetown salad with chicken. \nI don't like bleu cheese dressing but my daughter insisted that I try it on the first visit. It was so good & different that I actually requested it for my salad. \nGenerous portions of food. Pleasant atmosphere. \nFriendly service. \nI really enjoyed my dining experience & look forward to frequenting this business.", "date": "2017-06-13 20:41:51"}
{"review_id": "AVujMkzW3CD2hO1bXw3hAQ", "user_id": "m2uTGkOKcXqQJSmvsYvtMg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "Had the Bridgetown burger which was excellent along with the fresh cut fries. \nHubby disappointed with the soup special (kielbasa & saurkraut) - said it didn't taste bad but there were only a few pieces of ground up keilbasa.  His burger, the Pittsburgher, was good also but said they need a better capicola.\nNice decor, server friendly. \nOnly bad thing is there was a bad sewer odor.  Please get it fixed.", "date": "2016-11-21 00:25:09"}
{"review_id": "IkxM7hj_J7rE0hB6CcO6dA", "user_id": "RLRYmD7XdbQPgXhlFI_Y7A", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "A hard and crunchy burger even I though I ordered it medium and I personally hate that slaw. And I have not a met a single person who likes their food. They warned me and I went anyway. And now I know. Bar food is supposed to be good. Not this bar food.", "date": "2016-10-10 00:25:09"}
{"review_id": "4RZ5Z2Q_qhQvxHs6YqQvlg", "user_id": "oQBrfRN0QyO4nrwnKH1wdg", "business_id": "pcbVl6ZHDOJHsnetY0rJEQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I attended a wedding here.\nThe setting is gorgeous at this time of year.\nFlower beds are well maintained.\nThe tented pavilion is comfortable as are the chairs", "date": "2017-08-26 20:39:52"}
{"review_id": "1ILWgG4u9cC-BsPXawbiBg", "user_id": "sOilDY6Ujhh97A2utX3l1Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was really looking forward to going to this place due to the high review scores and pictures, and i wish I could give it a 5 star review. The food was excellent (pretzels app and pulled pork sandwich) and the atmosphere was laid back. They were out of their fried pickle appetizer (and charged us anyway, I had to ask for it to be taken off the check) but the real issue here was the service. Even at 9pm on a Saturday they were not very busy, but even with mostly open tables it took our server forever. For everything. Need a refill? Should probably plan on getting it yourself. Maybe with a different server this place could've gotten a 5? Probably won't be back to find out though.", "date": "2018-07-15 04:55:57"}
{"review_id": "kqpvjjCZtX_C9o6ZJ_IuVg", "user_id": "qrBoT64K23Qq4FTF09hXww", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to Pitt a dozen times and wanted to try something new, so found this place. It had a great little hometown atmosphere and the bartender was amazing. She had a lot of recommendations for us regarding the food and beer selection, all were great. Food is fresh and the only things they freeze are edamame and tots. We got the Bridgetown and Pittsburgher, and they were seriously the best burgers I've ever had. Would highly recommend and will def be back!", "date": "2016-06-20 16:00:28"}
{"review_id": "YzGkIfoiRnxmsf3MSzVzFw", "user_id": "JIndmtPC89b3IWPeozBJWg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I like this place.  Great burger, slaw was a little less vinger-y then I like but worked.  Appreciated the atmosphere and the service was great.  Will return.", "date": "2017-06-14 18:56:21"}
{"review_id": "1wLM2napUXVmCLhnupLnUg", "user_id": "EnjSDzvxOx93m2J83avvBg", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Hands down my favorite pizza thats available during the day! Also, I love their steak wedgies!", "date": "2017-04-15 01:32:58"}
{"review_id": "nmDMqeUBmu3gOGlr81LiKQ", "user_id": "sTG6rcIMAHDcbInewd1YGg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Where to start... The Bridgetown Tap House has been my go to for an occasional happy hour, take out and weekend hangout when I have a free moment. The beer selection is great!  They keep good craft beers on tap, featuring a variety of darks, ipa's and seasonals. They keep at least one hard cider and Gunness on tap. They also have a good verity of craft bottled beers. And of course they have the standards. The staff can help you with your selection because they know their beers. They keep a current beer menu and will get you a sample if you just can't make up your kind.  The mixed drinks are really good. They use fresh ingredients and have a good selection of top shelf options. Ok that covers the drinks. The food is really really good!  Yes it's a pub, but they do it right. Quality ingredients prepared right. You can tell they focus on the details. The burgers are great!  Thick applewood smoked bacon, quality cheeses, bakery fresh buns, red onions, fresh greens, thick tomatoes...  Again, you can tell they focus on the details to make simple foods really good. The fries are fresh cut and they keep the cooking oils fresh so they always taste great. They also have a variety of chicken sandwich. They marinaded the chicken and it always comes out tender and juicy. Their club sandwich with sundries tomato mayo is excellent. The wings are great, the scotch eggs are really good and they have good dinner and side salads.   The place is kept really clean, plenty of tv screens to keep up with the game. Plenty of parking across the street.  It has a great mix of people with a friendly home town pub feel with great beer and great food.", "date": "2017-03-23 02:39:52"}
{"review_id": "OulxZe2S-l5-A0zlZa0mqg", "user_id": "2UGnRhCO5pUWplHiagfYgw", "business_id": "tTDxa8OzmxUkpVifQ-cEWw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great food!! Outstanding quality! They are super  fast and I've gotten food here three time and they never seem to disappoint. I recently moved here and it's a very short walk from my apartment. The only reason I didn't give them five is because they aren't that great at customer service.", "date": "2018-03-29 13:39:27"}
{"review_id": "c95I-CqX3LTCxxyllUriTw", "user_id": "LrxDx-_px4mW4_u5fx_mRw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I were looking for a place with good food and beer that was open on a Tuesday.  A friend recommended this place and I'm glad we went.  Crowd ranged from 20s- people who looked to be in their 80s.  Food was very good.  I had the Cuban with fries and she had the BLT with tots.  I preferred the tots, but both were good.  Appetizer was deep fried pickles that were lightly breaded and perfect.  Nice beer selection.  First time I've seen Blue Canoe here in the Valley.  Staff was fantastic.  Twice when my beer was empty while our waitress was off getting me another, a different server came over to see if I needed another.  They were really on top of things.  We'll be back.", "date": "2016-06-08 18:52:13"}
{"review_id": "GCtWtWZ8yxqdlfoQOpjRoQ", "user_id": "91koVXu54Y6tIiZKKxVmrw", "business_id": "4mpSNvmyG89Uqy2ahP4JMQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I stopped in here after seeing some Facebook posts about them opening up in the area. I was really glad that I did. The food was very filling!  I got takeout so I can't rate the wait service. \n\nThe location is very small but with food that good it doesn't matter.", "date": "2018-04-01 12:16:40"}
{"review_id": "gs60Pg1UZeNIPAllGM4I7g", "user_id": "SVmnpVGTbuRc81A9kFwYGg", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely the BEST pizzeria Ambridge has to offer!! The menu is fantastic and food is always hot and delicious upon delivery. Great large menu with good prices, and trust me--Foxs is extremely generous with the pizza cheese! Yummy! Best pizzeria around by far...", "date": "2018-09-24 12:12:18"}
{"review_id": "js_s0o390gbWyuLomlJifw", "user_id": "g08bkzhvjsST-0g2TfEg7Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place was a gem. The turkey chili was phenomenal and unique. Had a dry rub for the wings, the BT dust, which I'd recommend. We split a fish sandwich that was huge. The fries were perfectly crunchy. And even the coleslaw was a delight. Non creamy and addicting. Definitely a place to come back to.", "date": "2017-04-07 16:42:39"}
{"review_id": "HEmrELmiZPhiPiF5e-ABug", "user_id": "rk3wVTj-FQZHT7RhqyPChg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome staff. Great place to hangout and meet new friends. Wide selection of beers at reasonable prices. Great liquor selection. I'm a whiskey girl and was kept quite happy in their beer dominated world. \n\nI can't wait to try the food. I've been going since their opening weekend and it's been wonderful each time.", "date": "2015-10-07 16:13:05"}
{"review_id": "nvPNFw0ef0umagMUxVM9pw", "user_id": "RLRYmD7XdbQPgXhlFI_Y7A", "business_id": "tTDxa8OzmxUkpVifQ-cEWw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Their Hunan dishes are delicious and their fried rice is the best BUT 2 things to ABSOLUTELY AVOID is their Hot and Spicy Shrimp. It is neither. Just a bunch of stuff in a very sweet orange sauce and their Won Ton Soup. These are very hard lumps of pork filled pockets. You cannot cut them.", "date": "2017-10-22 21:34:19"}
{"review_id": "0bQ1DTKlRcEqhYemXUQYIA", "user_id": "lAbAxv9I7V6Bdh0W2HmXfw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place... really good food...have had the Cuban, spicy chicken, wings, salads, Scottish eggs, fried pickles, burgers...everything excellent...chicken was huge breast and very moist\n\nBeer selection is solid...good local selection with a variety on tap an some unique cans and bottles", "date": "2018-02-17 13:13:59"}
{"review_id": "dSystDMxDiOGSONkmCjZww", "user_id": "9Nr_O1lfxFqYvnDg-a0WNg", "business_id": "0EyRe-VkW8gYxxZ7NCQXeQ", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I called in an order after a long day expecting it to be ready so I could go home with dinner. I ordered a bbq chicken pizza and cheesy breadsticks, when I arrived, I found a buffalo chicken pizza. I explained to the girl I ordered a bbq chicken not buffalo chicken pizza, I understand mistakes happen I would have taken the wrong pizza at a discounted price so I wouldn't have to wait, but that was not offered. When the manager or owner came out from the back there was no apology or explanation. I was given the correct order, with cold breadsticks in the end. The pizza is decent, however the service is not worth the trip.", "date": "2018-06-07 23:14:34"}
{"review_id": "VOUWgCcpwHTfSwwLxxtbnA", "user_id": "K84I8Zgmsbypg3AmMAVS9Q", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 4, "funny": 0, "cool": 0, "text": "So my current work has me situated in the Ambridge area, and having spent years in this area, I assumed that there was nothing new in \"Bridgetown\".  Was I ever wrong.  I have to hand it to these guys, they put together a great draft list, kick ass bar and some very fine eats.  To that, I have been twice in one week so I think I can safely give my fellow Yelpers a solid review.   \n\nBoth times have been for lunch, but I will be heading back for dinner this week so I will give an update on that.   First I had the bruschetta chicken sandwich.  I have to say, solid idea with a nice piece of grilled chicken breast, not cut to thick or thin (bun sized), with fresh mozzarella on top.  The chopped tomatoes were nicely dressed and made for a great bite.  The next visit I had to try the Cuban.  One of my coworkers had it the first visit and I nearly took a bite off of his plate.  Solidly one of the best Cubans I have ever had in my life.  They have this down to a science.  They use a very high quality smoked ham, sliced perfectly.   A house smoked pulled pork, just the right tang on the pickle and the exotic (not sure what kind) mustard kick was the cherry on top.   \n\nThey serve these sandwiches with either fries (very good), or tots (amazing).  Tots are an under-served side car these days, our friends at BT have found a way to make them mainstream.  If you get the tots, ask for the \"dust\" on the top.  Just like the 'spice' in Dune, this stuff is magically.  No ketchup or condiments needed if you get your tots dusted.  \n\nI have not experienced much of the draft list, just a few tastes.  I will say that it is solid and will update it as soon as I get a solid session in at the bar.  I suggest if you are near the BT, you stop in.", "date": "2017-08-27 17:49:13"}
{"review_id": "ZP5CiQwMLmnPkPA95VZK_w", "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great place that you wouldn't expect to be in Ambridge. I like to compare it to Hollywood Gardens in Rochester. Nice feel but less taps and beer options. Food Prices are decent, but the drinks are pricey. Limited menu but the food is very good.\n\nWho doesn't love a place that serves tots? Some recommendations - burger, Cuban, pulled pork, steak sandwich and dry wings.", "date": "2016-07-06 23:04:39"}
{"review_id": "ACEu-z3kTl9x_gpgVq-lzg", "user_id": "6BO5oaHeIHABpa0jjpHkDg", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We love this place! Great bar tenders, cool beer selection, industrial vibe, live music on the weekends. Definitely a cool spot!", "date": "2016-02-10 20:43:21"}
{"review_id": "mTxWco0XU3vtHFO3oW2rnw", "user_id": "T0FcRJJZjPxpQ6TZ726gWA", "business_id": "EZ9zSk4ld27LwgfANoF4VA", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Friendly and helpful staff always willing to assist. While most hardware stores  disappoint when variety is desired or \"odd-ball\" items  are needed, this store shines. Prices might be a few percentage points higher than some other places (my only reason for giving 4 and not 5 stars), but it's well worth it in the time and energy (not to mention fuel)  it saves to not have look elsewhere.", "date": "2016-05-30 22:55:20"}
{"review_id": "8vKDQyCHdIHf80f27mOwXw", "user_id": "_c_qAv00T9RIkYudBCy3NQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I hate to buck the trend of 5 star reviews.  But my first visit I was not impressed.\n\nThings started out on the wrong foot when our waitress came to the table.   She litterly yelled at us for borrowing a beer list from the empty table next to us.  The attitude never faded from there even after we tried to be polite as possible.\n\nThis alone was enough to make me walk out.   But we stuck it out and ordered.\n\nI had the pulled pork which was clearly from a can.  Not only was it refrigerator cool in the center it had zero flavor without the sauce.\n\nI will say the tater tots were perfectly cooked, and there were a lot of them.\n\nI'll give it another shake one day, but if I see our waitress I'll ask to be seated elsewhere.", "date": "2016-06-10 21:11:21"}
{"review_id": "8odAO3gLebrJsJKi7VaWHA", "user_id": "QNecf-DovpR9IVq1z1YJbw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We ran into this place on a whim and I am so glad we did! Don't know much about beer but this was the absolute best burger I've ever had. Tons of flavor, cooked perfectly, juicy, and amazing! Fries were great too! Waitstaff was super friendly and helped pick a perfect cider. It's a small cozy bar with great atmosphere! I will be stopping back any time I am near Pittsburgh!", "date": "2015-11-16 22:48:03"}
{"review_id": "NiPg63ZOANN7GSF8keyLSQ", "user_id": "oeKfqWJc7XA4c8FoUuxAdA", "business_id": "pcbVl6ZHDOJHsnetY0rJEQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "went to a wedding here over the weekend. it was a beautiful venue. Friendly & helpful staff too.", "date": "2013-10-01 01:38:39"}
{"review_id": "Lifo457DwNGYN7GJydAwSw", "user_id": "C5rcF51qtGF57OWxfhCBzQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great beer selection and awesome staff. Had the sausage meatball sandwich and fries, both were very good. Hung out at the bar after dinner and had a nice conversation with the owner. Will definitely be back the next time I'm in the Pittsburgh area.", "date": "2016-03-06 17:17:33"}
{"review_id": "7GycrjM2XnmWnpSEFhOTTA", "user_id": "sy_uis3d_sgIGodPZktQcQ", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My boyfriend and I went here tonight for dinner and some drinks. We both loved it! We started with tater tots with DT dust (based on other recommendations on yelp) and they did not disappoint! I had the salad special and wings with lemon pepper dry rub. The wings were incredible! Very crispy and amazing flavor. My boyfriend had the buffalo chicken salad. The chicken was grilled chicken and he really enjoyed it. I am a big hard cider lover. They had arsenal on draft and many different flavors of Blake's cider in cans. I had never heard of Blake's cider so I really enjoyed trying something new. Our waiter was very attentive and the service overall was great. Can't wait to go back!", "date": "2017-06-17 01:15:26"}
{"review_id": "YuLDKmcoYoDOFPgAWm9L1A", "user_id": "wFFLWorAWh3hpxVLQP8YWw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "FINALLY... you don't  have to go to the \"South Side\"for a great sandwich & beer and watch the game!!  Nice selection ...reasonable prices. ..wonderful staff!! Great going Matt ... and partners:-)", "date": "2015-08-19 01:00:46"}
{"review_id": "kakdcMJlDEtAF3Jtesow6A", "user_id": "VfD-7Wk7Y1dypmhlo0fhhw", "business_id": "N92Pbr2ygKDLkjmr-4BAPw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We had delicious food, great beers and wonderful service at the Bridgetown Taphouse. It's so wonderful to have a place like this in Ambridge and my family and I will continue to support this business!", "date": "2015-10-05 02:41:14"}
{"review_id": "SJ6YgwGNN1C5Z6yMksWBYg", "user_id": "e7DKtHWUtzJpje_fml2h8g", "business_id": "gOu6hTevtDeTBNMOjo6fsw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This used to be my favorite places to go for all my vape needs... been a customer about 2 years now and I'm going to be brutally honest.... I never want to step foot into that store again. The new employee who took place of the person who had been our go to since day 1 has been nothing but rude to my fiance and I. \nUninviting body language - assuming we want to buy some thing when we ask to taste the juice - not setting up properly for tasting juice  (telling us to put a drop on our finger to taste)  \nI am overall unhappy with the change in quality service there.... This is coming from a customer who's spent thousands of dollars here", "date": "2017-10-02 00:45:10"}
{"review_id": "ovFxbdMvTCdvCh1u3_uncw", "user_id": "y4a_7xpbvRvCGwMNY4iRhQ", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place.  I always get a cup of brewed coffee with two shots of espresso. It's always perfect, fast, and it always comes with a smile and a bit of conversation.  The place always has customers, but I never seem to have to wait like at Starbucks.  For some reason, every time I head out with my perfect cup of to-go coffee, I feel very lucky.  :-)", "date": "2018-03-24 14:26:20"}
{"review_id": "z6cC48RwoSjoWi4izTELlA", "user_id": "VuzmlC_y5fg39lkBzKExdA", "business_id": "zBeUDwWx73QTZ34A1l0adQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered from this place at 1:45pm, the online service told me it left the store at 2:06. 3:00 rolls around, and I call the store because I live only 0.8 miles away, it should've gotten here by now. The person who answers is rude AS SOON AS I GET ON THE PHONE. Says that I don't answer my phone, which is actually my fault. It was an old number put on my account and I didn't realize it. But this rude person said the driver knocked on my front and back door. WRONG. I was sitting RIGHT next to my door THE WHOLE TIME. NOBODY KNOCKED ON MY DOOR. Of course after I said this the person got EVEN MORE RUDE, so I did too. They told me the only thing they could do is send them back out. I don't want the cold pizza after you lied about knocking on my doors? Continued to be rude, then told me I couldn't order from there ever again. Good, after that crappy customer service, I don't want to order from there ever again. Hung up on me. I called back, asked for a refund for the pizza I wasn't getting. Told me no, I wasn't getting a refund, I wasn't getting anything from them. I had to call the customer service line and get a refund. Don't eat at this place, they obviously are very rude and don't give two craps about their customers.", "date": "2017-04-30 19:34:30"}
{"review_id": "KqAfLBIQjg0N9D3tDJaUZQ", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 5, "funny": 0, "cool": 0, "text": "Caffe 501 is a great place to get a great coffee. Great atmosphere, the owner is really nice to talk to. Free WIFI is a plus. Prices are very fair. I personally think the coffee tastes better then Starbucks.\n\nThe menu has all the drinks you would find at any other coffee house. There are also fresh baked goodies.\n\nPlace is fairly small so if they are busy could be standing room only. Seating outside in the summer.\n\nAgain really great place here.", "date": "2010-01-14 02:15:32"}
{"review_id": "jbt0GCwb9Ifi60aJqzZ3bw", "user_id": "y4a_7xpbvRvCGwMNY4iRhQ", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Popped in a few days ago for my coffee. The same coffee I always get... medium cup with two shots of espresso. If Ashley makes it, it's $4.  If anyone else makes it it's $3.  The menu says it's $3.  I was kind of hoping that the price would be consistent after I brought it up.  \nStill a VERY good coffee shop and I will continue going!   :-)", "date": "2018-07-08 10:12:06"}
{"review_id": "RrRp8v6wZHQHktIvHIHY_g", "user_id": "_siU43gk5EdTnuYRMeqlFg", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Visiting Pittsburgh area during the winter is a big difference in weather, especially for this Southern California girl. We've been stuck inside the house for the majority of the time since we've been here so we decided to look up some local coffee shops to keep warm and enjoy some fresh air. \nSo glad we came to this spot! It's located in a nice, quiet neighborhood. Reminiscent of an older, less populated San Francisco because of the houses and hills. \nThe shop owner is a sweet lady. Right away she made us feel like we're locals and regulars at her shop - which we loved! \nWe ordered a couple of mocha lattes and vanilla chai latte, all topped with some\nfreshly made whipped cream. They were delicious! We even ordered a second round to go! :) \nI loved the shop for its coziness and friendliness of the people! Will come back again when we get a chance!", "date": "2015-02-20 20:35:08"}
{"review_id": "2HEcRUKBwmLUv3AnJemhRg", "user_id": "W40B1zLVNT8dnNZQt90mpw", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 4.0, "useful": 3, "funny": 0, "cool": 2, "text": "I stopped here to try out the coffee, I love to support local businesses.  The lady was very friendly when I entered she said \"everything that they have at Starbucks we can do here\".  I ordered a iced caramel latte 16 oz, they only have 16oz and 20oz sizes and their prices are really reasonable compared to other coffee shops.  I have to say I really enjoyed the latte and will be back.  They also have some pastries and muffins available.", "date": "2017-10-07 22:58:43"}
{"review_id": "ZluAs82vMhX7n9MyzYdKHw", "user_id": "LIHlbBXL5LsOyNpQVAU3lg", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great coffee shop! Great baked goodies...the macaroons and cheese danishes are my favs.", "date": "2014-09-15 15:50:02"}
{"review_id": "Q7ZkzApvFT49SDSBTu4cdw", "user_id": "YPJzL6t9st4TrM5VBzct_A", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 1.0, "useful": 1, "funny": 0, "cool": 1, "text": "The hours are inaccurate. Every time we make an attempt to go here, they've closed upwards of thirty minutes before the hours on the door claim. incredibly frustrating when you try to support a local business only to find the door locked prematurely on a consistent basis.\nWill update review if I can get a chance to try the coffee.", "date": "2017-07-13 17:16:58"}
{"review_id": "TjjbzMtWDaFX1pfVtgDxhg", "user_id": "bKSX_A8VsX83z_CTm9Kw2g", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Get the Italian soda! It's amazing.", "date": "2013-06-29 02:51:58"}
{"review_id": "tK1yY3jImLmdKhMPRU6OfA", "user_id": "LIHlbBXL5LsOyNpQVAU3lg", "business_id": "zBeUDwWx73QTZ34A1l0adQ", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good variety of traditional pizza styles and prompt delivery. They also reward repeat customers.", "date": "2014-09-15 17:17:43"}
{"review_id": "KISOotvaJqBVz_Am5CrXCg", "user_id": "y4a_7xpbvRvCGwMNY4iRhQ", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "This café has changed hands (May 2018).  My coffee used to be $3, now the same coffee is $4.  Maybe I was overcharged by accident, but either way it's not a good thing. I would never argue with the barista when there are so few good coffee shops in town.  The coffee is still great!  The hours have been expanded, and I like that they have donuts on Sunday, although they said they are only trying out the donuts. The donuts from Max's.  I came down one star because the price of my coffee went up so much.", "date": "2018-06-07 09:36:54"}
{"review_id": "CuqI7g101U_Q-xSffL7H9A", "user_id": "dSjTzuf6OJ8fgmiJo77aYA", "business_id": "zBeUDwWx73QTZ34A1l0adQ", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "In our search for good pizza we decided to try Vocelli despite having only 1 good review.  Sadly the staff left us never going back.  We ordered a medium Hawaiian pizza.  When we got it home it was a tiny plain cheese pizza.  We called to let them know.  John the manager was immediately angry and argumentative.  He seemed more than happy to not have us as customers. Don't bother, why patronize a place that treats their customers with such distain on their first order.", "date": "2017-11-27 00:41:46"}
{"review_id": "enyjA72q_wdgQDGokgCZlA", "user_id": "bZs2QPiAPZIaerbiZPIk3A", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great coffee (not something I say lightly!) and the owners are very friendly.  They're also really committed to renewal and to Ambridge, which is more than just a bonus.", "date": "2014-09-30 20:48:22"}
{"review_id": "4fcuTM1RFY6_ri3WuGtqTQ", "user_id": "hh0w9sQmZ1EtuwdZBNba2w", "business_id": "EOmRHPvzR88a5R2j2uD0cQ", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "Great coffee shop, has excellant traditional Espresso. A bit small place has pastries and Wi-Fi", "date": "2015-02-15 05:34:35"}
{"review_id": "xqgDX4eScZjdOj3CDsH_LA", "user_id": "ElokJiN5ezB8AFqbXBbyBA", "business_id": "lawYwEXAE-Sq2nf6co7aBg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "Bartender hanna very pleasant to deal with. Great prices. Taco are good. Will definitely come back. Husband is handicapped. People immediately jumped up to open door and several people offered their seats to us", "date": "2015-11-20 02:53:46"}
{"review_id": "FiFU9bR-zmrvM5H7QYSxkw", "user_id": "5huTtbwb9dCJMDnEzDaO6g", "business_id": "lawYwEXAE-Sq2nf6co7aBg", "stars": 4.0, "useful": 2, "funny": 0, "cool": 1, "text": "This review factors in that the bar was \"temporarily smoke free\" for some reason. Although I was super curious as to why, I didn't bother to ask the bartender. It's not that she didn't seem friendly, she was very friendly and seemed efficient at her job... I tend to get on a roll of weird questions. The temporary nonsmoking status question would have gotten that ball rolling. She seemed too busy for my nonsense. Anyways onwards to the review.\n\nFrom the exterior it's not exactly inviting, with its rough looking brick and painted wood panels covering what once may have been glass storefront windows. The bar fills the space of the two \"storefronts\" and is evident from the space inside. \n\nOn the left is the main entrance and straight inside you see the ten seat bar. Immediately to your right is a few high top tables. In the far right corner there sits one pool table. Deeper around the corner sits small but working woman's and men's bathroom. It had a nice soap and paper towel dispenser. That may not mean much to some, but it means a lot to me.\n\nIn between the pool table and the high tops, you can take a few steps down to the other side of the bar. Down there you'll find more tables on your left and another pool table on your right.\n\nDrinks were cheap, tots were crispy, burger was juicy, service was good... I will return. \n\nHopefully it will be nonsmoking, otherwise I might leave quickly and update my review!", "date": "2016-08-26 01:24:23"}
{"review_id": "xsH8D6FMwT6t4kPiZ9Zcwg", "user_id": "gFTkbV6MXMxoRqxngNLlhg", "business_id": "LHd0Y_0tIWWPvRqDb2b74Q", "stars": 1.0, "useful": 2, "funny": 0, "cool": 1, "text": "This place, the entire atmosphere, and ESPECIALLY the bartender were all awful. Literally, the bartender, (who's name was \"boe\") immediately began belittling me, harassed my friends---I CANNOT stress enough that I was not drunk during this encounter---and called us all heroine addicts. Then shortly thereafter \"prank called\" me, claiming to be the police, all simply because I didn't tip him---again I will not stress enough, im a bartender, and I never under tip without reason---and threatened to come to another bar where we were. Seriously, this place as well as it's employees are assholes. I mean it. Don't go here. If anyone is stupid enough to hire such a useless piece of shit as a bartender, as a representation of their business, then they don't deserve any business. Go across the street to the Bridgetown Taphouse, you'll thank me.", "date": "2015-03-25 05:57:42"}
{"review_id": "zmI1dqgVtuIjAzDH60pTig", "user_id": "_uDLGfuGVSoLMUDJB030OA", "business_id": "lawYwEXAE-Sq2nf6co7aBg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Knowing the people who frequent this bar and being familiar with the bartender I would never set foot inside, but I broke down one Friday night and looked up their menu.  The one I found on Facebook could have had better descriptions of what they did list, and apparently though they have \"60+ wing flavors\" I couldn't find a single one.  ???  So I picked a safe flavor that I thought they might have and made the call around 7:00pm only to be told that the kitchen had been closed for over an hour.  What kind of bar that has wing NIGHTS would close their kitchen during prime hours??!  Ridiculous, irritating, and not worth trying back another time.  Good luck, Hark's!  You sure know how to run a business.", "date": "2016-06-03 23:37:04"}
{"review_id": "wfyKoXRsPUaOPs1qU1CreQ", "user_id": "eTx-UjTrrc5TdnEzi0uZvQ", "business_id": "TsusMt8MhyWaQOVL-MLnjA", "stars": 1.0, "useful": 4, "funny": 0, "cool": 0, "text": "I have dealt with Mikush for years, and have always been happy with my experiences until yesterday.  My Maytag dishwasher, a Mikush appliance purchased a while ago, was leaking water during the cycles.  When Brian M came out to check it, he said it needed a new spray arm.  He returned yesterday to replace the spray arm, and somehow in the process, the computerboard that governed the appliance's operation stopped working.  In effect, I now have a dishwasher that doesn't leak, but also doesn't work.  I had to go buy a new one for close to $600 dollars.\n\nWhen he was done with his repair, he charged me $81 for the service charge.  That's right, $81 for a \"repair\" that resulted in the machine not working.\n\nI could have broken my dishwasher by myself for less than that.\n\nWhen I contacted him about the service charge, he said that's the way it was.  A service visit to Hopewell Twp was $65 plus labor.  He also said he hadn't touched the computerboard, so it wasn't his fault.  When I said that the machine had worked before he touched it, he said that's the way it was.\n\nIf you are in the upper Beaver Valley, you might want to be careful about whom you call to work on your appliances.  Or just break them yourself and save yourself a \"service\" call.", "date": "2015-12-09 14:04:49"}
{"review_id": "PhKtmVDmrDDagI_V92bCEQ", "user_id": "E7NGj3OE7JXcm9HjA40iew", "business_id": "lawYwEXAE-Sq2nf6co7aBg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great, friendly ambience. This is my hometown bar. The new owner really turned the place around. Two pool tables, darts, jukebox, good food, cheap drinks. The perfect dive bar!", "date": "2013-04-20 00:44:51"}
{"review_id": "MWagIb1mqD80k1_G8GDZ2g", "user_id": "1gJw6DxTrf0Zmp9gDgYlrQ", "business_id": "LHd0Y_0tIWWPvRqDb2b74Q", "stars": 1.0, "useful": 0, "funny": 0, "cool": 1, "text": "This place is a joke I can't believe they're still open the bartender's how to fight the guy next to me I guess you got to be a regular to be welcome there don't recommend this place to anybody", "date": "2017-11-03 07:14:19"}
{"review_id": "JlFJD0PRC8wH_80rRrx2ow", "user_id": "1gJw6DxTrf0Zmp9gDgYlrQ", "business_id": "lawYwEXAE-Sq2nf6co7aBg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ate at harks the other night the wings were very good well cook good flavor really good environment I would definitely recommend anyone to go there and get the wings definitely will be visiting this place again", "date": "2017-11-03 07:01:15"}
{"review_id": "313emG8IV0FqxI2Jq7Q6lw", "user_id": "plmzITot0Wrsiv99TsPK7w", "business_id": "LHd0Y_0tIWWPvRqDb2b74Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place \nNice , good music, and cool inside. Cold fricking beer \nMOLSON all day with a cold glass . The guy at the door is legit Parker , bartender rody on point happy mofo ..... that's all I can say \nCheck it out for yourselves....\nCheers.", "date": "2018-06-03 03:54:53"}
{"review_id": "xzF1AmWBlrofk0D1-YA8-Q", "user_id": "6Ey9XKKpqk2s-RcBrCgEdQ", "business_id": "lawYwEXAE-Sq2nf6co7aBg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome, local dive bar.  Always amazed by how friendly everyone is - only bar I will go to alone.  Great food, especially the tacos on Thursday.", "date": "2013-05-23 22:49:44"}
{"review_id": "EJ1stDUHo-e3BANe60z6zg", "user_id": "n9Z7P_IectY4qJUNBr2ZRg", "business_id": "TsusMt8MhyWaQOVL-MLnjA", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I stopped in, thinking they had appliances for sale. They didn't, but Bob was a wealth of knowledge about buying a washer and dryer. He talked to me for about 15 minutes, offering his advice and giving me great ideas. When there, I learned they rewire lamps, so I brought in two old lamps to get rewired. Super easy, affordable and they were done in a short (and reasonable) time. Again, got some good advice about appliance shopping. I'd recommend to anyone.", "date": "2018-10-25 01:55:14"}
{"review_id": "zCJeO7YqeqDiJpljglKrSw", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "TsusMt8MhyWaQOVL-MLnjA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "This is a family-owned business that has been in Ambridge for generations. They pride themselves on their quality service, and I can personally attest that they follow through on that promise. They take care to offer the best prices and always greet you with a smile. I love the loyalty and dedication that runs deep in this local business.", "date": "2017-07-14 14:24:31"}
{"review_id": "PoEO-8gXy78zWty9newZcg", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "yyGzYDh0Qa2o8vUGMEjDRA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was the first antique store that I had the chance to visit in Ambridge. I was blown away by the sheer volume of antiques and collectibles that Rivertown has! The store is deceivingly spacious, which is a plus because you don't feel claustrophobic while shopping. Also, the owners were great and happy to answer any questions that I had but were careful not to hover while I looked around. I absolutely recommend Rivertown to antique lovers.", "date": "2017-06-07 12:50:16"}
{"review_id": "PdN9LzbZJvNZ_TRIFLazVw", "user_id": "IvLSbW_4Cu2ngDcw2Aau3w", "business_id": "yyGzYDh0Qa2o8vUGMEjDRA", "stars": 1.0, "useful": 2, "funny": 4, "cool": 0, "text": "So disappointing. We were on a buying trip with money to spend and a truck and trailer. Saw several pieces of mid century furniture that we were interested in buying. The first was a set of stacked cabinets that had no price. When I asked for the price I was told it wasn't for sale because he was using it for display. Okay that's not totally unreasonable except it only had two open shelves and the rest were closed cabinets so it wasn't displaying much. When I turned to the cabinet beside it that did have a price I was told that the way it works if you want to buy any of the larger pieces of furniture is that you can't take it with you on the same day you buy it but rather he will call you when he has time to move all the little things that are be displayed on it and finds somewhere else to put them. What?!?  He wasn't phased when I tried to explain to him that I was just traveling through and would be two states away by then. I did find a two piece credenza hutch that was priced and since it only had a couple of things on it I thought for sure I could talk him into selling it to me and taking it with me but he was convinced that the top hutch did not go with the bottom credenza and it did not belong to him. When I suggested that he call the seller he said he doesn't call sellers on Sunday. WTF? He said he would email the seller. Grrr. I left buying only a couple of books but could have easily dropped over a grand. I said I would be in town for an hour or two because I had an appointment to pick up some furniture so if he happened to hear back he could call me. He called me back several hours later saying that I was right, the price was for both pieces DUH. Unfortunately I was already a state away by then. I have no idea what the hell this guy is thinking. More than 90% of the storefronts on this street are closed and boarded up. Have no idea how this place is still in business when they are turning away customers. Mostly I am writing this review to inform all the poor sellers that he is renting booths to that he flat out refuses to sell your stuff.", "date": "2014-08-26 04:12:04"}
{"review_id": "0-3RFQyFj9Jpl9b2GZj-yA", "user_id": "z7cR4xXpRrTV55LHDM9SBg", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 5.0, "useful": 4, "funny": 1, "cool": 2, "text": "I came here on a Wednesday for lunch. I ordered fried zucchini and a grilled chicken salad. First word that comes to mind is, \"WOW!\" The food was so good!\nFried zucchini was so good and so hot, you can tell they were freshly made.\n\nThe chicken salad was huge too! Unfortunately, I'm on a low carb diet and didn't realize it came with French fries, so I picked them all out. \nSo for the non-locals....salads come with French fries out here ;)\n\nOverall, the staff was friendly and attentive. I will definitely return again if I'm in the area.", "date": "2018-05-09 19:54:35"}
{"review_id": "gB93X7MPfASbBv_3EwVA_w", "user_id": "Y8AacNK1oloBnkTQ3CLlEA", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Tic Toc  deli has amazing sandwiches. I recommend the H H Robertson hot Italian. Prices are good. Will definitely recommend to friends.", "date": "2017-10-04 22:47:36"}
{"review_id": "HFdyD_DPyIaLtwL-1gSLYg", "user_id": "iLDAIBOVTCyX64Kyid5UXg", "business_id": "yyGzYDh0Qa2o8vUGMEjDRA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "The prices are lower than Pittsburgh and they have a large selection and new items all the time. I have bought 2 french provencial chest of draws which i spray painted black for the living room which they delivered for free. About $150 each and small art deco/noveau tabe for $25 and on sale 2 1950's metal chairs for $10 each (G8 deal) They have everything mid century mod, depress glass, tools, paintings, knick knacks chairs, small tables, etc.... HOURS I BELIEVE ARE TUE - SAT 11-5 ************BUT CALL BECAUSE THEY ARE OPEN FRI/SAT NIGHTS SOMETIMES BECAUSE THERE IS A NEW BUSY CHINESE RESTARAUNT NEXT DOOR AND THEY GET ALOT OF FOOT TRAFFIC AT NIGHT NOW PPL WAITING FOR THEIR FOOD ORDER COME OVER AND LOOK AROUND--------------WORTH THE DRIVE FROM PITTSBURGH AND dont forget only 10 min away in BEAVER FALLS IS A HUGE BUILDING ANTIQUE EMPORIUM on the main drag thru town prices are higher but its huge and has medieval knight stuff cool....", "date": "2015-01-06 19:17:06"}
{"review_id": "NHQGPLcQdibzsfhqCX-zUg", "user_id": "9p_vj2TD8G4kYsHT48z05g", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "The Tick Tock has a long history in Ambridge, ranging back to the '50s. I was never interested until it came under new ownership a few years ago. They cleaned it up, revamped a lot of the menu, and added on a variety of brews.\n\nI stopped in for a work lunch, so I didn't get to sample the beer. The food was good, though. They have a fairly small menu that focuses mainly on standard bar food for this area: big sandwiches and sides. My pulled pork sandwich had a tasty (if dry) bun, but the meat was really good. The big winner, though, were the fries. The were on the huge side of things, and were seasoned just the right way. \n\nPrices were really good, and the staff was super friendly. The place is divided in three sections, too: a deli/kitchen area with limited seating, a larger, open air section with a pool table, and the bar. The subdivision is actually really cool. Smoking is permitted here, for those who care, and I appreciate that it's possible to avoid it entirely thanks to the three sections.", "date": "2017-05-16 18:40:05"}
{"review_id": "_gfJpUUBiS0eKJbeNHADww", "user_id": "B-60XQ_fR72PevFzHM-ieQ", "business_id": "yyGzYDh0Qa2o8vUGMEjDRA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Quite possibly the best antique store I have been to in the greater Pittsburgh area. There are bigger store and there's stores with rarer inventories, but Rivertown has the perfect balance of high quality, large inventory, and diverse range of time periods/styles. The staff here is friendly and were genuinely interested in sharing about their store and others in the area. Price range varies from $ to $$$$ and everything I looked at seemed fairly priced.  You can find a crazy deal here and there, but for the most part this place isn't filled with cheap stuff like some other venues.  So overall I'd say you come out ahead if you buy things here versus other shops.  Definitely will be coming back regularly as inventories turn over and new stuff comes in!", "date": "2018-06-23 14:52:36"}
{"review_id": "y_tWD7lcaI9r_sya7mFgRg", "user_id": "vCMLDTmNQJTshp0buV1JaA", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 4.0, "useful": 6, "funny": 0, "cool": 1, "text": "We purchased takeout subs for dinner. An Italian and some sort of sausage meatball sub. Not bad, i would order again. I've never gone in so I can not say much for the environment but there seems to always be a crowd here.", "date": "2017-09-27 00:05:00"}
{"review_id": "Y4g3gPHilfWvVv5Iz-fPjQ", "user_id": "ABOuNch7iuYBOjjFsxpM1A", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very limited menu but what they offer is very good. Decent prices and interior is nice.", "date": "2017-10-08 17:48:34"}
{"review_id": "V5oVbj3IBqvYYYH4gtbVPg", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great. While I cannot speak to the bar side of the business, Tick Tock's cafe portion was a good place to grab a quick bite to eat over my lunch break. As a hoagie lover, I was impressed with their Italian hoagie, which paired well with the wedding soup. All of the employees were very welcoming and easy to talk to. The cafe had a great vibe. I will definitely be stopping back.", "date": "2017-06-06 12:34:13"}
{"review_id": "SuSn6WR3wng9mkG4eAF2Bw", "user_id": "3xBFFH866WoySDG7uuwBSQ", "business_id": "c_3u2TfMWtt8OlRFYtVo_Q", "stars": 5.0, "useful": 1, "funny": 1, "cool": 1, "text": "Ok I'll give it 5 Stars because there are lots of antiques and collectibles stuffed everywhere and they will negotiate. Lots n lots of antiques only a path through the middle but I bet there are some great deals in there. I like the old antique musty smell.", "date": "2018-07-25 13:47:31"}
{"review_id": "eXE7kvdfsdCuSV3IdgrOmA", "user_id": "1gJw6DxTrf0Zmp9gDgYlrQ", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I didn't like this place at all I don't know how they call them self a cafe it's a bar with a deli next to it not a very good atmosphere wish I would have went somewhere else", "date": "2017-11-03 07:11:57"}
{"review_id": "INiT0g5PBMqc7bt8tXfd7g", "user_id": "ub62tDwXuUiS6cDiWPHCNw", "business_id": "c_3u2TfMWtt8OlRFYtVo_Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "TONS of old tools and hardware store items. Tons.\n\nEccentric store with quite the collection of useful and interesting items. Would take me years to look at each item individually.", "date": "2016-12-18 00:12:34"}
{"review_id": "ISM5KkX-sfjgAXiM1y2rPg", "user_id": "m2uTGkOKcXqQJSmvsYvtMg", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Bad from the start.\n*Party of 2 & we get 1 menu.\n*Bartender doesn't know the soup special & its already 2:30 pm.  She then informs us that the food actually comes from the deli section and that the deli is a separate business.  So she walks over to the deli which basically is 2 sections over (deli, pool table area, bar). Comes back and says there is no special.  And we can order food from her and she will take the order over there and she will take our cash or credit card over there also to pay.  You pay her for only the drinks.  \n*We order 2 wedding soups - not bad tasting but served luke warm.  \n*We order meatball hoagie & hot sausage hoagie - served barely luke warm.  Hot sausage appeared like it had been reheated for several days.  We hardly ate half of the hoagies\n*Place is asking for a case of food poisoning. Stay far away from the food!\n*ONLY good thing was the building was nicely renovated with doors that slide open & can be kept open.", "date": "2017-08-23 23:39:12"}
{"review_id": "QI2w6MsirvNkYKkz7twX1Q", "user_id": "30GDaPiQ5QlPHq2o_6sebw", "business_id": "c_3u2TfMWtt8OlRFYtVo_Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best antique store I've ever been to.  Remarkable amount of items.  You'll spend hours here.  You will definitely buy something the prices and selection is great.  Owner is a very nice old man.", "date": "2017-05-07 11:31:54"}
{"review_id": "xK517fM2FKnHod2cCreqbw", "user_id": "TkgLh2vMnfJ2dAW9-YRI5A", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I order here about once or twice a month.  Prices are impossible to beat and food is really good.  I also love supporting local as we live in Baden it's great location.  Now the negatives.  They tell you 20 minutes it's more like 40 for pick up.  That's ok it's smallish place and not a lot of staff.  But they are quickly becoming a place that can't get an order correct.  Always double checking my order.  For example no ranch.  Almost always has ranch.  These 2 simple fixes get another star or maybe even 2 star boost.", "date": "2018-10-10 21:43:47"}
{"review_id": "fPPFWT5ec5pfkDRfO3wvNA", "user_id": "YrGKgmYYtk5V-6439ggBJw", "business_id": "yyGzYDh0Qa2o8vUGMEjDRA", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I l-o-v-e antiquing and if you do, too, then this place is a 'must visit' on your next antiquing adventure in the Beaver County area.  We found some really unique pieces for our home that we've not  seen anywhere else.  Some of our most favorite antique furnishings have come from here. The owners are super helpful and always bringing in new stuff. The store is arranged in an easy to get around way and it's always a pleasure doing business here.", "date": "2013-06-17 00:23:08"}
{"review_id": "JPjQxVslqnZk_lYCVPq-Pg", "user_id": "s-763p9_uqI8vr_0O_ToFQ", "business_id": "KQrgpqBmIsBbdAn6CnfgCA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We've had take out from here a few times. French fries are amazing. Loved the steak hoagie. Every time we've gone to pick up the people working are really friendly. The prices are reasonable as well.", "date": "2018-08-29 01:43:28"}
{"review_id": "EqQJRFv51l4N1hjgAIJ5fg", "user_id": "y4a_7xpbvRvCGwMNY4iRhQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The Maple!!  Love this place. Are usually get breakfast, and the serving of bacon is huge. Thick sliced five pieces. They always make my breakfast perfect... Sunny side up eggs etc. Breakfast is not all day.\nI've had the turkey mashed potatoes stuffing dinner, too. It was awesome. I had coleslaw on the side, it was fresh and cold.\nThe service is fantastic. Customers are nice, the place medium quiet, But there is a radio playing in the restaurant. Lots of free parking right across the street.  \nI'm a local in the area, and whenever I want to eat out, this is the first place I think of. Never disappointed!", "date": "2018-07-07 20:59:22"}
{"review_id": "3VUzEN8FHyf2RwK0qZpkWQ", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The Gyros are great. For $7 you really get a full meal. Trying the Stuffed Cabbage tonight so will update. Also the stuffed grape leaves are great. There is another place in Ambridge that also sells Gyros but skip that place and go here. Girl behind the counter that cooks is also really nice.", "date": "2016-08-25 18:53:43"}
{"review_id": "920pP1BQBcD8qUtq4K57tg", "user_id": "Q6S6gYh62JrDhl6t7zjWLA", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome smells upon entry!  Pizza was tasty!! \n\nMust try!!!\n\nThe best pizza in the area!", "date": "2018-07-17 16:40:43"}
{"review_id": "7mxIuWa-8bQby3MsDXfgGg", "user_id": "hjYr1oOx5PqRe-Pryu7DzQ", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Good bar food. The waffle fries are good. I had fish, wife had a bacon cheeseburger. We were satisfied. Baseball and other sports enthusiasts will enjoy looking at the walls.", "date": "2010-11-23 22:08:52"}
{"review_id": "KbZm8SBzYAwm5onuEXtYBQ", "user_id": "A0Tkq4VV8dD6t8NbBxvBPA", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 5, "funny": 0, "cool": 1, "text": "We drove 40 minutes to Frank's on the recommendation of a friend. Good pizza is scarce in Pittsburgh and great pizza is nearly impossible to find...until now!\n\nFrank's pizza is old school - hand made crust and homemade sauce. Let's start with the crust. The crust is amazing. It reminds me of good Italian bread  - crusty and crunchy on the outside, but tender and chewy on the inside. The crust is then topped with mozzarella cheese and then with sauce. The sauce is smooth, slightly sweet, and not overly seasoned. Once baked, the pizza is topped with a sprinkle of oregano and parmesan cheese. If you order toppings, this is also when they go on. The pepperoni is cut thick and is full of flavor and a little zesty. \n\nI think this has become my favorite pizza - if only it weren't so far away!", "date": "2010-10-09 00:25:35"}
{"review_id": "K5lknIP5nfGOhij5f28hLw", "user_id": "hW22848-3gtxV1_g4ozIKw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "It tastes like frozen pizza! Sweet sauce and little cheese.", "date": "2016-05-20 16:22:56"}
{"review_id": "n6S8cQ0yWZ1DkCvGZARXZA", "user_id": "i4O5RgoJ0IeycZ1N8MZGkg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I feel compelled to write this review for all of the simpletons who don't realize they are visiting a DINER and who believe that they should be offered mescaline greens and free range chicken here.  Spoiler Alert - they are not on the menu.  What is on the menu is great DINER food.  Hot roast beef, homemade pies, fresh cole slaw. outstanding rice pudding.  Not for folks with special diets or who have medical restrictions.  As an added bonus, a friend, who has been in the restaurant business for many years, worked there a few years back.  She said it is the cleanest kitchen she has ever seen in a restaurant!.  For the folks who are driven to critique ever aspect of every business that they visit - you should really temper your comments to the type of establishment you are visiting.", "date": "2015-05-10 21:22:06"}
{"review_id": "AtnF3SrPfGefqfqNjxrJMw", "user_id": "X9BlWb6A3EPOMc_ANdJlhA", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 1.0, "useful": 0, "funny": 1, "cool": 0, "text": "If you're looking for great wings - no more Rooks - try the Bridgetown Taphouse which is now open just down the road.  Better than Rooks ever was by far.  MMMMM", "date": "2016-09-08 22:22:41"}
{"review_id": "4NJdiX1_6WkoWJrbhHPwVw", "user_id": "KcnrnXjGE0Cf04vlqPi2cw", "business_id": "GI1WxFbY9tJ9-ChRrwnrzg", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Great place to stop in for home cooking including stuffed peppers. The pizza is delicious along with their Pierogies. \n\nIt's nice to have a place to go for great food in Ambridge. They also cater, have a banquet room, and have take out.", "date": "2012-04-29 19:43:16"}
{"review_id": "aeK8CTEPn-8tcm7zccnYSw", "user_id": "m2uTGkOKcXqQJSmvsYvtMg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We both got the signature hot roast beef sandwich.  Very good!  Rice pudding for dessert.  Truthfully we only needed one to share but the server said they were small.  Yes, they're served in a tiny glass bowl but it is stacked very high.  One order would have been enough.  \nNeed to update the interior.", "date": "2017-02-09 22:43:34"}
{"review_id": "xdjTinXnKoFsEbLjwuPpTA", "user_id": "OQ027dJ_YZOv_Nh_ImE3Ug", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Without a doubt, the best pizza I have ever eaten was from this humble little hole in the wall in Ambridge, PA. Although the town has little left to offer in and of itself, this pizza place (along with Pizza House off Merchant St) really makes the trek worth it in my opinion. I used to go here time after time again since my grade school years.\n\nFor anyone interested in giving Frank's Pizzeria a shot, you'll want to be sure to call your order in ahead of time if you want to shorten your time waiting in line for a delicious pizza. The menu is simple enough, with only one size of pizza and no additional gimmicky add-on ingredients. I always go for the plain pizza myself, but the pepperoni is also a smash hit. The calzone and the iconic heart shaped pizza (for the love of your life of course) are also excellent choices.\n\nReally sucks that I live in California these days. I just can't find any good pizza out here and have been sufficiently spoiled by Frank's Pizzeria. Fortunately, I do hear that they can pack their pizzas uncooked for shipping. I might have to have my family send one my way.", "date": "2014-06-12 20:38:26"}
{"review_id": "LX-w4kaVwD5Lo4NcnQDdUw", "user_id": "6f7fUtDGIq8NptJVh3tOYw", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Well, what you see is what you get.  It is a very classic, small town, Western Pa restaurant.  Simple decor, simple tables, and a simple menu.   They are known for their hot roast beef sandwiches and their other simple fares like pork chops, roast chicken and turkey and gravy.  This isn't a place that most people will be walking away from and texting their friends on how great of a meal it was.  However, that doesn't mean it isn't satisfying. This isn't a meal that would be typical for me or a place I would usually visit.  However, if you are looking for a good home cooked meal with attention to \"how mom used to make it\".  You would be hard-pressed to find a better place than Maple.  I had the roast beef sandwich with the home fries and was pleasantly surprised.  The beef was tender, the gravy wasn't overly salty and the home fries were crispy.  It was a filling and tasty meal that will not leave you breathless but almost certainly satisfied.", "date": "2018-07-09 00:55:43"}
{"review_id": "S86-MbIiSm6EfG4R7iaGZA", "user_id": "9p_vj2TD8G4kYsHT48z05g", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love the history here. I love the fact that the Ambridge community celebrates this place. And I love how it's been family-owned for decades. I just wish I liked the food more than I do. \n\nMany of the dishes are legitimately tasty (for sandwiches, I always go for the Rachel or Reuben, which are usually really good). But so many dishes are humongous servings of so-so food: giant blobs of overcooked meat, buckets of salt (er, I mean gravy), towers of mushy french fries. I stopped getting their salads when I realized they were an iceberg lettuce delivery system for 15 pounds of french fries and an ocean of dressing. If you like this kind of thing, great! You will LOVE this restaurant. If you don't love this kind of thing (like me), there are plenty of other places nearby that you'll probably like better.\n\n(And yes, I am a local, and yes, I've eaten here much, much more than once.)", "date": "2017-05-16 19:10:31"}
{"review_id": "HmJcYtFZvknDZUc2ziVZcQ", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 5, "funny": 3, "cool": 2, "text": "Just a quick update. Maple is still great but I have noticed this past year each time I order the amount of Roast Beef seems to decrease ever so slightly. Food is still great but I removed one star since prices stayed the same but the portion size seemed to decrease slightly.\n\nStill stop by if you get the chance.", "date": "2010-01-14 02:07:32"}
{"review_id": "-YaP5MYIQcRV6svSZdHKOw", "user_id": "NeDWz-xwPYmUwgcIeYkTfw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "Frank's Pizza is the BEST PIZZA on the Continent !!   I've been all over America, and the crust, cheese and sauce combination here can't be beat !!!   Everything is hand made and tossed up in the air LIVE  !!!!!!     What comes down is a taste that is out of this world !!     This family pizza joint has tons of experience making and fine tuning the incredible TASTE of their PIZZA !!   Enjoy !!!", "date": "2012-10-11 20:21:16"}
{"review_id": "hnzLNlibY2xfnN1dOntIDg", "user_id": "G21a62oHOW-8sPS_tIuZSw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "YALL NEED TO TRY THIS PIZZA. \n\nIt's seriously out of this world. \n\nThe sauce is sweet and rich (also on top with the cheese underneath) and by far one of the best sauces in my opinion around this area. It's one size pizza for about 9-10 bucks. I haven't tried anything else on the menu but the pizza is please go try.", "date": "2018-01-10 22:45:38"}
{"review_id": "VNBiO2pdHUKtWzQo4B7ufg", "user_id": "CjxTTAuty_5FASUFarKniQ", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I agree!!! BEST Pizza ever!!! Love the white Pizza with olives!!!!.  Each Friday has become religiously my treat!!!!", "date": "2012-04-01 20:16:07"}
{"review_id": "Sp5satpTibnXsVYM8H4yyQ", "user_id": "W40B1zLVNT8dnNZQt90mpw", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "I love their gyros, gyro salads, and chicken salads.  I have been eating here since they were in Sewickley, PA they no longer have a sit down area so you have to order your food to go, but the food is still the same it's \"delicious\".  If you love Greek food they have it and if you have a picky kid(s) like me they have chicken fingers and various food items for them as well.  A lot of their dressings are from scratch including their Greek and Ranch Dressing.  They give you large portions one gyro salad is enough for two people.  I still believe they have the $3 gyros on Mondays which is a steal.", "date": "2017-05-28 00:43:21"}
{"review_id": "E0pQt7hV5xtLQbhW1kf__g", "user_id": "KBHwzZlGw0PV8Uhm7AKKuQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great little family restaurant. The menu contains standard diner fare and the prices are great and the food is delicious. Our server was wonderful and incredibly accommodating to my 2 year old. The decor is straight from the 70's and I loved it. I would've given 5 stars except there really aren't any healthy options on the menu.", "date": "2017-03-17 22:06:42"}
{"review_id": "g3LDJo64oGtS2EyILQoxiw", "user_id": "oU7UfK04JpJAkZgSDt1Lxw", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place never disappoints!  Everything I try is so delicious.  Market Square on Thursday lunch time is a treat for me, just be prepared for a line unless you get there extra early.  Portions are huge!!  Great food though.", "date": "2018-07-19 16:24:36"}
{"review_id": "p-6eM3Ai3k3S64nyhyC1Kg", "user_id": "QTGgsOFixFuRu2WZD1uKsg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 3, "funny": 2, "cool": 1, "text": "The food is the same tried & true recipes they've been using since they opened in the 60s but its good. They do not deviate from what has worked for decades. Yes the place is very very outdated. There's a few waitresses that make you feel like its an inconvenience to attend to your requests, but most of them are very experienced and knowledgeable and have been working there for many many years. If you want a good meal at a decent price in the Ambridge area, than this is the place to go. Note, if you come on a Friday around 5ish, plan on waiting because the place gets really busy people coming for their Fish.", "date": "2015-12-27 20:22:56"}
{"review_id": "0mlmM__pfNeJXFc7nEB1-w", "user_id": "pSdNRbuinKON0LnZdHWTNQ", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Omgoodness such a great family and wonderful take out and catering. Certainly recommend the grilled chicken, homemade hummus, Greek Lemon Chicken soup. Can't go wrong with any of their menu items.", "date": "2018-02-13 16:23:13"}
{"review_id": "g2TkxdhTaqUjxtDt-aIlnA", "user_id": "d0D7L-vfQDIADolnPAcb9A", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 4.0, "useful": 3, "funny": 1, "cool": 2, "text": "I got to experience Little Athens while they were in Mellon Square on Friday during lunch. They had a ton of options to choose from: moussaka, stuffed grapes leaves, stuffed pork chops, stuffed peppers, Lady locks, lemon cake, baklava ect. All food entrees were $8 or under. Desserts were even cheaper.\n\nI went with the moussaka which has potatoes, beef, egg plants then a white sauce on top. They also had a vegetarian version of it without the beef. It was $7 and the portion was huge. The staff was extremely friendly and the moussaka was fabulous. I was tempted to get a lady lock but decided against it.\n\nLittle Athens Catering will be in Pittsburgh all summer! Thursdays in Market Square for the farmers market and Fridays at Mellon Square. I don't know if its an all day thing, but I know that they are there for lunch hours. Im unsure if they take cards at farmers market. I ran to ATM to get cash because I assumed they didn't. Hey, who knows", "date": "2016-05-21 14:19:57"}
{"review_id": "SD5J_aa8HNcfAZGpjvH06g", "user_id": "X9BlWb6A3EPOMc_ANdJlhA", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Heads up: Rooks has burnt down.  I hear they are rebuilding but who knows when.  I will miss wing night for now.  :(", "date": "2014-08-14 22:29:47"}
{"review_id": "Y-bwW9U1jY4Fr-E0aRTh0Q", "user_id": "XhgPk7GZVSaRdsX7vgCBpg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 2.0, "useful": 6, "funny": 2, "cool": 1, "text": "Perhaps the Maple Restaurant has high reviews simply because it is the Best of What is Available in the area, I get that.  But it's not very good.  I didn't order the signature beef, I ordered another item on the menu, fried haddock.  Everything on the menu should be as good as the beef.  If it isn't, make it better or get it off the menu.  My fish was overcooked, my mashed potatoes were like paste and the gravy tasted like it came from McCormicks.  The cole slaw was tasty but all white and green, throw in some shredded carrots and it will be AOK.\nOne of the people at my table has Celiac's, gluten intolerant, the Chef worked well with her, that gave you an extra star.\nAnother at my table got the prestigious roast beef, it was fine but served between two slice of white bread and drenched in brown gravy.  Just looking at it made my cholesterol levels elevate.\n\"Oh, the 'mixed greens\" on the salads are a mixture of different colors of iceberg.  Not my lettuce of choice, ever.\nAgain, the locals flock here, I get that.  Drive a few more miles toward Pittsburgh and taste some good food, for the same price.", "date": "2012-08-21 00:15:37"}
{"review_id": "9BiFYrLa4k0daED4a4wlKw", "user_id": "kX51virpX2Fsanr_K18Luw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 2, "funny": 1, "cool": 0, "text": "Hands down the best pizza I've ever eaten! Every time I eat pizza at a new joint I compare it to Frank's. I've been going to Frank's since high school. I moved out of town almost 14 years ago, but make sure I stop and grab a pie when I'm in town. My mouth is watering as I type.", "date": "2011-10-04 12:18:50"}
{"review_id": "KX1ljbdUMqLfgRqwAf30MQ", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The Roast Beef is to die for. If you are ever near Maple Restaurant you need to stop down and get one!\n\nFast and nice service, have never eaten in, always get takeout so cant comment on wait staff.\n\nI have never heard anything bad. \n\nPrices are low and portions are huge.\n\nWhy are you still reading this? Go get a Roast Beef Sandwich now! Don't forgrt Extra Gravy.", "date": "2009-03-30 23:46:28"}
{"review_id": "YCGCJ-nHE3vO98Iyj9F74g", "user_id": "LvbVj7YtBYrza71ofqH1Fg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "You walk in and its like you are transported back to 1956! Its exactly what  you would expect- you will NOT get farm to table,  ingredients I can not pronounce or spell   or flashy service. What you  will get is old school cafertia food, served by  mostly older grandma type waitresses who  will chat you up, make sure your drinks are refiilled and you leave with a box.\n\n I would not eat  here all the time but its a great place for ( of course) roast beef with ( gasp*) white bread. The  interior  is all decked  out  with black and white  photos and awards they  won.\n\n Try it.; you won't regret it!", "date": "2013-02-28 14:39:27"}
{"review_id": "Y4krCSOk0TZNaSb5tgM1rg", "user_id": "v8Hi4Sfbg4dbfgsXYXYsYg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "I had high hopes for this place and their famous roast beast sandwich, but was sadly disappointed.\n\nHave you ever really hoped that you came on the wrong day?  That is how I felt...the first time.  The Maple has such a strong reputation that I thought I must have had really bad timing.\n\nTried twice since, once to get the real deal, and today because I was in the area.  Each time I tried their signature hot beef, each time disappointed.  It's not awful, but pedestrian,  and about equal to any run of the mill hot beef, though way more expensive. \n\nIf you want a hot beef that blows them away, go to the South Side, to a little dump of a place a couple of blocks south of Carson St. Sorry, but the name escapes me.", "date": "2015-02-05 00:51:08"}
{"review_id": "sOugMiOY6iE8A3d3rEGBfw", "user_id": "RLRYmD7XdbQPgXhlFI_Y7A", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "The Maple is not what it used to be. I know one thing: They never met a piece of meat that they didn't want to overcook. I cannot get a good hamburger there. It is always hard as a rock. I had chicken recently. It was so dry it was practically inedible. No one is teaching the staff how to cook meat. Its too bad really. The Maple was once an incredible place that did everything they did well.", "date": "2017-05-04 11:51:47"}
{"review_id": "8LydXxIBpSNKiJO1wS0new", "user_id": "G7DBYe-YzD3NvPPyJkpTGw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 6, "funny": 1, "cool": 4, "text": "Without a doubt the best tasting pizza I've ever eaten.  This is the only place I've ever been shut-out of because they'd already taken a night's full of orders by 7PM!  I could very well live off their pies.  I have lived all over the United States, and currently reside in Seattle, but Frank's has never been topped by anyone.  No, this is not my hometown pizza joint.  Heck, it wasn't even my local place in college.  I've always had to drive at least thirty minutes for Franks, and it has always been worth it.\n\nOnce, they were temporarily unable to procure their normal brand of pepperoni.  They were up-front about it, saying that they couldn't get it, but that they'd found another variety which was close.  They even told me that if I was completely dissatisfied, they'd make it right.  I told them I trusted them, and I wasn't disappointed.\n\nFrank's does one brilliant thing I've really never seen before at any pizza restaurant: Most toppings go on fresh after baking.  Pepperonis are nice and soft, and flavorful, without being browned, curled into a little grease cup, or crisped into a blackened charcoal-tasting nastiness.  It's just amazing.\n\nThe last time I went in, I noticed someone was missing.  I learned that Frank Aloe, the namesake of the best pizza place in the country, had passed away in May of 2010 at the age of 82.  I'm sure he's sorely missed by his family of pizza makers (three generations of them work nightly in the restaurant,) but I'll also miss him.  He crafted a masterpiece, and I consider myself lucky to have known him and his pizza.", "date": "2011-02-20 15:54:37"}
{"review_id": "ou5SFAaMltMd-Odubc-k4A", "user_id": "wUhgzbMAAOr88VVTiQUrvg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "There food is sooooooooooooooo good!!!!!!!!! I love there beef and home fries!!!!! Their sevice is good!!", "date": "2018-06-11 21:33:51"}
{"review_id": "uPRmsMrueKS3nfYZIpmJOA", "user_id": "742byd6uDwgr4eEeLjOVOg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "Any time I am visiting family, I always stop at Maple. While the location is a little sketchy, inside you will find friendly staff, and amazing, hearty food. While they are known for their Hot Roast Beef, my dish of choice is the Fried Haddock with Home Fries. The haddock is some of the best fish I have ever had, fresh and flaky, and perfectly moist. The home fries taste fresh cut, and are large circular cuts of fried potato. I have had some other menu items, like the chicken parm sandwich and mac and cheese, which were both great, but since I only make it to Maple two or three times a year at most, I've gotta get the Haddock when I am there. If you go on Friday though, you've gotta try the jumbo fried shrimp! An unlikely location for amazing seafood!", "date": "2011-12-14 01:49:06"}
{"review_id": "fmI6ijY5md97MVU7vcIuZg", "user_id": "QTGgsOFixFuRu2WZD1uKsg", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I consider myself a bit of a pizza expert. I try \"the best\" pizza everywhere I go, doing a lot of research online. Frank's pizza in Ambridge is better than pizza I've had in New York or San Fran, or anywhere! It's unique sweet sauce is what makes all the difference in my opinion. The crust is always perfect. And all the other ingredients are a fresh, good quality. I've had people request I bring them a Frank's pizza - even carrying an unbaked one as my carry on. There's no competition in my opinion to other pizza places.", "date": "2015-12-27 20:29:54"}
{"review_id": "-t4ViQIeOAi7Mb5h3lfihg", "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ", "business_id": "GI1WxFbY9tJ9-ChRrwnrzg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Absolutely delicious and homey! I believe it's a wife and  husband who own and run it. She is front of the house and makes the dessert and then the husband cooks in the back. The place is small and homey. Nothing fancy but that's not a bad thing. \n\nSmall bar with a limited selection but the food more than makes up for it! They had multiple specials and the wife was beyond friendly to let us know what was good. We had the hot sausage peppers which were spicy and delicious. They came with small warm rolls that they put in the toaster over but they are addicting. I ordered the gnocchi which is always a hard one but decent. Next time I will just get the spaghetti with hot sausage pepper. We were definitely stuffed by the end of the meal but we took dessert to go. \n\nTo end the night we had strawberry cheesecake and it was wonderful!", "date": "2012-12-15 19:23:42"}
{"review_id": "m_Utt4rfi_Hj9Coap_C9gw", "user_id": "iCNDIn83h47Y2fLkXew0Pw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "Yes, it's as good as everyone says. Yes, the sauce is on top. Yes, the pepperoni is amazing (it's the only topping I ever get).\n\nIt's hard to find a family as nice as the Aloe family. They have been an Ambridge institution for decades (for more than just pizza), and to have them serve up this amazing pizza that has been virtually unchanged through the years--well, you just don't get that in most places.\n\nCall ahead, especially on the weekends. People come from all over the area for a pie. Bring cash. Maybe get 2 pies, since I tend to eat half of it in the car on the way home.\n\nLiving in the city for the past 9 years or so, I can't find very many pizza places that can hold a candle to the two Ambridge pizza titans (Franks & Police Station). It's definitely a fortunate place to be if you've got a craving for pizza.\n\nAlso a very unfortunate place to be if you have that craving on a Sunday (WHICH HAPPENS TO ME ALL THE TIME!!!!!!!!!!!!!!!!)", "date": "2015-05-30 14:40:15"}
{"review_id": "6eUmO1KUUTm0qp2ufIkE-w", "user_id": "n316m2fGChF_HHwRyJwr-A", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 4.0, "useful": 4, "funny": 1, "cool": 0, "text": "Okay -- I am incredibly picky about red sauce / pizza sauce.  I never like anyone's sauce because most people just don't know what they are doing when they season it.  It either has too much spices or it tastes like plain tomato sauce.  Well - not at Franks!!!!!!!!!!!!  It was AMAZIIIIIIIIIIIING!!!!!!!  I have had a lot of different pizza places in the Pittsburgh area and I never really like them for one reason or another and don't ever go back.  I will be going back to Frank's Pizzeria....a LOT!!!  The outside of the place is so unassuming.  But you go inside and it is very tiny and there are a bunch of guys making pizza -- but they know what they are doing.  Its super cheap (Just under $11 for a 1 topping 14 inch pizza).  They do only accept cash - so be ready for that.  The pepperoni on the pizza was thick slices - which was really nice to see - it really added to the flavor of the pizza.  In my opinion ---- EVERYONE must try this place!!!!  I would have given 5 stars except it was alittle annoying they didn't accept debit card and there isn't much cheese on the pizza.  So......if you like cheese -- be sure one of your toppings is EXTRA CHEESE.  Other than that -- NO COMPLAINTS AT ALL!", "date": "2012-05-05 03:43:28"}
{"review_id": "wNDtxcdemDNSCfxw8ShVMg", "user_id": "_F2eBdZujryd-0usqBlPyQ", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 1.0, "useful": 2, "funny": 2, "cool": 1, "text": "this might be the worst pizza Ive ever had. the toppings clearly come from a can. yuck. the crust was decnt and thats the only nice thing I have to say. sorry folks, I cant understand why you like this place. the sauce isnt good, the toppings suck (except for the pepperoni), and the cheese? I think was mostly made of plastic. thanks, but no thanks. I guess I have to drive to the city for decent pie.", "date": "2013-04-18 23:46:05"}
{"review_id": "HcGJBSCqScpa278P8V2oNQ", "user_id": "vBXdvjjd_bD1-u4NUfR9lA", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Rook's is a good local hangout with the usual \"bar food\".  Service is always good.  I usually get a steak or chicken salad after some appetizers.  Steak is always cooked to order and chicken tender and juicy not like jerky that you get at other places. Hubby gets a burger which is just a frozen patty.  Chicken Tortilla soup is to die for.  Finding out that the soup is purchased in bulk and not homemade was a disappointment though.  The atmosphere is a bit dingy and could use some updating and a fresh coat of paint.", "date": "2012-07-23 14:23:15"}
{"review_id": "Du-BF5VNicRKr3Hjid6M2Q", "user_id": "iRLWfXrc0t-76Ic4tYgQMQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 2.0, "useful": 2, "funny": 0, "cool": 0, "text": "I really wanted to like this place, based on the reviews posted and the fact that it has been around for so long.  First time there and I ordered  the Wednesday spaghetti special with meatballs and salad.  The salad was a very generous size with a tomato slice, olives and onions.  Ordered sweet and sour dressing, which was somewhat of a disappointment.  It was a thick, cold, hard to pour goopy mess.  Not the usual consistency I'm used to.  \n\nThe biggest disappointment, however, was the spaghetti. Although the meats sauce was tasty, it would have been nice for the spaghetti to have been drained first. Too much water in the bowl underneath the spaghetti which diluted the sauce. The other problem with this dish were the meatballs.  Two large softball sized meatballs that really tasted nasty.  I don't know what they did with them, but after two attempted bites, I couldn't eat any more.  Don't know if they were old or what, but they were definitely not edible.  \n\nMight return to try the hot roast beef sandwich, which they are known for.  Maybe.", "date": "2017-01-20 04:20:40"}
{"review_id": "d0gbmfGV22Rx3v-o2yl7xQ", "user_id": "4ogUUPLYlxS7ylUsLXWvbQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "Like others have mentioned it's like going into a time warp, but in a nice way. Yes it's very dated but neat and tidy. I barely even looked at the menu because i knew I was getting that hot roast beef sandwich that I had heard so much about. It was everything that I dreamed it would be! a really good amount thin sliced beef on white bread with fries covered in tons of gravy...It was awesome. Others at our table had an alpine burger with Swiss and mushrooms, a Reuben burger with coleslaw, Swiss a and 1000 island dressing, and a ham sandwich with big thick sliced ham. one of the desserts on special was a baklava sundae. Omg are you kidding? I'll try to leave room for it next time. Great diner food and nice friendly waitresses. We can't wait to go back.", "date": "2014-12-28 02:30:39"}
{"review_id": "UX2-J0OxR0gNAYbfUPrg2A", "user_id": "_Bhi59TIR5kSzM66kkDx8w", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "This was our first visit (but not our last!) to The Maple...I read the reviews about the \"best hot beef sandwich around\" and decided to take a little drive to see if the reviews were right. (As we suspected--they WERE!!!) What a delicious, perfectly cooked and assembled roast beef sandwich! Soooo thinly sliced, tender and stacked high on two soft slices of bread...then smothered in a delicious gravy that closely rivals my dearly departed mom's Sunday roast beef. Seriously, if you are looking for a great hot roast beef sandwich--look no further--the best is here!!! Home made mashed potatoes accompany the flavorful sandwich and we also ordered a side of fresh, homemade coleslaw that was a perfect partner to this meal. As if our stomachs could even hold another morsel--we had to try the home made chocolate pie as well. Very good, smooth and chocolatey with a layer of whipped cream on top. The chocolate syrup drizzled on top wasn't needed, as this pie was flavorful without the addition. More whipped cream would be my choice. Our waitress, Diane, was one of the nicest, friendliest and most helpful waitresses we've encountered in a long time! She gave us great recommendations for our next trip to the Maple. The original owner was there celebrating his 95th(!!!) birthday--a dear man who stopped to say hello as he passed by. God bless him--as our waitress said--\"it must be the gravy that keeps him going\"!!! We'll surely be back soon to this quaint little spot.", "date": "2016-12-28 21:33:53"}
{"review_id": "QwujNFaZEdkH13CMw8PVIg", "user_id": "NvJkV0wW-99rtSMflkkBtw", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 3, "funny": 0, "cool": 2, "text": "This local family run business is a step back in time. Friendly service staff and a funky decor make it worth the visit. They specialize in hot beef sandwiches piled high with thinly sliced beef which are then smothered with homemade gravy. All are served with honest to goodness mashed potatoes. A real treat if you love beef! Otherwise there are other options.", "date": "2017-01-11 06:49:47"}
{"review_id": "yBWQjMr4fXBfwMmvOPdxtw", "user_id": "3jjfTmnEBZf29alzMiCogw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great pizza but could you PLEASE open before 6pm...that is just INSANE!!!!! Even 4pm...people with kids eat dinner before 6pm.", "date": "2014-11-06 15:02:44"}
{"review_id": "kCMTVuPMLUDwmTtENEs_zg", "user_id": "IjiXC9ekXkP1I9kdLWogEw", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "A real gem of a place in Ambridge.  The prices were very reasonable and the food was so good.  I had the Chicken Delight and it did not disappoint in any way.  This place has been around for 50+ years and you can see why.  I rather liked the atmosphere too.  Parking is directly across the street.", "date": "2016-03-23 21:50:16"}
{"review_id": "3e_6YX_QffhKz6NV0EAemA", "user_id": "LrqytyCCw_qFjpomyRXlcw", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I came here because it was listed as a best steak salad place by my FB friends. Steak salad was awesome. I have also had tacos and waffle fries which were cold. The rooks grilled cheese with bacon and tomatoe was the best I've ever had.", "date": "2013-03-06 16:14:23"}
{"review_id": "yzIXzhUlJpZfgb7VxfiKmg", "user_id": "zuAt2Htm1-AKs_fXuuOPcg", "business_id": "GI1WxFbY9tJ9-ChRrwnrzg", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "This was an amazing place! We had pepperoni rolls, stuffed cabbage, homemade dinner rolls, haluski, pierogies, and pizza! Everything was amazing!!!!\n\nRose and John are the owners and are just lovely. This made our trip back to PA!!!! \n\nI recommend this to everyone that lives in the area or visiting.", "date": "2014-01-11 23:20:35"}
{"review_id": "hlfjKNDWjnFEUwuDZHLXOw", "user_id": "vxKtYPmJzi2wSfIndm9o8Q", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Loved the hot roast beef sandwich with home made fries. Love going there.", "date": "2016-11-17 18:51:22"}
{"review_id": "9MsVc4WJKxz-Efdn3c2gMw", "user_id": "91koVXu54Y6tIiZKKxVmrw", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of the best places in all of Beaver County!  If you go here you must get the roast beef!  It's famous around these parts. The staff is also very friendly.", "date": "2018-01-28 15:26:51"}
{"review_id": "qnGoKYUvay0-bAS_puirEg", "user_id": "UsYf93Qf7mYCC63GjJrpcQ", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Best pizza I've ever had hands down!  I grew up nearby and always enjoyed their pizza. I left for years and always tried to plan a trip to get some pizza when in town.  I've had pizza from all over including NYC and Chicago and still love my Franks! Now that I've moved back to the area it has become the family favorite!  Perfect , fresh, thin crust, great sauce with just the right seasoning and the cheese.. So fresh and under the sauce of course! Always try to call when they open to order since the waits will be, even then, 45-90 mins. Heart shaped pizzas are great too and hit up the ATM beforehand.. Cash only!", "date": "2014-02-16 19:24:58"}
{"review_id": "jambB71p7J9upq0yO87QNA", "user_id": "PXVt6mYWYhiCPooXpoeORQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Your basic diner food....smothered in delicious gravy and served by pleasant waitresses at a reasonable price.  Lots of homemade desserts too.", "date": "2017-09-25 17:02:44"}
{"review_id": "Ba7pasO-r3sA5aabeNN47g", "user_id": "iLDAIBOVTCyX64Kyid5UXg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "I was going hiking in the snow with my dog so i wanted a huge lunch before i went and my first time here it was way too much food for me. Turkey dinner on Sunday was salad, bread, gravy on side, stuffing, turkey sliced, mashed potatoes and cranberry sauce. Excellent service from young man.  Since it was a snow storm it wasnt too busy open 9am - 8pm daily and until 10pm fri/sat night.", "date": "2015-01-26 22:42:28"}
{"review_id": "9NrIF5Dogo6aeaGZ2xmpzg", "user_id": "Jnnzne2sDt1WLB74WfJNvg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Charming ambiance. Hearty food at reasonable prices. Get the hot beef sandwich, obviously.", "date": "2011-07-17 02:18:24"}
{"review_id": "SqzxlVYe46DHY_ueiC2pAw", "user_id": "r-Brk55Aricqz06b4ddxtA", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 1.0, "useful": 8, "funny": 5, "cool": 2, "text": "This place is not in touch with reality. I recall going here as a child for hot roast beef sandwiches so when I came  home recently my mom wanted to go to Maple. This very old and disgustingly nasty woman was our waitress. My mother ordered a hot roast beef and asked for gravy on her French fries. The waitress stood there and said noting so my mom, thinking the woman did not hear her she repeated herself. The waitress looked directly at my mother and\nSaid \"what makes you think we have to make a special menu for you\". I thought she was kidding but she was serious! Maybe she had dementia, maybe she was a nasty old woman I don't know. But what I can tell you is this actually occurs just as I stated. Its sad and abusive treatment. Shame on you !", "date": "2015-06-26 20:38:27"}
{"review_id": "eybTN6agzTOyGkbpXf1-CA", "user_id": "fM8rythOmJGL-IRsiYdZqg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "When we have friends in town who want local homemade cooking, like hot roast beef, mashed potatoes and a generous side salad; we take them to the Maple Restaurant. Great Food Service and Prices!", "date": "2017-08-03 17:52:11"}
{"review_id": "IXz19LOggUeWkm9fMu-laQ", "user_id": "r98FaAOAoJDCPp384XpcYA", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 5.0, "useful": 5, "funny": 2, "cool": 4, "text": "The hummus! Oh, the hummus!!!\n\nIt's no secret that you can find good pierogies in Ambridge - you're never more than a block or two from a Ukrainian church that'll serve them up year-round.\n\nBut what about awesome Greek food? Can you get THAT in Ambridge?\n\nYes. Yes, oh yes, oh YES you can!\n\nLittle Athen's is located on the corner of 5th St and Merchant, in a little storefront that looks like a pizza shop. But for a little shop, they boast a large menu of Greek delights (and hot dogs and french fries and the like if you've got an 'iffy about Greek food' person in your party).\n\nNo matter what else you get, snag a tub of the hummus. It is garlicky, lightly lemony, so smooth in texture, and it's wonderful with the soft, warm pita bread they serve alongside. The tabbouleh is quite good as well, and the spanikopita... DANG GIRL. It's good stuff. Cheese for days!\n\nPrices are reasonable - most menu items are between 4 and 6 dollars. And the portions are large; you can easily split a single order of the spanikopita with a friend.\n\nSo if you find yourself in Ambridge or passing through, and you're craving the best hummus of your life, stop here and pick up a to-go order. But good luck limiting yourself to just the hummus - once you take a peek at the menu, you'll be having trouble narrowing your choices down!", "date": "2016-10-21 13:50:06"}
{"review_id": "nipVxhUfidqA8SbTNjZDig", "user_id": "hqCCI4v-2ozjyIUXNzFLKg", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Super food! Very well done Greek fare. Very good quality, great  prices. I grew  up near Ambridge, know  their long standing good reputation for excellent  food & service.  I would  highly  recommend  that you look for them at the Green Tree Farmers  Mart & other locations. A wonderful selection of authentic entrees & sides  and fantastic desserts. Very friendly, good people.", "date": "2017-06-02 01:32:43"}
{"review_id": "j0Coxso_r1HsoTK5iIXTBA", "user_id": "7AGLlj5YzqdBfCPiZCa1mQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 9, "funny": 2, "cool": 0, "text": "I'm going 5 since I found no fault with our lunch here today. Boy is this place old school! On the back wall above the doors are numbers from 1-9 that light up and make a \"ding\" sound when a server's order is ready. Most of the servers are older and act like loving grandmothers. \n\nSpeaking of LUV, my Hot Roast Beef Sandwich, one of my favorite comfort foods, was awesome. It was served up fast,with rich gravy, great fries, soft white bread, and a smile. YUMMAY! \n\nI had chocolate cream pie for dessert and it was the best ever. Darren wouldn't let me try his sundae. He said he would but \"forgot.\"  :( Meanie. I'm kidding Sexyman. \n\nEveryone was so, so friendly here. The dark-haired young girl who rang us out was adorable and complimented me on my purse. I would definitely come back and am glad I bookmarked it.  The neighborhood's just fine too.", "date": "2012-01-22 23:32:44"}
{"review_id": "tP5KaGwsF-Obp3MTxgafoA", "user_id": "nB-SEKCWl8NTJOJGuQFs6w", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best pizza around in my opinion. The pepperoni is great!  My husband and I debate on which is better, police station pizza or Franks. Franks to me is the best hands down!", "date": "2016-11-05 00:44:42"}
{"review_id": "TA7d9zLobv6wi0nI1cZ9ag", "user_id": "OrbH-f7wtNJk0O6wXkvqoA", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pizza unlike any other.  I lived in Ambridge for a number of years and went to Frank's as often as I could.  Family owned and operated for over 40 years, it is really incredible.  Good people, good pizza.  Call ahead the night before for quicker service as they do get very busy with the short time they are open.  Always worth the wait, however.", "date": "2015-09-08 13:15:24"}
{"review_id": "w--jXJc1Mkv5z2oZ1L8rMg", "user_id": "PSQ5yyiEe9wEUQFouCeq8A", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "This was a regular place for us to eat. They have one of the best Ruben Sandwiches we've ever eaten! It's the best I've had in years. You should always get gravy with your fries! They breakfast menu is great too. They do get busy but you shouldn't have to wait long.", "date": "2014-04-10 00:41:28"}
{"review_id": "Gq8Naezy28W6ZV9eTaY_7A", "user_id": "iLDAIBOVTCyX64Kyid5UXg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "The 8.99 roast beef with mash potatoe was good, gravy on the side.", "date": "2015-07-22 20:16:30"}
{"review_id": "YgpLi8uVJWb-SV1-OhXMIQ", "user_id": "0WygCUOgOMxucwZsrYru9w", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I love the Maple!  I have never once had a bad meal here, and I've been a patron for at least 15 years.  The Maple resides in a crotchety old building with gleaming wood all around, a written history of the place on the wall {AND the menus!}, and a bunch of awards all around.  One bad aspect for handicapped diners is that the bathroom in down a long flight of steps to the basement, so...go before you go!  They do not take reservations, and if you're bringing a group, they want everyone there before they seat you...but they've make exceptions for my swim class group a number of times.  I agree with one reviewer that a couple servers aren't very friendly, but I found if I'm friendly with them, they reciprocate a little.  Also, bear in mind that some of these women have been there since God was a child, so they're TIRED!  Serving is VERY hard work!  Ahh, but the food...for straightforward home-style cooking, you can't beat this place!!  From the Famous Roast Beef sandwich or dinner to the fish to the pasta, everything just plain tastes good.  And the pies??  Oh, the pies.  Even if you're too stuffed from your meal {and you likely will be because the portions are huge}, TAKE A PIECE HOME!!  I would crawl over broken glass to get to a piece of their coconut crème!  Seriously, do yourself a favor and try the Maple.", "date": "2015-10-16 19:39:23"}
{"review_id": "NzckySOqpeGbmeVumpxRIg", "user_id": "NJOspTE_Ms-b8ACPKY73Ww", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 3, "funny": 0, "cool": 1, "text": "Simple, unassuming, and affordable, but ultimately delicious. \n\nPeople come here for their famous hot roast beef sandwich. The dish is incredibly simple. Roast beef placed between to places of plain white bread, fries on the side, and gravy all over, in the traditional local style. Doesn't get more basic than good old meat and potatoes. Everything was very tasty, especially the gravy and the fries. For less than $10, it is very good values. Service was very friendly.\n\nI'm definitely open to coming back. Some of their other dishes looked good too.", "date": "2015-08-16 18:08:29"}
{"review_id": "PdE-Q3cNjB4PnzGCOcv23A", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Rooks has basic food, not great, not horrible but basic. To sum the place up...short and simple. Rooks is a decent place for food but a great place for the atmosphere. The wait staff and bar tenders are always great. They make you feel like a regular (I guess I'm one..lol)\n\nI usually get the burgers and they are always good, the tortilla soup is great. Prices are not that bad, usually under $10.00 for lunch.", "date": "2009-10-10 04:27:12"}
{"review_id": "HL15F_qUai9LkU4h19o73Q", "user_id": "ttz00j3sMDlNgpRtcHM_wA", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to get Hot Roast Beef, hands down. I always leave the restaurant super stuffed. They have a great selection of food...but I don't suggest the spaghetti. \n\nFavorite dishes: Hot Roast Beef with fries (gravy on all), Chicken Parm sandwich, and Chicken Delight Sandwich", "date": "2010-06-10 01:24:57"}
{"review_id": "IA5Plrt9O-xwD2Bt8-j4hQ", "user_id": "Nw97_9RQOHnoo4Vkzim_Dg", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Such amazing pizza..sometimes you have to wait hours and it's so worth it. They put cheese under the sauce, and I always get extra cheese, which they put on top. Make sure you call and order ahead and time your arrival.", "date": "2015-01-27 15:37:49"}
{"review_id": "ObJ1J3GQ9bdGnzPB3r0pWw", "user_id": "7M2P-xdlDSILMJDZVwVQ9A", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 3, "funny": 0, "cool": 0, "text": "The gravy is amazing.  Combined with the fries also amazing.  It is an old style diner, they do what they do really well.  Should be more places like it.  Reuben is excellent too.  If you want homestyle cooking it's a lot more satisfying than most places in Pittsburgh in spite of what Pat G. suggests.", "date": "2014-12-09 15:07:06"}
{"review_id": "qpcCGjOVOlYHpFPOMl_m-g", "user_id": "67R9H9cvae9VUTYLgEgV9A", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Hadn't been here in a few years so stopped yesterday for a fish sandwich.  Major mistake.  Price had doubled and quality had slipped.  The only thing I can say about the fish is that it was large.  A large thin filet of fish overly cooked served on a plain white bun on an empty plate for $9.50.  I asked for lettuce and tomato and was charged extra.  Ate about a third of the fish and took the rest home for the dogs who rejected it.  Won't be back.  Do yourself a favor and go across the river (I know this is a big deal in Pittsburgh!) to Fratangelo's in Moon Township and get a fish sandwich (\"to go\" only)  Half the price, freshly fried quality fish filet, and served on a Breadworks braided roll. Now that is a good fish sandwich!", "date": "2012-02-18 12:08:13"}
{"review_id": "D35Hw0eyZX0sW--Ht3Revg", "user_id": "vBXdvjjd_bD1-u4NUfR9lA", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 0, "text": "Frank's Pizzeria continues to deliver a top quality homemade pizza at a very reasonable cost.  Frank's Pizza is made with love.  The sauce on top of the cheese is the icing on the cake.  Thick cut pepperoni only adds to the awesome flavor.  The crust is crispy yet so soft on the inside.   Simple ingredients made into a flavorful pie.  Toppings are not baked on unless requested.  Frank's is a weekly staple in our house.", "date": "2011-03-06 22:41:35"}
{"review_id": "0585xvjf0ngjmhhBH7607A", "user_id": "He5cTI8sBgNDKVA5yhEA8Q", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 4, "funny": 0, "cool": 0, "text": "Today was the first time I've been to The Maple Restaurant and I've lived in Ambridge for about a year and a half now and I regret not coming here earlier, lol. I ordered the Tuesday special, The Baked Meatloaf Dinner and it was amazing and the mashed potatoes where on point! It also had a side of coleslaw   that was also amazing and I'm picky about my slaw, lol. The sweet tea was on point as well. Staff was kind and refills where always there when needed.", "date": "2015-11-03 23:13:37"}
{"review_id": "FVjS7N2eo1YqMkZ6ipIa3g", "user_id": "PvdU2IShXhjTJI5NwIbJwQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Out of the way ... not the swankiest area or joint ... but the roast beef is super legit.  Highly recommend monthly ... and it will be hard for me to try other items on the menu the roast beef is so damn good", "date": "2013-09-24 20:02:00"}
{"review_id": "fLzSjsjpYujhZnxl5Po9-g", "user_id": "3x8ivxCBCd4BZDX1jPiokg", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Let me just say I am a wing aficinado and Rooks has it going on. I ordered cajun extra crispy with the fresh cut fries. Celery & carrots w/ blue cheese. The I tried was Great Lakes \"Elliot Ness pale ale very good beer. My wife had the mild buffalo with fresh cut fries celery carrots w/ blue cheese. Her beer leinenkugel \"Summer Shandy\" We will definitely be back.", "date": "2013-05-05 18:18:22"}
{"review_id": "j-KF4tbTMfQMp7r3Gmqf5Q", "user_id": "hDFklQfaTOYPB3vc-oyw9Q", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Simply fantastic! This little family owned joint has the best pizza in the burgh! At first I was a little hesitant to try sauce on top especially since I am not much of a red sauce fan typically. I was immediately hooked after having one bite! I crave franks pizza regularly! Its that unique and delicious flavor that keeps me coming back!", "date": "2011-11-19 03:19:09"}
{"review_id": "irf2Y1eyNlCPl-wdrna8WQ", "user_id": "3xQ9B-tv3D_fCnKRwt0c2w", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Genuinely one of the finest pies around. Make the trip to Ambridge to sample a slice. It's worth it!", "date": "2015-02-24 02:49:38"}
{"review_id": "9V6RnsTvlWKBzPlT_4IhMw", "user_id": "GQz1as9Y9vlovTxiw54BFw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 7, "funny": 5, "cool": 4, "text": "Hands down the best pizza in Pittsburgh. There are a lot of so called pizza places in pgh, (throat clearing) mineos that just don't deliver; both literally and figuratively. It's a drive out to franks, or not if you live north of the city, but well worth the trek. Allow yourself at least 45 minutes from the time your order until you pick it up as franks has very long wait times. Don't be surprised if you call them and they say that your pizza will be ready in 90 minutes. Don't fret, each minute that passes will just bring you one minute closer to a divine pizza experience. They are family owned and only have one size pizza, though you can get a heart shaped guy if that's your thing. Also the cheese is cooked underneath the sauce at franks with the toppings on top of the sauce....mmmmm\n\nIf you weren't already convinced of franks absolute goodness, hear this. Franks actually got me out of a speeding ticket. I was on my way, driving a little faster than I should have when the red and blue lights pierced my eyes in the rear view mirror. The office asked where I was headed, I told him franks. With a smile on his face, the officer replied that if he wrote me a ticket that my pizza would get cold and said oh man, franks is the pizza in the city. He handed me back my license and said drive safe and enjoy my pie. Thanks franks!\n\nDo yourself a major favor and get some franks today!", "date": "2010-12-23 23:00:22"}
{"review_id": "FEiAN5Kni1FaUfJGc66xFw", "user_id": "ABOuNch7iuYBOjjFsxpM1A", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really like this small, local business. The interior is a bit dated but the food is great. The staff is friendly and we never have long for our food. Thumbs up.", "date": "2017-10-08 17:45:25"}
{"review_id": "6fa9kz65q-ubvyqsrcby6A", "user_id": "ymgPMjIYBhFoNoM8Q7wsMA", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I've had a number of items from here during the Saturday night market downtown. (I think they do the summer market square farmers market, too) their food, desserts, and service are top notch! If I'm at the Market I'm working and the people on my tour ALWAYS enjoy their food as well.", "date": "2018-07-04 01:56:20"}
{"review_id": "qAYWRnyd5_17Eit4qo_pLg", "user_id": "fziR1x_8qlHVS9-40Xf2VQ", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wow! Amazing spanakopita, by far the best I've ever had. The portions are generous and the prices aren't bad at all. I'm so glad i found this little gem in the town of Ambridge. My gyro wouldn't even fold in half! I got the chicken and lamb gyro and i could not even pick it up! Haha, i really enjoyed my food & the customer service was satisfactory.", "date": "2017-12-14 20:03:22"}
{"review_id": "El5zSwkujg6CjJN7BMY-EQ", "user_id": "pSdNRbuinKON0LnZdHWTNQ", "business_id": "t_EiW3FlMnFTHyoeVU79xg", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was really excited to visit Rook's under new management. They have expanded the menu. Scrubbed the walls, floors and tables, enhanced the lighting but forgot to train their servers. I could cite specifics but will leave it at... hands on management and daily owner presence will increase the effectiveness of the help. If left to their own, they staff will only strive to meet the minimum standards. I know they can do better.", "date": "2013-03-10 02:47:13"}
{"review_id": "NUjyM24QqOGg7a0crB9ijw", "user_id": "v2hPERrqGGxsfmT293q4mA", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 3, "text": "This is some great pizza. Sauce on top so can be messy. The pepperoni is great and the Stromboli's are awesome also. Great prices. Not a huge amount of toppings but the pizza and sauce are awesome.\n\nIf you never tried Franks I would highly suggest picking some up. I would call in advance though because the wait is usually pretty long.\n\nNothing else to say but don't die without trying this pizza.", "date": "2008-08-03 04:10:57"}
{"review_id": "HpLc0_iXe8hIHhS79rXe9Q", "user_id": "zgQBhM1KePf1iFphbJL3yA", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ate here for the first time ever a few days ago and what great food for a fair price!     The service was great, staff was friendly and service was good too!   The food came out quick and hot.    I had the hit roast beef, and all I can say about it is YUM!!!  Definitely would recommend this restaurant to anyone.", "date": "2017-02-27 20:17:25"}
{"review_id": "gbsS2R7Lo_sbVV_yFsGEdQ", "user_id": "XPkEl6t9Nw3yyGwka8h72Q", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 2, "funny": 0, "cool": 1, "text": "My favorite pizza ever. We get it about once a week, and every single time it is delicious and looks beautiful. It's not greasy, and you don't feel gross after eating more than you should. The freshest pizza around! By far the most consistent place I've been to. I can't recommend it enough!!! Just be cautious about the wait times - on busy evenings, it can be well over an hour.  This holds a special place in my heart!", "date": "2017-04-18 22:22:22"}
{"review_id": "fdaxo0HPoefw9nfb395yrQ", "user_id": "40V3xrH5xCtw0jBHLFBMyQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 4, "funny": 1, "cool": 1, "text": "I'm giving this place five stars because it's about as good as hometown goodness can get - a true 60's diner experience. \n\nA Maples roast beef sandwich is something that you have to experience if you live in Pittsburgh - that hot beef with crispy fries and gravy all over is a 'burgh must - so traditional and so damn good.\n\nThe servers move fast and get you your meal (and if you're smart a slice of delicious homemade pie and some good 'ol diner coffee) as quickly as possible - so if you want to stop in for a quick bite and some Pittsburgh history - visit Maples - and get a hot beef sandwich :-)", "date": "2014-05-03 14:42:36"}
{"review_id": "HCGDsux4P7VfIdrA3KTEYQ", "user_id": "kbiDmK1tFKHJx_rerKHjEg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 3.0, "useful": 3, "funny": 1, "cool": 1, "text": "My friends and I were in the area and read the yelp reviews for this restaurant.  We all ordered their specialty roast beef and it was very good -- not great but good.  The problem with this diner is the service.  Our first server threw down our silver ware and completely ignored us when we said hello.  Luckily she was replaced by another server who was much nicer.  While the food stood up to the test, doubtful I'd come back for the experience.", "date": "2016-04-21 16:13:23"}
{"review_id": "56AI5RNlApxC7OyGVgywKA", "user_id": "m5S0MzB5x4ufSRc0JEC8cQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Great family restaurant! Had the fish sandwhich, and it was huge!! Very tasty. Husband had a burger, and said it was also very good. Very accommodating to families with small children. A little pricy, but a nice place to go if you want to stay local.", "date": "2015-11-02 21:50:12"}
{"review_id": "zJQyqR83LxhyAVvT2J44xQ", "user_id": "SW_GcV2C7--_VpKNeL3mhA", "business_id": "GI1WxFbY9tJ9-ChRrwnrzg", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "John and Rose run a first class, hometown restaurant.  Most of the food is homemade and well prepared.  The only item I had that was not was the Pierogies, but otherwise it was all very good.  The atmosphere is wonderful.  Rose is the baker and John is the cook and bartender.  \n\nI would return to this place in a heartbeat.  Don't expect this to be a gourmet restaurant, but a hometown restaurant with an adequate bar.\n\nNot many seats in the place, thus, if you have a larger group, you may want to inquire about the party room in the basement ahead of time.", "date": "2014-01-14 19:30:54"}
{"review_id": "KFVtJAoikJrLziZ1JNDSgA", "user_id": "vCMLDTmNQJTshp0buV1JaA", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I usually catch Little Athens on Fridays in Mellon Square for lunch.  Their Greek Lemon Soup is phenomenal.  Their stuffed grape leaves are huge and tender.  As a fellow Greek I can say that I have tried a lot of different Greek food from actual Greek restaurants in Greece to moms home cooking and little Athens rivals them all.  If you work downtown I highly recommend checking them out Fridays in the summer in Mellon Square. You will be in for a treat compared to the regular selection downtown.", "date": "2017-06-02 20:15:43"}
{"review_id": "dULfLX4hGhpqoWb9g1uatw", "user_id": "rCWrxuRC8_pfagpchtHp6A", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 25, "funny": 7, "cool": 13, "text": "Note: Maple Restaurant's parking lot is directly across the street. Street parking is also available if the lot is full. \n\nMaple Restaurant celebrates its golden anniversary next year, and I certainly wish it enough longevity to earn a 10 carat diamond. \n\nWhen you first walk in, you get the impression that this diner has remained in a state of suspended animation since it opened in 1963. Aside from a few young employees, even the help was past middle-age and thus seemed to be profoundly loyal. I overheard one waitress proudly tell a customer that she had been with Maple Restaurant for 17 years. Even before we entered MR and waded through the heavy, thawing snow on quaint Maplewood Avenue (I didn't find it at all 'sketchy') early this bright afternoon, I could tell that WQED's Rick Sebak would have great fun filming a segment here.\n\nOur waitress, who served up our food in mere minutes, fussed over us as if we were her grandchildren, watching happily as we gobbled up plates of comforting chuck wagon victuals. \n\nBurgundy MR t-shirts, which are worn by the staff and can be purchased by patrons, are emblazoned on the back with \"America's #1 Hot Beef Maker.\" Roast Beef is their staple and can be had in a number of variations. \n\nKay loves hot roast beef sandwiches and ordered accordingly. She did let me try the mashed potatoes, and to me they only confirmed that the mashed potatoes  we had last night on a Dad's Pizza (of Beaver Falls)  pierogi pie were in fact instant. MR's mashed spuds were fluffy but not overly so, had just enough lumpiness, and did not have one hint of the aftertaste found with instant synthetic potato flakes; MR's are the real thing, and for that I was grateful. \n\nI almost ordered a Maple Burger, a burger that has their signature roast beef on it as well as a \"special sauce,\" but our server advised against it, telling me that she \"don't care for that one.\"\n\nMan, I love an honest server.\n\nWhen I put my finger on Big Charley, she nodded in approval.\n\n\"You're gonna like that one,\" she said with a smile as huge as the clear, blue sky above. \n\nAnd like it I did. My only real complaint with the sandwich was that the roast beef got somewhat dry towards the end, but the nicely liquefied cheese, caramelized onions, fresh, beefy tomato, snappin' BBQ sauce, and toasty bun more than made up the difference. The fries that came with it were soft, crisped, bronzed, salted excellence. \n\nI got a taste of Kay's Chocolate Cream Pie, and found that whipped cream definitely works better than meringue (I'm lookin' at you Dick's Diner of Murrysville), with this sort of dessert. \n\nI yet again went with a hot fudge brownie sundae, one that MR calls the Maple Sundae (?), and it was up to the same level I have come to expect from such an unheralded treat. The chewy, igneous brownie was buried under vanilla ice cream and a lake of equally decalescent fudge. \n\nIf you're ever hungry when traveling on Route 65, and it's not too late, give Sheetz or Eat 'N Park a pass; try Maple Restaurant instead for a home-cooked, mom/pop change of pace. Let's help keep them in the black and sustain a part of Americana along with it.", "date": "2012-01-22 22:23:24"}
{"review_id": "xyCjIKFDCIBVzN6QobhIcw", "user_id": "s-763p9_uqI8vr_0O_ToFQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was not really a roast beef fan...until I came here!  An older restaurant but pleasant staff and delicious roast beef!  The hot turkey is excellent as well!  I wish they had a kids menu though", "date": "2018-09-04 01:33:12"}
{"review_id": "VJAax-CB1uo3-FnWZO5yeA", "user_id": "IE8-TRdT-Osv8w9fiHDZhQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "I'm not sure why there's so much love for this place. Someone else described it as \"cafeteria-style food\", and that seems pretty accurate. If you think that school cafeteria food is fantastic, you'll love this place. \n\nIt wasn't awful. The food was plentiful and hot, and the dishes were clean. The fries were hot and crisp, at least in the places that they'd not been left to soak in the gravy. The \"famous\" roast beef wasn't anything special, especially served on supermarket white bread with what tasted like very salty canned gravy. We also got a reuben (my partner and I split two sandwiches) which was ok, but nothing special--the corned beef was nothing more than deli-style corned beef; the swiss cheese was plastic-y tasting. \n\nWe passed on dessert--the meal was both filling and underwhelming enough that we were ready to move on. \n\nThe neighborhood isn't at all threatening, I don't think, but it does seem sketchy--I was panhandled in the parking lot, and that area of Ambridge has a lot of empty storefronts and boarded-up windows. It's not the most inviting area, and I'm certainly sympathetic to people who're left somewhat unsettled by it.\n\nThe Maple Restaurant is a local landmark, but I think that at this point, it's more due to nostalgia than it is great food.", "date": "2013-03-15 02:05:52"}
{"review_id": "Oji_rPfkAQpARgBTJsO9Xw", "user_id": "H5d_nFqzwrREE-YduK2ABg", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 9, "funny": 0, "cool": 2, "text": "\"You gotta go to Frank's\".  \"Frank's is the best pizza ever\".  \"Frank's won top honor's in another pizza contest.  I'm telling you, Frank's is the best\".  Okay, after hearing this about a hundred times, I decided to try Frank's.  I mean, Ambridge isn't far from where I live.  But Ambridge also isn't exactly the most exciting destination.  So after reading the \"history\" of Frank's on their website, we knew had to go.  We love those old time businesses and delight in the stories of how they were hatched.\n\nWe decided to try them on a recent Monday night.  Apparently call ins are advised of a 45 minute pizza, while walk in's are 15-20 minutes.  We ordered a simple pepperoni pizza.  While we waiting, it was fun to watch the family work in the kitchen.  Father, two daughter and grandma.  And talk about busy!  There was a steady trail of customers in and out the door the entire time we were there. \n\nI wanted to try the pizza the minute we got in the car.  But it was much too hot.  I had to wait until we got back to Cranberry.  It was worth the wait!   The crust is amazing.  So soft, yet crispy on the outside.  I can't say enough good about that crust.  It could only be better if it was whole wheat.  The sauce is awesome.  This is the kind of pizza that I call wet pizza.  The sauce is still liquid even after the pizza is cooked.  The pepperoni is thick and yummy.  This pizza is definitely one of the best!", "date": "2011-11-24 15:42:21"}
{"review_id": "2dxaDbKLOakLa9asLSzkjQ", "user_id": "CdiR6iA2LndH1m4atajOwg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 1, "text": "I have been eating here since My wife introduced me to it in 1999.  I keep wanting to eat something other than the hot roast beef with fries but I can't. It is just too good. Ask if they have rice pudding if you want a special treat.", "date": "2013-02-20 16:32:42"}
{"review_id": "nh1utE38KRRNjkHfB-vKtA", "user_id": "rgv6tZTDnbJMLYi9OXngoQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time trying maples. My only regret is that I didn't come here on my first day arriving to Pittsburgh (might have eaten here every day) I didn't even look at the menu other than to read the history behind this amazing restaurant. Had the roast beef sandwich. Absolutely wonderful. Service was terrific. Going back today before we fly home.", "date": "2017-09-19 13:23:45"}
{"review_id": "7LnBm5Rfw7LXCQPsNfBxhQ", "user_id": "4U0QkDC1J4BOKLbdygMi2w", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Frank's is one of the BEST pizza places in the city!!! Definitely top 3!!! \nThe wait times can sometimes be long.. An hour is average.. But it's definitely worth the wait for delicious, fresh baked pizza. It doesn't even compare to other places in the area!!!", "date": "2014-02-04 17:03:28"}
{"review_id": "7INh0a5fjOGF0zFPdIoPMQ", "user_id": "3xBFFH866WoySDG7uuwBSQ", "business_id": "KLptkOv3OiNSTU4unZv9Sg", "stars": 4.0, "useful": 4, "funny": 0, "cool": 0, "text": "They say the food is really good  when they cater I stopped in the store there's nothing in there but a couple racks of Greek deserts. They do have a good deal on gyros every Monday from 3pm to 7pm for $3.00.they also have a big menu of Greek specialties. I tried the lame gyro it was excellent.", "date": "2018-07-25 13:17:18"}
{"review_id": "Pyzj_2gynw2bonjPAL-RPg", "user_id": "391zaCfgqkE_4WM3Up-z9Q", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Fish is great.  Roast beef sandwich with fries and gravy is excellent.  A classic diner when you are near Ambridge.", "date": "2017-05-12 20:55:14"}
{"review_id": "TW6mZzX3nK4J7ekotDALQQ", "user_id": "pCUApgpQLmYwTEzT6FToFw", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Like I've stated in many reviews before. My wife and I are pizza snobs. We try pizza all over the place and have done so for nearly 25 years. This is my number one pizza ever. Yes, we've ate Pizza House and Mineos but this is clearly better. The pizza is made upside down. This means the cheese is under the sauce. If you google this, all the great pizza places do this. It allows the sauce to hit your taste buds first. And believe me. You want this. Their sauce is amazing. All of their toppings are top notch. Thick pepperoni. Not those little cheap greasy disks. REAL pepperoni. The cheese is so good and the crust. Just go there. Don't walk. RUN. You'll thank me. Seriously.", "date": "2017-04-14 20:54:15"}
{"review_id": "dfeKxPDQ_s56L0njbqMnug", "user_id": "wFFLWorAWh3hpxVLQP8YWw", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Great stuffed pork chops thursday special, I always try but I'm usually too late for 'em.  I made it this time. My great grandkids usually go for the spaghetti which I'm not big on but I love the meatballs so I often  swipe them to take home makes a great lunch for next day. This place is lost in time, nothing changes except for some modernization in the kitchen every so often. The nostalgic  pictures around the cash register area are great, I always seem to find something or someone I haven't noticed before.", "date": "2017-07-04 23:32:53"}
{"review_id": "mcZ_RanEnG8dDy0dYvN5Gg", "user_id": "01vXmAJKQ41PVi2wgYDiPA", "business_id": "muFJIZKZwbAfy_pEFKF_pw", "stars": 2.0, "useful": 3, "funny": 0, "cool": 0, "text": "Pizza is always good. Service is slower than I'd like. Lady at the front adding toppings was wiping her hands on her smock and fixing her hair, and sneezing and wiping her nose without washing her hands and handling the food. This grossed me out.", "date": "2016-03-06 00:32:18"}
{"review_id": "XS2VZhdqdCrRxy-pk9vDFQ", "user_id": "QGgWWhEi5R4SLAKN-xwtNQ", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 3, "funny": 0, "cool": 0, "text": "Mmmmm.... The hot roast beef with fries and lots of gravy is wonderful. I always try this dish at other restaurants around the country and none compare to the maple restaurant.  They have adequate parking just across the street and servers are nice with a diner type feel. Definitely recommend!", "date": "2014-03-31 18:25:33"}
{"review_id": "W18eRtT4LnDKHfqbyLZM5Q", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "-InU2nAbC9AuS-Um2Cowgw", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "This was my first time at Maple Restaurant. I got the Hot Beef Sandwich with mashed potatoes and gravy all over...wow. I had heard how great this place was but after trying it for myself, I completely understand all of the rave reviews. The service was quick and my waitress was very pleasant. I look forward to eating here again soon!", "date": "2017-06-26 16:56:34"}
{"review_id": "MI9w3SU78LjHXyrXP6SHMw", "user_id": "wFFLWorAWh3hpxVLQP8YWw", "business_id": "XJfvPt-8f-6d5Foaz_HYLQ", "stars": 4.0, "useful": 6, "funny": 0, "cool": 2, "text": "All the cliche's fit Great little hometown mom and pop resteraunt. The decore is plain like something out of a 1950's movie somehow familiar, friendly and reassuring. Great selection of hone made soup and specials change daily. Omelets are huge and expertly done and French toast my favorite  Staff is sparce but very attentive. Quick service so forget fast food this is the place for breakfast. Always  seems to be an old friend or two in there when I come in willing to swap stories about cars or local politics.", "date": "2017-01-28 20:45:59"}
{"review_id": "fFYjv_1A_6ZiaKSpmVD8qw", "user_id": "3FjdHwnoz-vfw6hBBtckqg", "business_id": "xM8dVGLkYaL94EuAIkjMEA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I attended a local school that was near the site of one of the other Harmonist settlements, so I've learned about the Harmonites before.  I actually learned a lot more on the Old Economy Village tour, which is reminiscent of tours that I've taken in Colonial Williamsburg--which is a much older and larger historic tour site.  Old Economy holds its own!  For a reasonable admission price (less if you have AAA), you get a decent length of touring time and can even explore a bit on your own later if you'd like.  It's a great way to learn about the once thriving area before the decline and eventual end of the Harmonist society (celibacy will do that to you...)  I look forward to going back for their seasonal festivals.", "date": "2016-10-28 12:58:43"}
{"review_id": "lI_A5Xvw7ubyNcpKWV-sbg", "user_id": "UtkjXTiMfGRz4R1zDF3Kxg", "business_id": "xM8dVGLkYaL94EuAIkjMEA", "stars": 4.0, "useful": 8, "funny": 2, "cool": 4, "text": "It's pretty hard for me to come up with an adequate star rating for Old Economy Village.  It is an historic district, but it's a little \"dry\"--once you've seen it, you've seen it.  It's worth going to once, but you'll probably only return either 1) when you have out of town guests, or 2) when there are special events.  I give it four stars because it is presented well, and the staff is very good and knowledgeable.\n\nMy husband Rick and I went here last Saturday Evening (12/6/2008) for the annual Christmas At the Village.  Christmas here is wonderful!  The village is decorated in a 19th Century German style.  They have music, crafts, traditional German food (which is cooked by a local church), crafts, and family events.  They also have the \"Weihnachtsmarkt\" which sells unique handmade gifts made by local craftsmen.  I bought a few for stocking stuffers.  Another Chirstmas event (which we didn't make this year) is \"Christmas with Belsnickel\".  \"Belsnickel\" is the \"Dark Santa\" and it's his job to see if you are gonna get candy or coal in your stocking!\n\nJust a little bit of history about this place.  It was settled by the Harmony Society, a 19th-Century religious communal society.  The Harmonists were a very successful industrious people.  They created and adapted new technologies for textile manufacturing and agriculture.  They were early users of steam power in industrial uses. \n\nThe village consists of the Museum Building and Feast Hall, where communal feasts were held.  The Community Kitchen was where communal feasts were prepared.  Other buildings include the Cabinet Shop, the Blacksmith's Shop, the Grainery, the Warehouse, and the Community Store.  At the Community Store, non-Harmonists could buy Harmonist cloth.  The store also sold everyday items brought in from Pittsburgh and Philadelphia.  The Visitor's Center is the main museum for the village.\n\nI should mention that the Harmonists were a sect and as a result, had some \"unusual\" beliefs.  You could even consider them early practitioners of Socialism.  And if you want to learn more, visit Old Economy Village's website www.oldeconomyvillage.org.", "date": "2008-12-11 14:20:12"}
{"review_id": "o9p3zD6wMvizGZ5HqQzwyQ", "user_id": "lL9Sppyk-mzNGJ5Uloz5-g", "business_id": "XJfvPt-8f-6d5Foaz_HYLQ", "stars": 4.0, "useful": 2, "funny": 0, "cool": 0, "text": "Always have been wanting to stop in this place but haven't had an opportunity because it's a Breakfast/Lunch establishment. Glad I finally did. Ordered a Breakfast Burger and it was very good. All ingredients seemed fresh and the service was excellent. The menu is limited but that's not necessarily a bad thing. Additionally the place is very clean. I'll definitely be back to this little Mom And Pop establishment.", "date": "2016-09-07 16:24:35"}
{"review_id": "C_XoA4O_SivxlXus0aKawg", "user_id": "kiWPm6uCidjGbsolfqEkvg", "business_id": "xM8dVGLkYaL94EuAIkjMEA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was just recently given a tour of Old Economy Village, and loved every minute of it. My tour guide, Barb, was fantastic and very passionate about the history of the Harmonist Society and what they have left behind. This was my first visit to the site and I did not realize the extent of the village. My personal favorite building of the tour was the wine cellar and the sample of bread that came from the outdoor oven (the whole tour is very interactive).The Feast Hall was also impressive and the acoustics were amazing. All in all, it is hard to pick a favorite because all of the buildings on the tour were interesting in their own ways and really depict the wealth of history that is embodied by Old Economy Village. I recommend this attraction for all ages!", "date": "2017-06-07 18:30:48"}
{"review_id": "_mw0xf5enQSEUMUAoIiLZg", "user_id": "voyChD-aoglG2mWMySA6Ow", "business_id": "xM8dVGLkYaL94EuAIkjMEA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have to recommend spending the afternoon at Old Economy. They show you a movie on the community and a tour for $10 each. Our guide Chloe was fantastic. She was a wealth of knowledge. She made the experience fun.", "date": "2015-11-07 22:25:16"}
{"review_id": "iKcapQ8yQ1PyVj2aZ7qEuQ", "user_id": "QPPgrlRtln6lbf9TRkzxLA", "business_id": "xM8dVGLkYaL94EuAIkjMEA", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We held our wedding in the garden at Old Economy Village in July, and it was beautiful. The garden was well-kept, and Sandy (who did all the arrangements) was so helpful in the entire process, as well as on the day of the wedding. It was an affordable venue that all of our guests loved!", "date": "2017-08-23 23:19:12"}
{"review_id": "1rYRDNCQMue4ptTfVw1NRA", "user_id": "8lCl40obN7k8v-wc4dAaiA", "business_id": "XJfvPt-8f-6d5Foaz_HYLQ", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "For years and years there was no place in Ambridge to get a really, really great breakfast.  Then I stumbled upon the Breakfast Shoppe.\n\nThis place is great in every way.  The service and the food are top-notch.  It's as though they really care about what they are doing, while so many other local restaurants just slop things together.\n\nI recommend it highly.", "date": "2018-03-11 17:17:48"}
{"review_id": "G6HnqzjaG3Jcb_NlfyNcbg", "user_id": "mLoENT0k1il695DIcPCdGA", "business_id": "XJfvPt-8f-6d5Foaz_HYLQ", "stars": 5.0, "useful": 2, "funny": 0, "cool": 2, "text": "Good service. Low Prices. Food was really good.\n\nDefinitely a really good place to go for breakfast or lunch.\n\nNot a lot of friendly places in that area. This one stands out though.", "date": "2018-05-14 12:50:38"}
{"review_id": "za8LmQuhQbpnmym_rS8t9Q", "user_id": "8AwcaBJjiMpQ__FPxktwwQ", "business_id": "xM8dVGLkYaL94EuAIkjMEA", "stars": 5.0, "useful": 9, "funny": 2, "cool": 6, "text": "Ever since Zombo at WRCT Radio made this his personal cause célèbre, I have been a true fan of Old Economy Village.  The Harmonists are a fascinating movement, and the Village was left pretty much intact and in 1919 became a state historic site.  \n\nYou will be fascinated by the gardens, the wine cellar, seventeen restored historic structures in all, that tell the story of this fascinating religious cult. \n\nThe guides are well trained and passionate about the subject.  There are 6 acres and lots of things to learn about, I highly recommend.", "date": "2018-06-28 17:10:21"}
